Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."到此寒天雪地，不知有何指教？", 1, 0)  --对话
Cls()  --清屏
TalkEx("我正在寻找一些书籍，无意间路过此地，敢问兄台尊姓大名？", 0, 1)  --对话
Cls()  --清屏
TalkEx("在下胡斐。", 1, 0)  --对话
Cls()  --清屏
TalkEx("哦？就是人称\"雪山飞狐\"的胡斐吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不敢，正是在下。", 1, 0)  --对话
Cls()  --清屏
TalkEx("听说大哥刀法变幻莫测，轻功也有如飞天狐狸般的敏捷。", 0, 1)  --对话
Cls()  --清屏
TalkEx("江湖上的朋友过誉了。唉……", 1, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("胡大哥似乎有什么心事？不妨说出来，看看小弟能否帮上什么忙。", 0, 1)  --对话
else
	TalkEx("胡大哥似乎有什么心事？不妨说出来，看看小妹能否帮上什么忙。", 0, 1)  --对话
end
Cls()  --清屏
TalkEx("不瞒贤弟。我有两件心事，一是要报杀父之仇，二是要寻找我家丢失的刀谱。", 1, 0)  --对话
Cls()  --清屏
if instruct_9() then  --是否要求加入
	Cls()  --清屏
	if JY.Person[0]["性别"] == 0 then
		TalkEx("这两件事的确不好办。我看不如这样吧，我正在寻找一些书，要在江湖上到处走动，胡大哥如果不嫌弃，不妨与小弟同行，说不定可以得到你想要的消息。", 0, 1)  --对话
	else
		TalkEx("这两件事的确不好办。我看不如这样吧，我正在寻找一些书，要在江湖上到处走动，胡大哥如果不嫌弃，不妨与小妹同行，说不定可以得到你想要的消息。", 0, 1)  --对话
	end
	Cls()  --清屏
	TalkEx("既然如此，恭敬不如从命。", 1, 0)  --对话
	Cls()  --清屏
	if instruct_20() then  --判断队伍是否已满
		Cls()  --清屏
		TalkEx("你的队伍已满，我就直接去小村吧。", 1, 0)  --对话
		Cls()  --清屏
		instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
		instruct_3(70, 5,1,0,101,0,0,5166,5166,5166,-2,-2,-2)  --修改场景事件
		instruct_3(3, 9,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
		instruct_3(3, 12,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
		instruct_3(3, 11,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
		instruct_3(3, 10,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	instruct_10(1)  --加入队伍
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
	instruct_3(3, 9,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 12,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 11,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 10,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("这两件事的确不好办。我也无能为力，在下告辞。", 0, 1)  --对话
Cls()  --清屏
instruct_3(0, -2,-2,-2,2,-2,-2,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
