if instruct_16(1) == false then  --是否在队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(2)  --增加品德
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
TalkEx("奇怪，头怎么这么重……*莫非……", 0, 1)  --对话
Cls()  --清屏
instruct_27(-1,5994,6012)  --显示人物动画
instruct_14()  --场景变黑
instruct_22()  --内力为0
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,5168,5168,5168,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("原本预备对付苗人凤的悲酥*清风，居然先让你受用了！", 4, 0)  --对话
Cls()  --清屏
instruct_27(-1,6026,6036)  --显示人物动画
TalkEx("你……你……", 0, 1)  --对话
Cls()  --清屏
TalkEx("江湖上最近盛传有个年轻小*毛头到处找\"十四天书\"，*想必就是你吧？*找到几本书啦？*快交出来。", 4, 0)  --对话
Cls()  --清屏
TalkEx("你真卑鄙。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我阎基做事向来只求结果，*不问方法。怎么？还不拿出来，要大爷*我亲自动手吗？要知道书对*死人是没有意义的。", 4, 0)  --对话
Cls()  --清屏
TalkEx("倒要看看死的是你还是我。*胡大哥，我们上。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好！", 1, 1)  --对话
Cls()  --清屏
if WarMain(1, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_13()  --场景变亮
Cls()  --清屏
instruct_2(199, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("这……这是……这是我苦寻*多时的胡家刀法的缺页！", 1, 1)  --对话
Cls()  --清屏
TalkEx("阎基，为何你家中有胡家刀*法的缺页。", 0, 1)  --对话
Cls()  --清屏
TalkEx("胡家刀法，哦！那是我年轻*时在沧州无意间所获得的。", 4, 0)  --对话
Cls()  --清屏
TalkEx("你为什么有我胡家刀法的缺*页？", 1, 1)  --对话
Cls()  --清屏
TalkEx("原来胡一刀的后人长这么大*了。", 4, 0)  --对话
Cls()  --清屏
TalkEx("小时候平四叔曾告诉我，当*年害死我父亲的，一个跌打*医生也有份，*不但如此，那跌打医生后来*还撕去几页胡家刀法。*莫非。。。那个人就是你！", 1, 1)  --对话
Cls()  --清屏
TalkEx("既然你们认出来，我也就没*什么好隐瞒的了。*没错，那跌打医生就是我。", 4, 0)  --对话
Cls()  --清屏
TalkEx("你为什么要帮苗人凤要害死*我父亲。", 1, 1)  --对话
Cls()  --清屏
TalkEx("谁叫《雪山飞狐》一书在他*那呢？当初若不是让他们俩*傻呼呼的拼斗，又在苗人凤*剑上喂点毒药，我怎么能坐*收渔翁之利呢？", 4, 0)  --对话
Cls()  --清屏
TalkEx("可恶的家伙，替我父亲偿命*来。", 1, 1)  --对话
Cls()  --清屏
TalkEx("若不是有准备，我怎敢说出*这些。**小娃儿，再试试我的新玩意，*天下至毒的\"七心海棠\"。", 4, 0)  --对话
Cls()  --清屏
if WarMain(2, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(207, 1)  --得到或失去物品
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
do return end
