if instruct_43(220) == false then  --判断是否有物品
	TalkEx("我要做食神，你知不知道食*神秘笈到底在哪里？", 89, 0)  --对话
	Cls()  --清屏
	TalkEx("还有这种秘笈？*没听说过……", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("那我再到别的地方找找。", 89, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(22, 5,1,0,1010,0,0,7024,7024,7024,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

end
TalkEx("食神秘笈！你在哪里找到的*？可不可以让给我？", 89, 0)  --对话
Cls()  --清屏
TalkEx("不行，这可是我千辛万苦才*找到的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那这样好不好，我加入你的*队伍，帮你做饭，你把食神*秘笈借给我看。", 89, 0)  --对话
Cls()  --清屏
TalkEx("嗯，听起来不错。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 79,1,0,990,0,0,7024,7024,7024,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(89)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 89, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 44,1,0,193,0,0,7024,7024,7024,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
