TalkEx("这酒好香啊！", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("呵呵，小兄弟也喜欢这杯中之物吗？那你且来说说看，我饮的这是什么酒？", 88, 0)  --对话
else
	TalkEx("呵呵，小姑娘也喜欢这杯中之物吗？那你且来说说看，我饮的这是什么酒？", 88, 0)  --对话
end
Cls()  --清屏
TalkEx("甘甜可口，清冽芳醇，喝上一口沁人心脾，如果在下猜得不错，这必定是梨花酒。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，不错不错；唉，可惜可惜！", 88, 0)  --对话
Cls()  --清屏
TalkEx("既然在下猜得不错，先生为何连说\"可惜\"？", 0, 1)  --对话
Cls()  --清屏
TalkEx("只有好酒，却无好器皿，岂不可惜？", 88, 0)  --对话
Cls()  --清屏
TalkEx("请教先生，这器皿有何讲究？", 0, 1)  --对话
Cls()  --清屏
TalkEx("白乐天杭州春望诗云：红袖织绫夸柿蒂，青旗沽酒趁梨花。杭州酒家卖这梨花酒，挂的是滴翠似的青旗，映得那梨花酒分外精神，饮这梨花酒，自然也当是翡翠杯了。", 88, 0)  --对话
Cls()  --清屏
TalkEx("先生高明，在下受教了。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,1015,1016,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
