TalkEx("来来来，最近有没有学会新武功，跟老顽童来玩两招。", 64, 0)  --对话
Cls()  --清屏
TalkEx("前辈，我带你去见一个人。", 0, 1)  --对话
Cls()  --清屏
TalkEx("去见谁啊？", 64, 0)  --对话
Cls()  --清屏
TalkEx("我说出此人的名字来，你可不许拂袖便走。", 0, 1)  --对话
Cls()  --清屏
TalkEx("世间我有两个人不见。一位是段皇爷，一位是他的贵妃瑛姑。除了这二人之外，我老顽童谁都见得。", 64, 0)  --对话
Cls()  --清屏
TalkEx("＜看来只有使个激将之计＞原来你曾输在他们手里，武功不及，因此害怕见他们。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不是，不是！老顽童行事卑鄙下流，对不起他二人，因此没脸和他们相见。段皇爷甚至连皇帝也不做而去做和尚，可见我实在对不起他之极了。", 64, 0)  --对话
Cls()  --清屏
TalkEx("一灯大师之所以出家，是为了对你不起，不是你对他不起，难道你不知道么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("他有什么对不起我的？", 64, 0)  --对话
Cls()  --清屏
TalkEx("只为旁人害你儿子，他狠心见死不救。", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么我的儿子？", 64, 0)  --对话
Cls()  --清屏
TalkEx("你和瑛姑生的孩子啊！", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么！我有儿子！", 64, 0)  --对话
Cls()  --清屏
TalkEx("周老前辈，瑛姑如此这般思念你，你始终不肯和他相见，于心何忍？", 0, 1)  --对话
Cls()  --清屏
TalkEx("她在那里？", 64, 0)  --对话
Cls()  --清屏
TalkEx("他现正居住在黑龙潭，在铁掌山的南边。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(21, 11,1,0,1052,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("咦，老顽童呢？怎么一溜烟的就不见了，希望是去找瑛姑了。", 0, 1)  --对话
Cls()  --清屏
instruct_37(3)  --增加品德
do return end
