if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，谢谢你的帮忙，否则我会后悔一辈子。", 64, 0)  --对话
else
	TalkEx("小姑娘，谢谢你的帮忙，否则我会后悔一辈子。", 64, 0)  --对话
end
Cls()  --清屏
TalkEx("那里，以后还请前辈多指点武功才是。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那有什么问题，改天到我百花谷来，我教你一套”左右互搏之术”。", 64, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(20, 4,1,0,1050,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
instruct_3(20, 13,1,0,1051,0,0,6158,6158,6158,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
Cls()  --清屏
do return end
