if instruct_16(35) == false then  --是否在队伍
	TalkEx("公子来到我们云南五毒教，*不知有什么事？", 25, 0)  --对话
	Cls()  --清屏
	TalkEx("久闻五毒教大名，蓝教主貌*美风骚，在下特来拜见。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("呵呵，你称赞我美貌，那可*要多谢你啦。", 25, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("这位可是令狐公子？", 25, 0)  --对话
Cls()  --清屏
TalkEx("正是在下。不知姑娘是……？", 35, 1)  --对话
Cls()  --清屏
TalkEx("我是你好朋友的朋友，也就*是你的朋友啦。我知道你深*受重伤，就用我们苗家的办*法帮你治一治。", 25, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_48(35,100)  --增加生命最大值
instruct_13()  --场景变亮
TalkEx("你的病我虽然治不好，但给*你送了这许多血，是大有好*处的。令狐公子，你瞧我很*老了，是不是？", 25, 0)  --对话
Cls()  --清屏
TalkEx("谁说你老了？你一点都不老*，要是你不生气，我就叫你*一声妹子啦。", 35, 1)  --对话
Cls()  --清屏
TalkEx("你真好。怪不得，怪不得，*这个不把天下男人放在眼里*的人，也会对你这样好。", 25, 0)  --对话
Cls()  --清屏
TalkEx("你若真的说我好，干嘛不叫*我令狐大哥？", 35, 1)  --对话
Cls()  --清屏
TalkEx("呵呵，令狐大哥！", 25, 0)  --对话
Cls()  --清屏
TalkEx("好妹子，乖妹子。", 35, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,1054,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,1,0,0,0,0,2286,2286,2286,-2,-2,-2)  --修改场景事件
do return end
