if instruct_16(73) then  --是否在队伍
	TalkEx("凤凰，我现在帮着这位"..JY.Person[0]["外号"].."一起寻找天书，你也来帮忙吧。", 73, 1)  --对话
	Cls()  --清屏
	TalkEx("是，我听圣姑的。", 25, 0)  --对话
	Cls()  --清屏
	instruct_3(104, 42,1,0,951,0,0,6804,6804,6804,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		instruct_14()  --场景变黑
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		instruct_13()  --场景变亮
		instruct_10(25)  --加入队伍
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去小村吧。", 25, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 28,1,0,113,0,0,6804,6804,6804,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

end
if instruct_16(35) then  --是否在队伍
	TalkEx("呵呵，令狐大哥！", 25, 0)  --对话
	Cls()  --清屏
	TalkEx("好妹子，乖妹子。", 35, 1)  --对话
	Cls()  --清屏

end
TalkEx("蓝教主可愿和在下一起闯荡江湖？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们是日月神教的属下，我要听圣姑的。", 25, 0)  --对话
Cls()  --清屏
do return end
