TalkEx("你这"..JY.Person[0]["外号2"].."，挺有两下子的，过的了我的万鳄潭，很好。咦！我看你手长足长，脑骨后秃，腰胁柔软，跟我非常像，真是学武的奇才。快磕头，求我收你为弟子。", 44, 0)  --对话
Cls()  --清屏
TalkEx("有没有搞错，看你呆头呆脑的，还要我拜你为师。我看你拜我为师还差不多。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你这"..JY.Person[0]["外号2"].."，上次仗着人多，占了我们四大恶人的便宜，这次咱俩单打独斗。好，你若打的过我，我岳老二就拜你为师。否则，你就拜我为师。", 44, 0)  --对话
Cls()  --清屏
TalkEx("奇怪，我怎么听人家说南海鳄神叫”岳老三”呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是”岳老二”！", 44, 0)  --对话
Cls()  --清屏
if WarMain(90, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你这"..JY.Person[0]["外号2"].."，资质果真不错，我没看错眼。来，快拜我岳老二为师。", 44, 0)  --对话
Cls()  --清屏
TalkEx("岳老三，你自己说过的话都忘了吗？你说打输我要拜我为师的，怎么忘了呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("拜就拜，我岳老二向来说话算话。你是我师父了。", 44, 0)  --对话
Cls()  --清屏
TalkEx("徒儿，你就跟为师的走吧。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 50,1,0,958,0,0,6414,6414,6414,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	TalkEx("是。", 44, 0)  --对话
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(44)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 44, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 33,1,0,129,0,0,6414,6414,6414,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
