TalkEx("灵姑娘用毒，医术都极为高*明，有你陪伴闯荡江湖，旅*程将会十分安稳，*不知姑娘是否肯随我们四处*走走呢？", 0, 1)  --对话
Cls()  --清屏
if instruct_16(1) then  --是否在队伍
	Cls()  --清屏
	TalkEx("是啊，姑娘一个人住这里，*闷也闷慌了，就随我们到处*走走吧。", 1, 1)  --对话
	Cls()  --清屏
	TalkEx("看在胡公子的面子上，我就*陪你们到处玩一玩。", 2, 0)  --对话
	Cls()  --清屏
	instruct_3(104, 41,1,0,946,0,0,7224,7224,7224,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		instruct_10(2)  --加入队伍
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去*小村吧。", 2, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 6,1,0,103,0,0,5210,5210,5210,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件

end
TalkEx("你臭美啊！跟你在一起一定*很无聊。", 2, 0)  --对话
Cls()  --清屏
do return end
