TalkEx("胡大哥，你的刀法学的如何*了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("近来感觉有些进步。", 1, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，年轻人懂得谦虚，很*好。依你现在的武功，只怕*不比你爹当年差啦。怎么样*，你若想为父报仇，尽管动*手吧。", 3, 0)  --对话
Cls()  --清屏
TalkEx("…………", 1, 0)  --对话
Cls()  --清屏
TalkEx("胡大哥……", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("兄弟，我们走吧，我的仇已*经报了。", 1, 0)  --对话
else
	TalkEx("妹子，我们走吧，我的仇已*经报了。", 1, 0)  --对话
end
Cls()  --清屏
TalkEx("对嘛！这才是我的好大哥。", 0, 1)  --对话
Cls()  --清屏
TalkEx("走之前，把这个给你。这是*你爹当年留下来的一幅藏宝*图，理应交给他的后人。", 3, 0)  --对话
Cls()  --清屏
instruct_3(104, 40,1,0,945,0,0,7222,7222,7222,-2,-2,-2)  --修改场景事件
instruct_2(226, 1)  --得到或失去物品
Cls()  --清屏
instruct_39(84)	--无酒不欢：闯王宝藏固定为84
instruct_2(136, 1)  --得到或失去物品
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	instruct_10(1)  --加入队伍
	instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 1, 0)  --对话
Cls()  --清屏
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 5,1,0,101,0,0,5166,5166,5166,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end  --无条件结束事件
do return end
