Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."再次造访，不知有*何见教？", 1, 0)  --对话
Cls()  --清屏
if instruct_9() then  --是否要求加入
	Cls()  --清屏
	instruct_3(3, 9,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 12,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 11,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 10,1,0,636,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	if JY.Person[0]["性别"] == 0 then
		TalkEx("我正在寻找一些书，要在江*湖上到处走动，胡大哥如果*不嫌弃，不妨与小弟同行，*说不定可以得到你想要的消*息。", 0, 1)  --对话
	else
		TalkEx("我正在寻找一些书，要在江*湖上到处走动，胡大哥如果*不嫌弃，不妨与小妹同行，*说不定可以得到你想要的消*息。", 0, 1)  --对话
	end
	Cls()  --清屏
	TalkEx("既然如此，恭敬不如从命。", 1, 0)  --对话
	Cls()  --清屏
	if instruct_20() then  --判断队伍是否已满
		Cls()  --清屏
		TalkEx("你的队伍已满，我就直接去*小村吧。", 1, 0)  --对话
		Cls()  --清屏
		instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
		instruct_3(70, 5,1,0,101,0,0,5166,5166,5166,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	instruct_10(1)  --加入队伍
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(0, -2,0,0,0,0,0,0,0,0,0,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("没事，随便逛逛。", 0, 1)  --对话
Cls()  --清屏
do return end
