--修复华山论剑存档跳出的BUG
--OEVENTLUA[2006] = function()
  PlayMIDI(31)
  say("年轻人，又见面了，看来你的能力已经完全觉醒了！以你现在的实力，可以算得上是一位绝顶高手了！", 1000, 0, "软体娃娃")
  say("当初在这里观看四大高手比武时，是否觉得不能参予其中有点遗憾呢？", 1000, 0, "软体娃娃")
  if DrawStrBoxYesNo(-1, -1, "是否觉得很遗憾呢？", C_GOLD, CC.DefaultFont) then
    say("嗯，很好，年轻人就该有这样的斗志！那么，现在就来弥补这个缺憾吧！", 1000, 0, "软体娃娃")
    say("昔日在这华山之上，曾有过数次论剑，都由当时Ｇ五位绝顶高手Ｗ参予，胜者将获得Ｒ武功天下第一Ｗ之称号！", 1000, 0, "软体娃娃")
    say("以当今世上高手来算，五绝当由Ｒ少林的扫地僧，武当的张三丰，日月神教的东方不败，丐帮帮主乔峰和后起一辈人物之魁首－－也就是你Ｗ来组成", 1000, 0, "软体娃娃")
    say( "好，３Ｇ新华山论剑Ｗ９－－－－－－－１开战！！！！！！！", 1000, 0, "软体娃娃")
    PlayMIDI(100)
    PlayWavAtk(43)
    if WarMain(238) then
      say("１恭喜你终于获得Ｒ武功天下第一Ｗ的称号！Ｈ凭你现在的修为，要完成你所背负的使命相信也不是什么难事了！偶会在龙之国度等待你的归来，再见......", 1000, 0, "软体娃娃")
      SetS(5, 1, 6, 5, 1000)
      AddPersonAttrib(0, "攻击力", 30)
      AddPersonAttrib(0, "防御力", 30)
      AddPersonAttrib(0, "轻功", 30)
      QZXS(JY.Person[0]["姓名"] .. "攻轻防各提升30点 实战经验提升至极")
      SetS(10, 0, 21, 0, 1)
    else
      say("１精彩的战斗，相信你也从中获益不少吧！再见......", 1000, 0, "软体娃娃")
      SetS(5, 1, 6, 5, GetS(5, 1, 6, 5) + 100)
      QZXS("实战经验提升")
    end
    QZXS("武学常识提高50点")
    --华山论剑之后，武学常识提高50点
    AddPersonAttrib(0, "武学常识", 50);
  else
    say("哦，是这样吗？那好吧，祝你旅程愉快，再见！", 1000, 0, "软体娃娃")
  end
  instruct_3(80, 101, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2)
--end