instruct_67(22)  --播放音效WAV
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
TalkEx("咦！这是什么声音？难道洞中藏有怪物？待我进去看个究竟。", 0, 1)  --对话
Cls()  --清屏
instruct_30(25,49,25,38)  --人物移动
TalkEx("哇塞！雕蛇大战，精彩！……咦！雕兄似乎快不行了，看我的！", 0, 1)  --对话
Cls()  --清屏
if WarMain(66, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(210, 8)  --得到或失去物品
Cls()  --清屏
TalkEx("这巨蟒还真难对付，总算把它搞定了。雕兄，你还好吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("咦？雕兄怎么跑了？这只雕颇有灵性，好像要带我到里边去……", 0, 1)  --对话
Cls()  --清屏
instruct_37(2)  --增加品德
instruct_26(19,24,0,0,1)  --开启重阳宫大战
do return end
