TalkEx("看我的！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,1,0,213,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哈哈，终于让我拿起来了！", 0, 1)  --对话
Cls()  --清屏
instruct_2(36, 1)  --得到或失去物品
Cls()  --清屏
--畅想杨过
if JY.Base["畅想"] == 58 then
	say("嘎，嘎，嘎……", 226, 0,"神雕")  --对话

	say("雕兄，你也想随我出去游历一番吗？", 0, 1)  --对话
	
	say("嘎，嘎，嘎……", 226, 0,"神雕")  --对话
	if instruct_20() == false then  --判断队伍是否已满
		dark()
		null(-2,11)
		Cls()  --清屏
		light()
		instruct_10(628)  --加入队伍
		Cls()  --清屏
		do return end  --无条件结束事件
	end
	say("队伍里似乎没有位置了……", 0, 1)  --对话
	instruct_3(-2, 11,1,0,4190,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件
end
do return end
