--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.Person[0]["武功1"]=45
	JY.Person[0]["武功等级1"]=50
	JY.Person[0]["天赋外功1"]=45
	JY.Person[0]["天赋外功2"]=42
	say("Ｒ４重剑无锋……大巧不工……ｗＷ０这位独孤前辈的风采，真是令人神往啊。", 0, 1)  --对话
	
	DrawStrBoxWaitKey("杨过学会武功【Ｇ玄铁剑法Ｏ】", C_ORANGE, CC.DefaultFont, 2)
else
	TalkEx("这上面似乎记载着使用这柄重剑的法门，我赶紧记下来！", 0, 1)  --对话
	Cls()  --清屏
end
instruct_2(116, 1)  --得到或失去物品
Cls()  --清屏
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
do return end
