TalkEx("这位兄台，不知洞中那头大雕是你驯养……咦！你的手臂？莫非是那头大雕所……唉！我刚还救了牠，早知就该让牠被巨蟒咬死算了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(" 巨蟒？你说你救了雕兄，杨过在此谢过。", 58, 0)  --对话
Cls()  --清屏
TalkEx("你的伤不是那雕所为？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不是。", 58, 0)  --对话
Cls()  --清屏
TalkEx("但你看起来像是最近才受伤的，不知杨兄有何困难，是否要在下相助？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这伤？唉！不提也罢？", 58, 0)  --对话
Cls()  --清屏
TalkEx("莫非是女人所为？", 0, 1)  --对话
Cls()  --清屏
TalkEx("阁下怎会知道？", 58, 0)  --对话
Cls()  --清屏
TalkEx("我是随便猜猜的，因为自古以来，只有贱女人才会变态到砍人手臂。", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉！我们不谈这些了。不知"..JY.Person[0]["外号"].."为何会到此地？", 58, 0)  --对话
Cls()  --清屏
TalkEx("老实说我是在找一些东西，找东西当然是要往隐密的地方去找。找着找着就到了这山谷。一进洞后，便看到大雕与巨蟒正在缠斗。那只大雕是杨兄饲养的吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不是的。其实我也是无意中来到这山谷，才发现雕兄的。后来相处了一段时间，我们就成了好朋友。据我在洞中所见，这雕应是一位名为独孤求败的前辈所养的。", 58, 0)  --对话
Cls()  --清屏
TalkEx("独孤求败？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是的，这位前辈号称自己为\"剑魔独孤求败\"。在他遗留下的字迹中这样子写到：“纵横江湖三十余载，杀尽仇寇，败尽英雄，天下更无抗手，无可奈何，惟隐居深谷，以雕为友。呜呼，生平求一敌手而不可得，诚寂寥难堪也。”这位前辈只因世上无敌，只得在深山隐居，其武功之深湛，真不知到了何等地步。此人号称\"剑魔\"，自是运剑若神，名字叫\"求败\"，想是走遍天下欲寻一胜己之人，始终未能如愿，终于在此处郁郁以没。每每缅怀到此前辈的风采，就不禁……咳，咳……不禁令人向往……咳，咳……一兴起话就说太多了。", 58, 0)  --对话
Cls()  --清屏
TalkEx("杨兄身上似乎有伤？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不瞒"..JY.Person[0]["外号"].."，杨某身中\"情花\"之毒，恐怕活不了多久了。", 58, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("杨兄这什么话，兄弟我帮你去找个名医来看看，天下哪有治不好的病。", 0, 1)  --对话
else
	TalkEx("杨兄这什么话，妹子我帮你去找个名医来看看，天下哪有治不好的病。", 0, 1)  --对话
end
Cls()  --清屏
TalkEx("不劳"..JY.Person[0]["外号"].."费心了，这情花乃是绝情谷独有之物，天下无药可解。", 58, 0)  --对话
Cls()  --清屏
TalkEx("看我得先上绝情谷走一趟，看这\"情花\"到底长得什么模样。或许在谷中有收获也说不定呢。常听人说毒蛇出没之处，七步之内必有解毒之药。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那"..JY.Person[0]["外号"].."可得小心，别被那情花刺到，否则……", 58, 0)  --对话
Cls()  --清屏
TalkEx("否则这世上就多了个跟杨兄\"同病相怜\"的人。我这就去了，请杨兄保重。", 0, 1)  --对话
Cls()  --清屏
TalkEx("对了，那绝情谷地处偏僻，你必须乘船顺着黄河而上，才到得了。", 58, 0)  --对话
Cls()  --清屏
TalkEx("杨兄，你撑着点，我会尽快找出这情花之毒的医治方法。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,216,217,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
