TalkEx("又一大群蜘蛛，看我灭之！", 0, 1)  --对话
Cls()  --清屏
if WarMain(65, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(210, 5)  --得到或失去物品
Cls()  --清屏
do return end
