TalkEx("又一大群蜘蛛，看我灭之！", 0, 1)  --对话
Cls()  --清屏
if WarMain(64, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(210, 5)  --得到或失去物品
Cls()  --清屏
do return end
