TalkEx("又一大群蜘蛛，看我灭之！", 0, 1)  --对话
Cls()  --清屏
if WarMain(63, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(210, 20)  --得到或失去物品
Cls()  --清屏
do return end
