instruct_37(2)  --增加品德
instruct_26(60,4,1,0,0)  --修改场景事件
instruct_26(60,5,1,0,0)  --修改场景事件
instruct_26(60,3,1,0,0)  --修改场景事件
instruct_30(20,26,20,29)  --人物移动
instruct_30(20,29,15,29)  --人物移动
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件

--主角
say("周老爷子，你怎么会在这里？",0,4)

--周伯通
say("我和金轮大和尚打赌盗旗，不料赵志敬这吃里扒外的小牛鼻子引我来这山洞里。",64,0)

--周伯通
say("原来这里藏着红红绿绿的大蜘蛛，剧毒无比，一咬之下，老顽童老命难保。幸亏那小姑娘救我，咦，那小姑娘呢？",64,0)

--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("Ｌ＜小姑娘？难道是姑姑？＞",0,4)
else
	--主角
	say("Ｌ＜这世上小姑娘那么多，不知老顽童说的是哪个？＞",0,4)
end

--周伯通
say("啊对了，我教了那小姑娘一门功夫，那小女娃也了给一本秘籍。但老顽童怎能看上她的武功？还是给你算了。",64,0)

instruct_2(119, 1)  --得到或失去物品
Cls()  --清屏

--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("这本秘籍……前辈，那小姑娘现在人在哪里？",0,4)
	
	say("她在哪？我可不知道。",64,0)
end

--周伯通
say("还有啊，你刚才进来的时候，有没有看见好多花花绿绿的蜘蛛啊？",64,0)

--主角
say("有啊，我差点也中毒了呢！不过现在已经被我消灭干净了！",0,4)

--周伯通
say("老顽童生平最怕欠别人的，既然你帮我赶跑了蜘蛛，我就送你两本我自创的得意武功秘籍。",64,0)

instruct_2(98, 1)  --得到或失去物品
Cls()  --清屏
instruct_2(235, 1)  --得到或失去物品
Cls()  --清屏

--周伯通
say("不过老顽童可没空手把手教你，能不能学会就看你的造化了！老顽童去也！",64,0)

instruct_14()  --场景变黑
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮

instruct_26(19,24,0,0,1)  --修改场景事件
instruct_3(20, 4,1,0,1046,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
instruct_3(21, 10,1,0,1047,0,0,6158,6158,6158,-2,-2,-2)  --修改场景事件
do return end
