--OEVENTLUA[227] = function()
    instruct_14();   --  14(E):场景变黑
    instruct_26(60,4,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,5,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(60,3,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(-2,22,0,0,0,0,0,6108,6108,6108,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [22]
    instruct_3(-2,23,0,0,0,0,0,6112,6112,6112,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
    instruct_3(-2,18,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
    instruct_3(-2,19,0,0,0,0,0,6762,6762,6762,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
    instruct_3(-2,20,0,0,0,0,0,6762,6762,6762,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
    instruct_3(-2,21,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
    instruct_3(-2,14,0,0,0,0,0,6802,6802,6802,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
    instruct_3(-2,15,0,0,0,0,0,5894,5894,5894,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	addevent(-2, 31, 1, nil, nil, 6108)
	addevent(-2, 32, 1, nil, nil, 6108)
	instruct_35(59, 0, 139, 999)	--小龙女洗素心剑
	SetHuBo(59)
    instruct_0();   --  0(0)::空语句(清屏)
	stands()
    instruct_13();   --  13(D):重新显示场景

    instruct_25(32,49,27,39); 
	
	--金轮法王
	say("全真教掌教接旨，从即日起，敕封全真教掌教为…… ",62,4)

	--赵志敬
	say("赵某接旨，大汗万岁万岁万万岁！",178,4,"赵志敬")

	--李志常
	say("本教以忠义创教，决不投降蒙古。赵志敬背祖灭宗，天人共弃，不能再任代掌教。",209,0,"李志常")

	--赵志敬
	say("李志常犯上作乱，来人，给我拿下。",178,4,"赵志敬")

	--李志常
	say("赵志敬，你……",209,0,"李志常")

	dark()
	null(-2,31)
	light()
	
	--金轮法王
	say("恭喜赵真人，从今日起，你我同为大汗效力，可喜可贺。",62,4)

	--赵志敬
	say("日后还请国师多多关照啊。",178,4,"赵志敬")
	
	dark()
	instruct_3(-2,16,0,0,0,0,0,3621*2,3621*2,3621*2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	light()
	
	--小龙女
	say("闪开，这人让我杀了！",59,0)

	--尹克西
	say("龙姑娘，别来多日，你贵体请健啊！跟这些贼道生气，没的损折了姑娘贵手。姑娘只需指点出来，待在线稍效微劳，一一给姑娘收拾了。",158,1)

	--小龙女
	say("Ｌ＜向赵志敬一指＞Ｗ好！你先给我杀了他。",59,0)

	--尹克西
	say("Ｌ＜此人已受大汗敕封，怎能杀他？＞Ｗ这位赵真人为人很好啊，姑娘只怕有点误会，我叫他向姑娘陪个不是吧！",158,1)
	
	--小龙女秀眉微蹙，左手剑倏地递出，快如闪电，向尹克西刺了过去。尹克西忙举鞭挡过，只听得啊的一声，站在他身后的赵志敬已然肩头中剑。
	say("小龙女秀眉微蹙，左手剑倏地递出，快如闪电，向尹克西刺了过去。尹克西忙举鞭挡过，只听得啊的一声，站在他身后的赵志敬已然肩头中剑。",0,2)
	
	dark()
	instruct_3(-2,16,0,0,0,0,0,4649*2,4649*2,4649*2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	light()

	--尹克西
	say("龙姑娘，请你手下留情！",158,1)

	--赵志敬
	say("国师救命啊！",178,4,"赵志敬")

	--金轮法王
	say("赵真人不用怕，有老衲在，没有人可以伤你。",62,4)
	
	dark()
	
	light()

	--尼摩星
	say("小妖女受伤了！",159,1)

	--潇湘子
	say("不，是大和尚受伤了。",157,0)

	--尼摩星
	say("这小妖女好厉害，我们一起上！",159,1)
	
	dark()
    instruct_3(-2,1,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_3(-2,3,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
    instruct_3(-2,10,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
    instruct_3(-2,11,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
    instruct_3(-2,12,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
    instruct_3(-2,13,0,0,0,0,0,6116,6116,6116,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
	light()
	
	--马钰
	say("我重阳宫乃清修之地，今日各位来此骚扰，却是为何？",123,0)

	--赵志敬
	say("Ｌ＜坏了，师父师伯叔们出关了……怎么办？……＞",178,4,"赵志敬")

	--王处一
	say("龙姑娘，你古墓派和我全真教纵有梁子，双方自行了断便是，何以约了西域胡人、诸般邪魔外道，害死我这许多教下弟子？",126,4)

	--郝大通
	say("尔等休得再重阳宫放肆，接我们一招“七星聚会”！",127,0)
	
	--众人围攻小龙女。突然之间，小龙女一声大叫，似乎忘记了眼前强敌环饲，手中双剑松开落地，呆呆的望着青松畔的那丛玫瑰……
	say("众人围攻小龙女。突然之间，小龙女一声大叫，似乎忘记了眼前强敌环饲，手中双剑松开落地，呆呆的望着青松畔的那丛玫瑰……",0,2)

	--小龙女
	say("过儿……当真……当真是你吗？",59,0)
	
	--便在此时，法王的金轮迎面砸去，全真七子那招“七星聚会”却自小龙女后心击了上来……
	say("便在此时，法王的金轮迎面砸去，全真七子那招“七星聚会”却自小龙女后心击了上来……",0,2)
	
	--畅想杨过
	if JY.Base["畅想"] == 58 then
		instruct_25(27,39,32,49);   --  30(1E):主角走动32-49--32-44
		
		instruct_30(32,49,32,45);   --  30(1E):主角走动32-49--32-44
		instruct_30(32,45,27,45);   --  30(1E):主角走动32-44--29-44
		instruct_30(27,45,27,40);   --  30(1E):主角走动29-44--29-41
		dark()
		
		instruct_40(1)  --主角面向下
		stands()
		
		light()
	else
		dark()
		
		instruct_3(-2,17,0,0,0,0,0,6186,6186,6186,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
		
		light()
	end
		
	--杨过
	say("龙儿！",58,0)

	--小龙女
	say("过儿，真的……真的是你，这不是做梦么？",59,4)

	--杨过
	say("不是做梦，我不是抱着你么？你受伤重不重？",58,0)

	--小龙女
	say("我……我……Ｌ＜痛楚难当，再也说不下去了＞",59,4)

	--杨过
	say("龙儿，我还是来迟了一步！",58,0)

	--小龙女
	say("不，你来得正好，我只道今生今世，再也瞧不见你啦！",59,4)

	--杨过
	say("Ｌ＜心如刀绞＞Ｗ痛得厉害吗？",58,0)

	--小龙女
	say("你抱着我，我……我好欢喜……",59,4)

	--杨过
	say("龙儿，你身受重伤，我们先离开这里。",58,0)

	--金轮法王
	say("杨过，你数次坏了王爷大事，今日还想走么？",62,4)

	--杨过
	say("龙儿，咱俩今日一起力战群魔，人生至此，更无余憾。你稍等我一会，让我先料理了这贼秃。",58,0)
	
	--畅想杨过
	if JY.Base["畅想"] == 58 then
		if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
			instruct_15(0);   --  15(F):战斗失败，死亡
			instruct_0();   --  0(0)::空语句(清屏)
			do return; end
		end    --:Label2

		instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
		instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
		instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
		instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
		instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
		instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		
		instruct_37(5);
		
		--主角
		say("各位道长，今日此事，或与贵教赵志敬与蒙古金轮国师勾结有关。此事贵教李志常等弟子亦有知晓，不妨详查。",0,1)

		--赵志敬
		say("师叔，此人一派胡言，您可别轻信外人啊！",178,4,"赵志敬")

		--丘处机
		say("哼，此事我们自会细细查问。先把赵志敬关押起来！",68,0)
		
		dark()
		null(-2,32)
		light()

		--丘处机
		say("龙姑娘、杨过，你我的先辈师尊互相原有极深渊源。我全真教今日倚多为胜，赢了也不光彩，何况龙姑娘又已身负重伤。自古道冤家宜解不宜结，两位便此请回。",68,0)

		--丘处机
		say("Ｇ＜朗声说道＞Ｗ众弟子，撤了剑阵！",68,0)
		
		dark()
		instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
		instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
		instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
		instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
		instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
		instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
		instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
		instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
		instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
		instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
		instruct_3(-2,16,0,0,0,0,0,3621*2,3621*2,3621*2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		
		--主角
		say("龙儿，我们回家去。",0,5)
			
		--小龙女
		say("我要你用两只手抱着我……过儿，你的右臂呢？",59,0)
		
		say("……Ｌ＜将分别后发生的事情对小龙女说了＞",0,5)
			
		--小龙女
		say("我跟你一起再去绝情谷，假如治不好你的毒……那我们就一起死了。",59,0)

		instruct_14();   --  14(E):场景变黑
		instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
		addevent(22, 11, 0, 4153, 3, 0)		--绝情谷剧情
		--金轮洗五轮
		JY.Person[62]["武功2"] = 158
		JY.Person[62]["武功等级2"] = 999
		JY.Person[62]["天赋外功1"] = 158
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		instruct_2(239, 1)
		JY.Person[0]["武功3"]=154
		JY.Person[0]["武功等级3"]=50
		local r = JYMsgBox("请选择", "是否要将天赋内功洗为玉女心经？", {"是","否"}, 2, 58)
		if r == 1 then
			JY.Person[0]["天赋内功"]=154
		end
		do return end
	else
		instruct_25(27,39,32,49);   --  30(1E):主角走动32-49--32-44
		
		instruct_30(32,49,32,45);   --  30(1E):主角走动32-49--32-44
		instruct_30(32,45,29,45);   --  30(1E):主角走动32-44--29-44
		instruct_30(29,45,29,43);   --  30(1E):主角走动29-44--29-41
		
		stands()
		
		--主角
		say("你们已将龙姑娘打成重伤，为何还要赶尽杀绝？",0,4)

		--金轮法王
		say("嘿嘿，你以为你就不忍心么？老衲告诉你，你一直想要的《神雕侠侣》，就在杨过身上！",62,0)

		--金轮法王
		say("只要杀了他，你马上就可以得到！老衲倒要看看你会怎么做。",62,0)

		--主角
		say("杨兄，这可是真的？",0,4)

		--杨过
		say("不错，《神雕侠侣》就在我身上。",58,4)

		--主角
		say("Ｌ＜我是否该从杨过身上抢书呢？＞",0,4)
		
		if DrawStrBoxYesNo(-1, -1, "要抢杨过的天书吗？", C_WHITE, CC.DefaultFont) then    --  5(5):是否选择战斗？否则跳转到:Label0
			instruct_37(-10); 
			--主角
			say("杨兄，动手有伤和气，你把此书让给我如何？",0,5)

			--杨过
			say("哈哈哈，你想让我用天书换一条命？你把杨某这条命看得太值钱了！",58,0)

			--杨过
			say("想要天书，你就放马过来吧，杨某今日就没想活着从这里走出去！能和龙儿死在一起，我也算不枉此生。",58,0)

			--小龙女
			say("过儿……",59,0)

			--主角
			say("如此……得罪了……",0,5)

			--丘处机
			say("重阳宫重地，岂容邪魔外道撒野！",68,0)

			--主角
			say("哼，我是邪魔外道？重阳宫又如何？",0,5)

			--郝大通
			say("哼，不知天高地厚的"..JY.Person[0]["外号2"].."，乖乖的束手就擒吧！",127,0)

			--王处一
			say("天罡北斗阵！",126,4)
			
			if instruct_6(73,4,0,0) == false then    --  6(6):战斗[73]是则跳转到:Label3
				instruct_0();   --  0(0)::空语句(清屏)
				instruct_15(0);   --  15(F):战斗失败，死亡
				do return; end
			end    --:Label3
			
			null(-2,16)
			null(-2,17)
			null(-2,32)

			instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
			instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
			instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
			instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
			instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
			instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
			instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
			instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
			instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
			instruct_0();   --  0(0)::空语句(清屏)
				
			light()
			
			--金轮法王
			say("不好，杨过和小龙女趁乱逃走了，我们赶紧追。",62,0)

			--达尔巴
			say("你帮我们赶跑了那帮臭道士，看来是和师父一伙的，这本秘籍就送给你吧。",160,1)
			--得到物品【无上大力杵】X 1
			
			instruct_2(170, 1)	--无上大力杵
			
			dark()

			null(-2,14)
			null(-2,15)
			for i = 18 , 21 do
				null(-2,i)
			end
			
			--绝情谷
			addevent(22, 44, 1, nil, nil, 4203*2)
			addevent(22, 45, 1, nil, nil, 4358*2)
			addevent(22, 43, 0, 4171, 3, 0)
			
			light()
			
			--金轮洗五轮
			JY.Person[62]["武功2"] = 158
			JY.Person[62]["武功等级2"] = 999
			JY.Person[62]["天赋外功1"] = 158
			if JY.Base["畅想"] == 62 then
				instruct_35(0,1,158,50)
				JY.Person[0]["天赋外功1"] = 158
				instruct_2(283, 1)	--得到物品【五轮大转】X 1
			end
			do return end
		else
			instruct_37(5); 

			--主角
			say("天书对我来说固然重要，但我辈岂能乘人之危？",0,4)

			--主角
			say("你们想伤害杨兄和龙姑娘，就要先过我这关！",0,4)

			--金轮法王
			say("不知天高地厚想充当英雄，那就来吧，尝尝我的龙象般若功！",62,0)

			if instruct_6(74,4,0,0) ==false then    --  6(6):战斗[74]是则跳转到:Label2
				instruct_15(0);   --  15(F):战斗失败，死亡
				instruct_0();   --  0(0)::空语句(清屏)
				do return; end
			end    --:Label2

			instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
			instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [21]
			instruct_3(-2,20,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [20]
			instruct_3(-2,19,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
			instruct_3(-2,18,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [18]
			instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			
			--主角
			say("各位道长，今日此事，或与贵教赵志敬与蒙古金轮国师勾结有关。此事贵教李志常等弟子亦有知晓，不妨详查。",0,1)

			--赵志敬
			say("师叔，此人一派胡言，您可别轻信外人啊！",178,4,"赵志敬")

			--丘处机
			say("哼，此事我们自会细细查问。先把赵志敬关押起来！",68,0)
			
			dark()
			null(-2,32)
			light()

			--丘处机
			say("龙姑娘、杨过，你我的先辈师尊互相原有极深渊源。我全真教今日倚多为胜，赢了也不光彩，何况龙姑娘又已身负重伤。自古道冤家宜解不宜结，两位便此请回。",68,0)

			--丘处机
			say("Ｇ＜朗声说道＞Ｗ众弟子，撤了剑阵！",68,0)
			
			dark()
			instruct_3(-2,24,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [24]
			instruct_3(-2,23,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
			instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [23]
			instruct_3(-2,13,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
			instruct_3(-2,12,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
			instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
			instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
			instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
			instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
			instruct_3(-2,16,0,0,0,0,0,3621*2,3621*2,3621*2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			
			--主角
			say("杨兄，龙姑娘，你们没事吧？",0,5)

			--杨过
			say("现在龙儿身受重伤，我们要尽快返回古墓了。大恩不言谢，"..JY.Person[0]["外号"].."有空可到古墓来找我夫妇。龙儿，我们回家。",58,0)
			
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,16,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
			instruct_3(-2,17,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [17]
			instruct_3(18,1,1,0,231,0,0,6068,6068,6068,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [1]
			instruct_3(18,0,1,0,231,0,0,6188,6188,6188,-2,-2,-2);   --  3(3):修改事件定义:场景[古墓]:场景事件编号 [0]
			--instruct_17(18,1,22,41,0);   --  17(11):修改场景贴图:场景[古墓]层1坐标16-29
			instruct_0();   --  0(0)::空语句(清屏)
			instruct_13();   --  13(D):重新显示场景
			--金轮洗五轮
			JY.Person[62]["武功2"] = 158
			JY.Person[62]["武功等级2"] = 999
			JY.Person[62]["天赋外功1"] = 158
			if JY.Base["畅想"] == 62 then
				instruct_35(0,1,158,50)
				JY.Person[0]["天赋外功1"] = 158
				instruct_2(283, 1)	--得到物品【五轮大转】X 1
			end
			do return end
		end
	end
	do return end
