--主角
say("杨兄，龙姑娘。你们还好吧？",0,5)

--小龙女
say("我和过儿要去一趟绝情谷。",59,0)

--主角
say("好，我也去，或许能帮忙做点事情。",0,5)

--小龙女  （金丝手套 黄字）
--say("多谢"..JY.Person[0]["外号"].."援手。这副金丝手套是我古墓派的至宝，就送给"..JY.Person[0]["外号"].."了。",59,0)
--instruct_2(239, 1)

instruct_14()  --场景变黑
--instruct_3(104, 68,1,0,969,0,0,6186,6186,6186,-2,-2,-2)  --修改场景事件
--instruct_3(104, 76,1,0,970,0,0,7242,7242,7242,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
--instruct_3(70, 19,1,0,151,0,0,6188,6188,6188,-2,-2,-2)  --修改场景事件
--instruct_3(70, 20,1,0,153,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
addevent(22, 11, 0, 4153, 3, 0)		--绝情谷剧情
Cls()  --清屏
instruct_13()  --场景变亮
--instruct_37(2)  --增加品德
do return end
