instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_30(24,39,24,32)  --人物移动
Cls()  --清屏
TalkEx("此书乃我回教圣物，决不允许外人拿走。", 74, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜书？圣物？难道是天书？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("这是当今皇上的圣旨，谁敢不从！", 208, 0,"官兵")  --对话
Cls()  --清屏
TalkEx("Ｌ＜原来是官兵……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，我们远在回疆，向来独立，皇帝是你们的，与我回人何干？我们回人但有一口气在，也要誓死保护自己的圣物。", 74, 0)  --对话
Cls()  --清屏
TalkEx("哼，臭丫头，敬酒不吃吃罚酒，那就别怪我们不客气了。", 208, 0,"官兵")  --对话
Cls()  --清屏
--TalkEx("Ｌ＜一边是官兵，一边是回人，我该帮哪一方呢？该帮助回人么？＞", 0, 1)  --对话
local r = JYMsgBox("请选择", "我该帮助哪一方呢？", {"回人","官兵"}, 2, 74)
if r == 1 then
	instruct_37(2)  --增加品德
	TalkEx("你们这些官兵，总是欺压老百姓，我早就看不过眼了，回族弟兄们莫慌，我来助你们。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("哪来的不开眼的"..JY.Person[0]["外号2"].."，活的不耐烦了！", 208, 0,"官兵")  --对话
	Cls()  --清屏
	if WarMain(141, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	instruct_3(-2, 13,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 20,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 19,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 18,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 17,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("唉呦，唉呦，……轻点……", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("多谢"..JY.Person[0]["外号"].."助我族人保护圣物。", 74, 0)  --对话
	Cls()  --清屏
	TalkEx("路见不平，拔刀相助，姑娘太客气了。刚才听姑娘说，这圣物是一本书？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("不瞒恩公，这是回教的圣经《可兰经》。", 74, 0)  --对话
	Cls()  --清屏
	TalkEx("哦。Ｌ＜原来不是天书啊……＞", 0, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 25,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,0,5972,5972,5972,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,6056,6056,6056,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 31,0,0,0,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,5890,5890,5890,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 32,0,0,0,0,0,6784,6784,6784,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx(JY.Person[0]["外号"].."好身手！", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("过奖，这位公子怎样称呼？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("在下姓陈，名家洛。这是我们红花会的众位兄弟。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("原来是红花会陈当家。久仰红花会大名，今日一见，果然英雄了得。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx(JY.Person[0]["外号"].."过奖。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("却不知红花会群豪为何来此？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("我们的红花会的四当家文泰来被官兵所擒，我们一路跟踪这群官兵而来。适才本要出手相助，但见"..JY.Person[0]["外号"].."身手不凡，我们也就不必多此一举了。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("原来陈公子也是要助我回部，霍青桐在此谢过。", 74, 0)  --对话
	Cls()  --清屏
	TalkEx("总舵主，我们搜查一遍，没发现文四弟。", 152, 0)  --对话
	Cls()  --清屏
	TalkEx("把那个带头的官兵抓来问问。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("是。快说，你们把文四弟藏到哪了？", 152, 0)  --对话
	Cls()  --清屏
	TalkEx("唉呦，唉呦，……轻点……，我说，我说，那位文，文……，文大侠已经被我们张大人押往死囚牢了。", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("哪个张大人？", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("是，是，张，张召重，张大人。", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("这张召重武功非比寻常，一路柔云剑术出神入化，我们需得小心行事。", 153, 0)  --对话
	Cls()  --清屏
	TalkEx("哼，那正好，我要和他比比剑法！", 152, 0)  --对话
	Cls()  --清屏
	TalkEx("我们还有要事在身，就不在此打扰了，这位"..JY.Person[0]["外号"].."，还有霍姑娘，在下告辞了。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("既是红花会有事，我也愿相助搭救文四当家。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("是啊，我也愿相助，陈公子，让我和你一起去吧。", 74, 0)  --对话
	Cls()  --清屏
	TalkEx("这是我红花会自己的事，怎好麻烦二位。我看霍姑娘和这位"..JY.Person[0]["外号"].."聊得很投机呀……多保重，告辞了。", 75, 0)  --对话
	Cls()  --清屏
	TalkEx("你——！", 74, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_3(8, 20,1,0,237,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
	instruct_3(8, 19,1,0,237,0,0,5972,5972,5972,-2,-2,-2)  --修改场景事件
	instruct_3(8, 16,1,0,237,0,0,6056,6056,6056,-2,-2,-2)  --修改场景事件
	instruct_3(8, 17,1,0,237,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
	instruct_3(8, 18,1,0,237,0,0,5890,5890,5890,-2,-2,-2)  --修改场景事件
	instruct_3(8, 22,1,0,237,0,0,6784,6784,6784,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 0,1,0,233,0,0,3502*2,3502*2,3502*2,-2,-2,-2)  --修改场景事件
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

else
	instruct_37(-2)  --增加品德
	TalkEx("俗话说民不与官斗。我还是帮着官兵好了。", 0, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 28,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,6056,6056,6056,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 31,0,0,0,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,5890,5890,5890,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 32,0,0,0,0,0,6784,6784,6784,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 27,0,0,0,0,0,5972,5972,5972,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("回民弟兄们莫慌，我来助你们。道长、赵三哥，你们去帮助回民杀官兵，其他人跟我来，对付这个"..JY.Person[0]["外号2"].."。", 75, 0)  --对话
	Cls()  --清屏
	if WarMain(138, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("啊……", 74, 0)  --对话
	Cls()  --清屏
	TalkEx("好厉害，我们先避其锋芒，走！", 75, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 13,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx(JY.Person[0]["外号2"].."，你功夫不错嘛。要不是你，今天恐怕还有些麻烦。", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("多谢军爷称赞。却不知军爷到此是为了什么？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("皇上有旨，要回部交出其圣物《可兰经》。我们这是奉旨行事。", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("哦。Ｌ＜原来不是天书啊……＞", 0, 1)  --对话
	Cls()  --清屏
	TalkEx(JY.Person[0]["外号2"].."武功不错，我们张大人一定会很欣赏你的。现在红花会这帮反贼闹得厉害，我们张大人抓住了他们得一个匪首，姓文的，关押在死囚牢。红花会这帮人肯定要去闹事，你这么好的功夫，不如和我们一起去报效朝廷吧。", 208, 0,"官兵")  --对话
	Cls()  --清屏
	TalkEx("多谢军爷栽培。", 0, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 13,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 20,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 19,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 18,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 17,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 1,1,0,235,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 2,1,0,235,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(8, 0,1,0,241,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(8, 1,1,0,241,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 0,1,0,234,0,0,3502*2,3502*2,3502*2,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end
end