TalkEx("霍姑娘好。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."近来一切可好？", 74, 0)  --对话
Cls()  --清屏
TalkEx("一人闯荡江湖，总是有些寂寞。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."保护了我教的圣物，青桐愿陪"..JY.Person[0]["外号"].."闯荡江湖。", 74, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	TalkEx("Ｌ＜喂，这位玩家，大美女送上门，居然拒绝，有没有搞错！……＞", 0, 1)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("真是求之不得啊。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 61,1,0,975,0,0,7046,7046,7046,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(74)  --加入队伍
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 74, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 36,1,0,163,0,0,7004,7004,7004,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
