TalkEx("陈当家，你好。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，你来啦。", 75, 0)  --对话
Cls()  --清屏
TalkEx("营救文四哥还顺利么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这张召重果然名不虚传，有*他在，救人还真不容易。", 75, 0)  --对话
Cls()  --清屏
TalkEx("这样吧，咱们兵分两路，我*来缠住他，你们你们绕到后*面去救文四哥。", 0, 1)  --对话
Cls()  --清屏
TalkEx("如此甚好，"..JY.Person[0]["外号"].."小心。", 75, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,1,0,239,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,1,0,239,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
