instruct_37(2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
TalkEx("你就是臭名昭着的张召重吗*？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是何人？", 80, 0)  --对话
Cls()  --清屏
TalkEx("我是红花会的朋友，想和你*商量点事。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，想救文泰来？陈家洛呢*？无尘呢？他们有本事就来*啊。怎么让你这么个小毛孩*子来送死！", 80, 0)  --对话
Cls()  --清屏
TalkEx("救不救文泰来，那是红花会*的事。我今天来，是因为听*说张大人的柔云剑术出神入*化，想来领教一二。", 0, 1)  --对话
Cls()  --清屏
TalkEx("飞蛾扑火，不自量力！", 80, 0)  --对话
Cls()  --清屏
TalkEx("张大人可别太自信喽。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那你就划下道来吧。是单挑*，还是群殴？", 80, 0)  --对话
Cls()  --清屏
TalkEx("单挑，你一个挑我们一帮；*群殴，我们一帮殴你一个。*公平吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，原来你是来消遣老*夫的。左右，给我拿下。", 80, 0)  --对话
Cls()  --清屏
if WarMain(142, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("张大人，不好了，那要犯被*人救走了。", 208, 0,"官兵")  --对话
Cls()  --清屏
TalkEx("什么？好啊，原来你是在跟*我使稳君计！", 80, 0)  --对话
Cls()  --清屏
TalkEx("你才知道啊，晚喽。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,8240,8240,8240,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,6784,6784,6784,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("四哥，你终于……", 154, 0)  --对话
Cls()  --清屏
TalkEx("放心，四哥没事。多谢少当*家、众家兄弟，还有这位"..JY.Person[0]["外号"].."。", 151, 0)  --对话
Cls()  --清屏
TalkEx("文四爷客气了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("姓张的，咱们的帐是不是该*算算了！", 151, 0)  --对话
Cls()  --清屏
TalkEx("哼，你们人多势众，又连使*诡计，我今天认栽了。这笔*帐我迟早会讨回来的。我和*别人还有约，恕不奉陪了！", 80, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("狗贼别跑。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."不必追赶。", 75, 0)  --对话
Cls()  --清屏
TalkEx("难道就这么放过他？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们已经打探清楚，他和威*震河朔王维扬有比武之约，*现在他一定是去恒山山麓了*。", 75, 0)  --对话
Cls()  --清屏
TalkEx("既然如此，我们就马上赶去*恒山吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("文四哥伤势未愈，红花会还*有些事情要安排。"..JY.Person[0]["外号"].."请先*走一步，我们随后就到。", 75, 0)  --对话
Cls()  --清屏
TalkEx("也好，咱们就恒山见。", 0, 1)  --对话
Cls()  --清屏
TalkEx("感谢"..JY.Person[0]["外号"].."救我夫君。这是我*家传的鸳鸯刀法，就赠与"..JY.Person[0]["外号"].."吧。", 154, 0)  --对话
Cls()  --清屏
instruct_2(162, 1)  --得到或失去物品
Cls()  --清屏
if inteam(77)then
	say("萧家妹子，我看你似乎学过鸳鸯刀法，但有些地方用的还不纯熟，让我来指点你一二如何？", 154, 0)  --对话
	
	say("好啊，那就谢谢骆姐姐了。",77,0)
	
	dark()
	
	awakening(77, 1)	--萧中慧觉醒一次
	
	kungfu_knowledge(77, 50)	--萧中慧武常+50
	
	instruct_35(77,0,54,50)	--萧中慧鸳鸯刀法洗1级
	
	light()
	
	say(JY.Person[0]["姓名"].."，萧家妹子是难得一见的好妹子，你可要好好珍惜。", 154, 0)  --对话
	
	say("知道了。",0,1)
	
	--DrawStrBoxWaitKey("萧中慧领悟了鸳鸯刀绝技，暴怒时攻击会触发特效", C_RED, CC.DefaultFont, nil, C_GOLD)
	
	DrawStrBoxWaitKey("萧中慧的武学常识提高了", C_GOLD, CC.DefaultFont, nil, LimeGreen)
end
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(38, 1,0,0,0,0,242,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
