instruct_37(-2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
TalkEx(JY.Person[0]["外号"].."，你来啦，我这就给你引荐张大人。", 208, 0,"官兵")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(23, 29)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
instruct_25(23,29,23,29)  --场景移动
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("张大人，这位就是我和您说的，在回疆帮了我们的"..JY.Person[0]["外号"].."。", 208, 0,"官兵")  --对话
Cls()  --清屏
TalkEx("张大人，兴会兴会。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."武功不凡，又有报国之心，真是英雄出少年啊。", 80, 0)  --对话
Cls()  --清屏
TalkEx("张大人过奖了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("红花会那群反贼，近日要来此捣乱，"..JY.Person[0]["外号"].."既然有心效忠朝廷，不妨留下来与老夫共同抗敌。", 80, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜谁要效忠朝廷啊？我只不过不想得罪你们而已……＞Ｗ这个……", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，"..JY.Person[0]["外号"].."放心，老夫绝不会亏待与你，来人啊。", 80, 0)  --对话
Cls()  --清屏
TalkEx("这是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("区区纹银三千两，还望"..JY.Person[0]["外号"].."笑纳。", 80, 0)  --对话
Cls()  --清屏
instruct_2(174, 3000)  --得到或失去物品
Cls()  --清屏
TalkEx("这个，这个……不好吧……", 0, 1)  --对话
Cls()  --清屏
TalkEx("报效朝廷，自然会有封赏，"..JY.Person[0]["外号"].."就不必推辞啦。", 80, 0)  --对话
Cls()  --清屏
TalkEx("报告张大人，红花会的反贼已经杀进来了。", 208, 0,"官兵")  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，我要去后面守着囚禁要犯之地，前面的来敌就拜托"..JY.Person[0]["外号"].."了。", 80, 0)  --对话
Cls()  --清屏
TalkEx("我……唉，拿人家的手短啊……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("又是你这"..JY.Person[0]["外号2"].."，协助官兵，为非作歹。", 152, 0)  --对话
Cls()  --清屏
TalkEx("我……Ｌ＜真倒霉，天书没找到，莫名其妙地得罪了红花会。管不了那么多了，拿人钱财，替人消灾，看来今日只有和他们一战了＞", 0, 1)  --对话
Cls()  --清屏
if WarMain(139, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,238,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx(JY.Person[0]["外号"].."好身手，我果然没看错人。", 80, 0)  --对话
Cls()  --清屏
TalkEx("那要犯可还安全？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你守前，我守后，红花会虽然兵分两路，却是无功而返。哈哈哈。", 80, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜我觉得还是离开这里比较好……＞Ｗ既然此间事情已了，我要告辞了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("也好，我料定这些反贼短期内不会再回来了。只要我成功把要犯押入京城，那就是大功一件，哈哈。我还有个比武约会，现在要赶去恒山，咱们就此别过吧。", 80, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(38, 1,0,0,0,0,243,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(125, 1)  --柔云剑法
do return end
