instruct_37(2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,7050,7050,7050,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,6058,6058,6058,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,6786,6786,6786,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,5892,5892,5892,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,5454,5454,5454,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(50,36,33,36)  --人物移动
TalkEx("陈当家，各位英雄，你们都来啦。", 0, 1)  --对话
Cls()  --清屏
TalkEx("是啊。", 75, 0)  --对话
Cls()  --清屏
TalkEx("这里发生了什么事？这位是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这便是威震河朔的王维扬王老英雄，张召重连使诡计，要把王老英雄至于死地。", 75, 0)  --对话
Cls()  --清屏
TalkEx("哼，这张召重甘为鹰犬，为祸武林，我们先把他拿下再说。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你们仗着人多势众，张某不服，有本事和张某单挑。", 80, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("你以为你今日还能全身而退么？红花会的众位英雄，这一仗就交给小弟了，我倒要看看你张召重到底有多大本事！", 0, 1)  --对话
else
	TalkEx("你以为你今日还能全身而退么？红花会的众位英雄，这一仗就交给小妹了，我倒要看看你张召重到底有多大本事！", 0, 1)  --对话
end
Cls()  --清屏
if WarMain(143, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,5318,5318,5318,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(125, 1)  --柔云剑法
instruct_2(152, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("咦？这不是天书么？原来一直在他身上！", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，陈当家，各位英雄，救命之恩，如同再造。我过去有对不起各位英雄的地方，还望见谅。", 235, 0,"王维扬")  --对话
Cls()  --清屏
TalkEx("王老英雄不必客气。", 0, 1)  --对话
Cls()  --清屏
TalkEx("过去的事，我们也有不对的地方，还望王老英雄海涵。", 75, 0)  --对话
Cls()  --清屏
TalkEx("从今日起，我金盆洗手，退出武林，回家养老啦。各位，告辞了。", 235, 0,"王维扬")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx(JY.Person[0]["外号"].."，你协助我们救出了文四哥，今日又手刃元凶，大快人心。今后若有用得到我红花会的地方，尽管开口。", 75, 0)  --对话
Cls()  --清屏
TalkEx("我一直在寻找十四天书，如果能得陈当家相助，那真是再好不过了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，愿助"..JY.Person[0]["外号"].."一臂之力。那我回去安排一下红花会的事情，然后就赶去小村。", 75, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 69,1,0,976,0,0,7246,7246,7246,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 37,1,0,165,0,0,7006,7006,7006,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
