instruct_37(-2)  --增加品德
instruct_26(60,8,1,0,0)  --修改场景事件
instruct_26(60,9,1,0,0)  --修改场景事件
instruct_26(60,7,1,0,0)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,7050,7050,7050,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,5970,5970,5970,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,6058,6058,6058,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,6786,6786,6786,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,5892,5892,5892,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,5454,5454,5454,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(50,36,33,36)  --人物移动
TalkEx("这不是张大人么？怎么这么惨？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."救我，他们一群人欺负我一个。", 80, 0)  --对话
Cls()  --清屏
TalkEx("又是你，几次三番坏我红花会的事，到底是何用意？", 75, 0)  --对话
Cls()  --清屏
TalkEx("其实……我没……", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，我知道你一直要找十四天书。最近我得到了《书剑恩仇录》一书，准备送与"..JY.Person[0]["外号"].."，刚才被陈家洛抢去了！", 80, 0)  --对话
Cls()  --清屏
TalkEx("陈总舵主，这天书对我至关重要，还望赠与在下。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，天书乃武林至宝，怎能交与你这种匪类。", 75, 0)  --对话
Cls()  --清屏
TalkEx("如此，得罪了。", 0, 1)  --对话
Cls()  --清屏
if WarMain(144, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("对付这种人，不必讲什么江湖道义，大伙一起上！", 152, 0)  --对话
Cls()  --清屏
if WarMain(140, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(152, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("这"..JY.Person[0]["外号2"].."武功厉害，大家暂避一时。反正张召重护驾不利，不是杀头，也要坐牢。我们今日就放过他，咱们走！", 75, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
if inteam(77)then

	awakening(77, 1)	--萧中慧觉醒一次
	
	kungfu_knowledge(77, 50)	--萧中慧武常+50
	
	instruct_35(77,0,54,50)	--萧中慧鸳鸯刀法洗1级
	
	--DrawStrBoxWaitKey("萧中慧领悟了鸳鸯刀绝技，暴怒时攻击会触发特效", C_RED, CC.DefaultFont, nil, C_GOLD)
	
	DrawStrBoxWaitKey("萧中慧的武学常识提高了", C_GOLD, CC.DefaultFont, nil, LimeGreen)
end
TalkEx("张大人，你没事吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好，多亏"..JY.Person[0]["外号"].."及时赶到。", 80, 0)  --对话
Cls()  --清屏
TalkEx("张大人今后有什么打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这群红花会的反贼，胆大包天，那天没能劫走朝廷要犯，居然就胁持了皇帝。我现在回去，恐怕要被问个渎职之罪。干脆暂避一时吧。我先帮你找天书，以报答你的救命之恩。待风声过后，再找机会回朝中复职。", 80, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜要在我这避难啊……＞Ｗ能得张大人相助，真是如虎添翼啊。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 85,1,0,981,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(80)  --加入队伍
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 80, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 52,1,0,175,0,0,7034,7034,7034,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
