TalkEx("真儿，他就是我们的恩公张翠山的儿子，你以后要好好待他，就像亲弟弟一样。", 165, 0)  --对话
Cls()  --清屏
TalkEx("无忌，以后你就是我的亲弟弟，姐姐疼你。", 81, 0)  --对话
Cls()  --清屏
TalkEx("姐姐……你待我真好……", 9, 0)  --对话
Cls()  --清屏
TalkEx("无忌这孩子真可怜，父母都死了，唉，在这世上已经没什么亲人了。", 165, 0)  --对话
Cls()  --清屏
TalkEx("不，我还有义父，他双目失明，一个人住在冰火岛，孤苦伶仃的，咱们去把他接来吧。", 9, 0)  --对话
Cls()  --清屏
TalkEx("也好，咱们这就打点行装，过两天就动身，把谢法王接回来。", 165, 0)  --对话
Cls()  --清屏
--[[
instruct_3(-2, 15,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,250,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,1,0,251,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件]]
dark()
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,1,0,254,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,1,0,0,0,0,782*2,782*2,782*2,-2,-2,-2)  --无酒不欢：这里关门
instruct_3(-2, 11,0,0,0,0,0,6052,6052,6052,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,255,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,255,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,255,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
light()
do return end
