instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
Cls()  --清屏
TalkEx("他应该已经睡了吧？", 165, 0)  --对话
Cls()  --清屏
TalkEx("肯定睡下了，这小鬼每天这个时候都会睡的很香。", 81, 0)  --对话
Cls()  --清屏
TalkEx("真儿，我们这场戏一定要做的真，不能让他起丝毫的疑心。", 165, 0)  --对话
Cls()  --清屏
TalkEx("爹，你就放心吧。你看我这些天伺候那小鬼，他已对我神魂颠倒，一点都不怀疑，呵呵呵……", 81, 0)  --对话
Cls()  --清屏
TalkEx("嗯，明天咱们就出发，前往冰火岛。武林中人梦寐以求的屠龙宝刀就要成为我朱长龄的了，哈哈哈……", 165, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜原来他们父女诱骗张无忌，是为了屠龙刀啊，我是不是该通知张无忌呢？＞", 0, 1)  --对话
Cls()  --清屏
if DrawStrBoxYesNo(-1, -1, "要通知张无忌吗？", C_WHITE, CC.DefaultFont) then  --是/否
	instruct_37(1)  --增加品德
	TalkEx("我去找找无忌吧。", 0, 1)  --对话
	Cls()  --清屏
	instruct_3(-2, 3,-2,0,256,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件

end
instruct_37(-2)  --增加品德
TalkEx("Ｌ＜都说这屠龙宝刀是武林至尊，说不定和天书有关，我不妨看看这场戏，说不定能得到什么好处……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么人！", 165, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,5752,5752,5752,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你是何人？要坏我的好事么？", 165, 0)  --对话
Cls()  --清屏
TalkEx("没有没有。误会误会，我是想和你们一起干。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！宝刀只有一个，你还想分一半么？", 165, 0)  --对话
Cls()  --清屏
TalkEx("我不是要宝刀……", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊……", 9, 0)  --对话
Cls()  --清屏
TalkEx("不好，是无忌，他好像听到了我们谈话，往山那边跑了", 81, 0)  --对话
Cls()  --清屏
TalkEx("快追！", 165, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,5752,5752,5752,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_19(44, 19)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
instruct_25(44,17,44,17)  --场景移动
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你们，你们居然骗我……", 9, 0)  --对话
Cls()  --清屏
TalkEx("好弟弟，快过来，姐姐疼你。", 81, 0)  --对话
Cls()  --清屏
TalkEx("不要，你们不要过来，你们……啊……", 9, 0)  --对话
Cls()  --清屏
TalkEx("小心悬崖！", 0, 1)  --对话
Cls()  --清屏
TalkEx("我的宝刀，你不能死，我……啊……", 165, 0)  --对话
Cls()  --清屏
TalkEx("爹——！", 81, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_19(45, 18)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("爹爹……为了抓那个小鬼，自己也坠入山崖……爹爹……", 81, 0)  --对话
Cls()  --清屏
TalkEx("朱姑娘，不要难过了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("又不是你没了父亲，你当然不难过了！", 81, 0)  --对话
Cls()  --清屏
TalkEx("我们去找找他们吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我从今后就孤苦伶仃一个人了……", 81, 0)  --对话
Cls()  --清屏
TalkEx("朱姑娘，跟我一起走吧，去这附近的山谷找一找，说不定令尊吉人天相……", 0, 1)  --对话
Cls()  --清屏
TalkEx("呜呜……好吧……这悬崖下面应该是昆仑山谷，说不定昆仑派会有人见到。", 81, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜没找到天书，得到了美女，也不错啊……＞", 0, 1)  --对话
instruct_3(68, 3,1,0,4253,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 13,1,0,4253,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(11, 106,0,0,0,0,290,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(11, 107,0,0,0,0,290,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 23,0,0,0,0,309,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 24,0,0,0,0,309,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 25,0,0,0,0,309,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 27,0,0,0,0,309,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 26,0,0,0,0,309,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_3(104, 62,1,0,982,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(81)  --加入队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("你的队伍已满，我就直接去小村吧。", 81, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 46,1,0,177,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
