instruct_37(1)  --增加品德
TalkEx("张兄弟，这朱长龄父女不是好人，他们根本不认识你父亲，他们骗你，目的就是为了屠龙刀。", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊？这是真的么？姐姐她……", 9, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,5752,5752,5752,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("无忌，不要听他胡说八道。你到底是什么人？挑拨我们之间的关系！", 165, 0)  --对话
Cls()  --清屏
TalkEx("哼，不知道是谁在胡说八道！你们刚才在那间屋子里说的话，我全都听见了！", 0, 1)  --对话
Cls()  --清屏
TalkEx("好"..JY.Person[0]["外号2"].."，留你不得！", 165, 0)  --对话
Cls()  --清屏
TalkEx("啊？难道这是真的？你们……", 9, 0)  --对话
Cls()  --清屏
TalkEx("张兄弟，你快跑！", 0, 1)  --对话
Cls()  --清屏
TalkEx("快追！", 165, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,5752,5752,5752,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,7026,7026,7026,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_19(44, 19)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
instruct_25(44,17,44,17)  --场景移动
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("无忌，我们一直待你很好，你姐姐也很喜欢你，快过来，那边危险……", 165, 0)  --对话
Cls()  --清屏
TalkEx("好弟弟，快过来，姐姐疼你。", 81, 0)  --对话
Cls()  --清屏
TalkEx("你、你，你骗我？不，不……啊……", 9, 0)  --对话
Cls()  --清屏
TalkEx("悬崖！危险！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("我苦心经营这么久，居然被你破坏了，拿命来。", 165, 0)  --对话
Cls()  --清屏
TalkEx("哼，你这种人渣！", 0, 1)  --对话
Cls()  --清屏
if WarMain(145, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(68, 3,1,0,257,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 13,1,0,257,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(11, 106,0,0,0,0,259,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(11, 107,0,0,0,0,259,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("唉，无忌从这悬崖上摔下去，凶多吉少啊。我去找找吧。好像昆仑派就在这附近，不妨去打听打听。", 0, 1)  --对话
Cls()  --清屏
do return end
