instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
TalkEx("这位小哥，我向你打听一些事情。", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么事？", 192, 0,"昆仑弟子")  --对话
Cls()  --清屏
TalkEx("我有位朋友，不幸坠入昆仑山谷，不知贵派可有人发现？", 0, 1)  --对话
Cls()  --清屏
TalkEx("山谷这么深，坠下去恐怕是必死无疑了。我们昆仑派可不管收尸！再说，掌门已经率领众弟子前去围剿明教了，现在留守派中的人都不会轻易离开。", 192, 0,"昆仑弟子")  --对话
Cls()  --清屏
TalkEx("围剿明教？昆仑派自己么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是六大派共同围剿明教！", 192, 0,"昆仑弟子")  --对话
Cls()  --清屏
TalkEx("六大派？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们昆仑派，再加上少林、武当、峨嵋、崆峒、华山，合称六大派。此次围剿光明顶，我们志在必得。", 192, 0,"昆仑弟子")  --对话
Cls()  --清屏
TalkEx("哦，这样啊，多谢这位小哥。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你没什么事就快走吧，不要在此停留！免得把你当明教奸细抓起来！", 192, 0,"昆仑弟子")  --对话
Cls()  --清屏

instruct_3(-2, 3,1,0,258,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,258,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件

--龙门客栈
addevent(60, 40, 1, 4220, 1, 2679*2)
addevent(60, 41, 1, 4220, 1, 2652*2)
addevent(60, 42, 1, 4220, 1, 2654*2)
addevent(60, 43, 1, 4220, 1, 2655*2)
addevent(60, 44, 1, 4220, 1, 2656*2)
addevent(60, 45, 1, 4220, 1, 2660*2)
addevent(60, 46, 1, 4220, 1, 2668*2)

--峨眉灭绝消失
null(33,2)
do return end
