instruct_37(1)  --增加品德
instruct_14()  --场景变黑
instruct_3(68, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(68, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
TalkEx("咦？好像有人说话……", 0, 1)  --对话
Cls()  --清屏
instruct_25(29,27,29,15)  --场景移动
TalkEx("你到底是什么人，怎么进入我明教的？", 12, 0)  --对话
Cls()  --清屏
TalkEx("你问我成昆怎么进来的？当然是大摇大摆走进来的。", 18, 0)  --对话
Cls()  --清屏
TalkEx("你是混元霹雳手成昆，谢法王的师父？", 14, 0)  --对话
Cls()  --清屏
TalkEx("没错，我就是那头笨狮的师父。拜他的鲁莽所赐，你们和六大派结下了这么多梁子。今天起明教就将化为灰烬，也了结了我多年来的心愿。", 18, 0)  --对话
Cls()  --清屏
TalkEx("要是我猜的没错，这中间的一切都是你苦心安排的。", 11, 0)  --对话
Cls()  --清屏
TalkEx("杨左使倒还蛮聪明的嘛。没错，激起谢逊的愤怒，让他到处乱杀人，留下我的名字好激我现身，到最后再故意让江湖人知道其实是明教谢逊所为，引起江湖各大派与明教间仇杀，这一切都是我精心计画的。", 18, 0)  --对话
Cls()  --清屏
TalkEx("你为何要如此做？", 14, 0)  --对话
Cls()  --清屏
TalkEx("要问就去问你们前任教主阳顶天。我原本一桩美好的姻缘却被他活生生拆散了，明明是我爱妻，只因他当上了魔教的大头子，就将我爱妻霸占了去。因此我心中便立下重誓：只要我成昆还有一口气在，定要让魔教永无宁日。我立下此誓已有二十余年，今日方见大功告成。哈哈！", 18, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 104,1,0,260,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("成昆，你这奸贼！", 9, 0)  --对话
Cls()  --清屏
instruct_25(29,15,29,27)  --场景移动

instruct_30(29,27,29,22)  --人物移动
instruct_30(29,22,33,22)  --人物移动
instruct_30(33,22,33,15)  --人物移动
TalkEx("无忌兄弟，你在这！", 0, 1)  --对话
instruct_3(-2, 103,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."是你啊，那日多亏了你。我最近又有一番奇遇。稍后咱们再详谈，现在先对付成昆，咦？成昆呢？", 9, 0)  --对话
Cls()  --清屏
TalkEx("不好，让他跑了。兄弟，你照顾一下明教的几位首脑，我去追那成昆。", 0, 1)  --对话
Cls()  --清屏
TalkEx("这里交给我，你去追成昆吧。", 9, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，我这有一本秘籍，今日就送给你了，希望你能用得到。", 12, 0)  --对话
Cls()  --清屏
instruct_2(109,1)	--鹰爪功
Cls()  --清屏
say("多谢鹰王。", 0, 1)  --对话
instruct_3(-2, 106,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 107,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
do return end
