instruct_37(5)  --增加品德
instruct_14()  --场景变黑
instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
instruct_39(72)  --打开场景
null(34,0)	--唐文亮消失
null(68,7)	--何太冲消失
--instruct_3(33, 2,1,0,1062,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
--instruct_3(34, 0,1,0,1066,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(29,47,29,36)  --场景移动
Cls()  --清屏
TalkEx("魔教已然一败涂地，再不投降，还待怎的？空闻大师，咱们这便去毁了魔教三十三代教主的牌位吧！", 8, 0)  --对话
Cls()  --清屏
TalkEx("什么投不投降？魔教之众，今日不能留下任何活口。除恶务尽，否则他日死灰复燃，又将为害江湖。魔崽子们！识时务的快快自我了断，省得大爷们动手。", 7, 0)  --对话
Cls()  --清屏
TalkEx("华山派和崆峒派各位，请将顶上的魔教余孽一概诛灭了。武当派从西往东搜索，峨嵋派从东往西搜索，别让魔教有一人漏网。昆仑派预备火种，焚烧魔教巢穴。少林弟子各取法器，诵念往生经文，替六派殉难英雄，魔教教众超渡，化除冤孽。", 169, 0)  --对话
Cls()  --清屏
instruct_25(29,36,29,47)  --场景移动
instruct_30(29,48,29,38)  --人物移动
TalkEx("哇！这里这么多人，干什么这么热闹，可少不了小侠我。我说名门正派又怎么样，还不是一样赶尽杀绝，跟魔教又有什么两样，只不过藉口好听一点罢了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."非魔教人士，还请速速离去，以免受池鱼之殃。", 169, 0)  --对话
Cls()  --清屏
TalkEx("那好，大家都别打了，因为这中间着实有许多误会，让我好好说给你们听。", 0, 1)  --对话
Cls()  --清屏
TalkEx("现在年轻人都这么狂妄吗？你自以为是武林盟主吗！要我们听你说。", 6, 0)  --对话
Cls()  --清屏
TalkEx("你这小贼，跟魔教勾结，想要拖延时间，好施什么诡计么？先杀了你再说。", 8, 0)  --对话
Cls()  --清屏
TalkEx("我就知道要你们安安静静听我说是不太可能，那只有想办法让你们服气了。哪一派先来？", 0, 1)  --对话
Cls()  --清屏
TalkEx("好狂妄的口气，我昆仑派就来领教阁下高招！", 7, 0)  --对话
Cls()  --清屏
if WarMain(9, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(8, 1)  --天王
TalkEx("看我华山派的。", 109, 0)  --对话
Cls()  --清屏
if WarMain(11, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(8, 1)  --天王
--instruct_2(142, 1)  --反两仪
--Cls()  --清屏
TalkEx("让你尝尝我崆峒七伤拳的厉害。", 8, 0)  --对话
Cls()  --清屏
if WarMain(12, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(8, 1)  --天王
TalkEx(JY.Person[0]["外号"].."武功盖世，老衲前来领教一二。", 170, 0)  --对话
Cls()  --清屏
if WarMain(149, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(8, 1)  --天王
--instruct_2(92, 1)  --得到或失去物品
--Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，你以为你是武林盟主吗？就算你有屠龙刀在手，还要问问我手上的倚天剑答不答应！", 6, 0)  --对话
Cls()  --清屏
if WarMain(150, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("现在就看武当派的了。", 6, 0)  --对话
Cls()  --清屏
TalkEx("这个……", 171, 0)  --对话
Cls()  --清屏
TalkEx("大师伯，你们别打了。", 9, 0)  --对话
Cls()  --清屏
TalkEx("你，你，你是无忌！你是我五弟的儿子张无忌！", 171, 0)  --对话
Cls()  --清屏
TalkEx("大师伯，是我，太师父他老人家还好吧？", 9, 0)  --对话
Cls()  --清屏
TalkEx("好，好，孩子，你身上的寒毒好了吗？", 171, 0)  --对话
Cls()  --清屏
TalkEx("谢谢大师伯挂怀，我想已经好了吧。大师伯，六大派和明教，这其中确有不少误会，你们不要再打了。", 9, 0)  --对话
Cls()  --清屏
TalkEx("什么误会？", 171, 0)  --对话
Cls()  --清屏
TalkEx("就让这位"..JY.Person[0]["外号"].."来说吧。", 9, 0)  --对话
Cls()  --清屏
TalkEx("事情的经过是这样的……如此如此…………这般这般…………总之，一切的阴谋，都是成昆那奸贼所计划的。所以我说呢，你们两方还是握手言和吧，反正明教杀过六大派的人，六大派也杀过明教的人，大家半斤八两，差不了多少，就都罢手吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("话都是你在说的，是不是真的，我们怎么知道。", 8, 0)  --对话
Cls()  --清屏
TalkEx("武当派既认亲，看来这次六大派围攻光明顶是一败涂地了，我们走！", 6, 0)  --对话
Cls()  --清屏
TalkEx("阿弥陀佛。", 169, 0)  --对话
Cls()  --清屏
TalkEx("哼！技不如人，说这么多做什么，走吧！", 7, 0)  --对话
Cls()  --清屏
TalkEx("无忌，还有这位"..JY.Person[0]["外号"].."，今日你们救了明教，今后要多所规劝引导，总要使明教改邪归正，少做坏事。我们走吧。", 171, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 79,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 70,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 69,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 68,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 67,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 66,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 65,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 64,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 63,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 62,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 61,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 60,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 59,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 58,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 57,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 56,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 55,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 54,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 53,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 52,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 51,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 84,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 83,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 82,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 81,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 80,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 96,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 99,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 98,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 97,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 108,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 104,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 110,1,0,272,0,0,5334,5334,5334,-2,-2,-2)  --修改场景事件
instruct_3(-2, 109,1,0,270,280,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_19(28, 17)  --设置人物XY坐标
--instruct_25(28,15,28,15)  --场景移动
stands()
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你们两个，还不赖嘛！", 14, 0)  --对话
Cls()  --清屏
TalkEx("蝠王，不可无礼。明教全教下上，叩谢"..JY.Person[0]["外号"].."和张公子护教救命的大恩！", 10, 0)  --对话
Cls()  --清屏
TalkEx("快别这么说，仗义行侠，本就是我辈中人应当做的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你们也别这么客套了。这样吧，大家听我一言，我说呢，这位"..JY.Person[0]["外号"].."武功盖世义薄云天，于本教有存亡续绝的大恩。咱们拥立他为本教第三十四任教主。由他来做教主，总比你来做教主好吧，杨左使，你说对不对啊。", 14, 0)  --对话
Cls()  --清屏
TalkEx("是啊！这位"..JY.Person[0]["外号"].."来做我们教主，也比你韦一笑来做好的多。", 11, 0)  --对话
Cls()  --清屏
TalkEx("你……", 14, 0)  --对话
Cls()  --清屏
TalkEx("你们两个别在那里吵了，丢人现眼的。", 12, 0)  --对话
Cls()  --清屏
TalkEx("不，不，我仍有要事在身，这个教主是无论如何不能当的。Ｌ＜南贤老头说我有什么天命在身，听起来比这个教主可威风多了＞", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."如果一直推却不肯，我们明教恐怕又要为此争闹不休，四分五裂，到时又会被其他门派围攻，导致灭亡了。", 10, 0)  --对话
Cls()  --清屏
TalkEx("我这里有封阳教主的遗书，上面提到要谢逊谢法王暂代教主之职。", 0, 1)  --对话
Cls()  --清屏
TalkEx("可是谢法王至今杳无音信，明教却不可一日无主啊。", 10, 0)  --对话
Cls()  --清屏
TalkEx("我义父应该在冰火岛，咱们去找他吧。", 9, 0)  --对话
Cls()  --清屏
TalkEx("我倒有个主意。这位张公子，今日也可算是明教的恩人。他是鹰王的外孙，可算是明教自己人。他还是狮王的义子，就算狮王做了教主，子继父业也是理所当然。而且张公子似乎另有奇遇，武功卓绝，这个明教教主，再合适不过了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."此言有理，我韦一笑第一个赞成！", 14, 0)  --对话
Cls()  --清屏
TalkEx("我，我，我不行的……", 9, 0)  --对话
Cls()  --清屏
TalkEx("我赞成！", 11, 0)  --对话
Cls()  --清屏
TalkEx("我也赞成！", 10, 0)  --对话
Cls()  --清屏
TalkEx("无忌，你就不要推辞了，难道你连外公的话都不听吗？", 12, 0)  --对话
Cls()  --清屏
TalkEx("我……好吧……", 9, 0)  --对话
Cls()  --清屏
TalkEx("明教光明左使杨逍", 11, 0)  --对话
Cls()  --清屏
TalkEx("光明右使范遥", 10, 0)  --对话
Cls()  --清屏
TalkEx("白眉鹰王殷天正", 12, 0)  --对话
Cls()  --清屏
TalkEx("青翼蝠王韦一笑", 14, 0)  --对话
Cls()  --清屏
TalkEx("Ｄ〔明教众人〕Ｗ参见教主！", 0, 2)  --对话
Cls()  --清屏
TalkEx("使不得，使不得，你们快起来……", 9, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
Cls()  --清屏
TalkEx("另外还有一件事拜托你们，你们明教中是否有一本叫《倚天屠龙记》的书？是否能借我一下。", 0, 1)  --对话
Cls()  --清屏
TalkEx("有的。这是我明教镇教之宝，历来由专人掌管。", 11, 0)  --对话
Cls()  --清屏
TalkEx("是吗？真的有。皇天不负苦心人，打了这么多场仗，终于让我找到了。不知是哪位掌管此书？", 0, 1)  --对话
Cls()  --清屏
TalkEx("金毛狮王谢逊！", 10, 0)  --对话
Cls()  --清屏
TalkEx("张公子，你知道你义父所在吧，咱们去找他吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好啊，我一直想把义父接回来。", 9, 0)  --对话
Cls()  --清屏
TalkEx("可是，现在明教大敌刚去，有许多事情需要教主安排，教主你不能轻离光明顶啊。", 11, 0)  --对话
Cls()  --清屏
TalkEx("杨左使此言有理。那就拜托"..JY.Person[0]["外号"].."去找寻我义父吧，他就在极北的冰火岛。", 9, 0)  --对话
Cls()  --清屏
TalkEx("好，那我这就去寻找谢法王。各位，告辞了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."慢走。", 9, 0)  --对话
Cls()  --清屏
instruct_3(-2, 0,0,0,0,0,274,0,0,0,-2,-2,-2)  --修改场景事件
do return end
