if instruct_16(9) == false then  --是否在队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(44, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(44, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,5288,5288,5288,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,7008,7008,7008,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,5294,5294,5294,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(48,24,26,23)  --场景移动
TalkEx("谢三哥，你还信不过紫杉老妹子么？", 15, 0)  --对话
Cls()  --清屏
TalkEx("我说过了，除非见到我那无忌孩儿，否则我是不会把屠龙刀借给你的。", 13, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜义父，怎么在这里？那金花婆婆就是紫杉龙王？＞", 9, 1)  --对话
Cls()  --清屏
TalkEx("张公子，我们进去相认吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("明教圣火令到，护教龙王、狮王，还不下跪迎接，更待何时。", 174, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜圣火令？我教圣火令已经遗失多年，这来的是什么人？＞", 9, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 5,0,0,0,0,0,5222,5222,5222,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,5222,5222,5222,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,5222,5222,5222,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("本人早已破门出教，'护教龙王'四字，再也休提。阁下尊姓大名？这圣火令是真是假，从何处得来？", 15, 0)  --对话
Cls()  --清屏
TalkEx("明教源于何土？", 174, 0)  --对话
Cls()  --清屏
TalkEx("源起波斯。", 13, 0)  --对话
Cls()  --清屏
TalkEx("然也，然也！我乃波斯明教总教流云使，另外两位是妙风使、辉月使。我等奉总教主之命，特从波斯来至中土。", 174, 0)  --对话
Cls()  --清屏
TalkEx("中土明教虽然出自波斯，但数百年来独立成派，自来不受波斯总教管辖。", 13, 0)  --对话
Cls()  --清屏
TalkEx("这是中土明教的圣火令，前任姓石的教主不肖，失落在外，今由我等取回。自来见圣火令如见教主。", 174, 0)  --对话
Cls()  --清屏
TalkEx("我已说过，本人早已破门出教，这圣火令与我何干？", 15, 0)  --对话
Cls()  --清屏
TalkEx("本教教规，入教之后终身不能叛教。你自称破门出教，为本教叛徒，需留你不得。", 174, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,5288,5288,5288,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("啊！", 66, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这三人一招之间就抓住了紫杉龙王，功夫着实了得！＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("快救救我妈妈！", 66, 0)  --对话
Cls()  --清屏
TalkEx("大胆胡人，还不快放人。", 0, 1)  --对话
Cls()  --清屏
if WarMain(14, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,5288,5288,5288,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,5284,5284,5284,-2,-2,-2)  --修改场景事件
instruct_19(26, 24)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(298, 1)  --阴风刀
TalkEx("多谢"..JY.Person[0]["外号"].."出手相助。", 13, 0)  --对话
Cls()  --清屏
TalkEx("狮王不必客气。", 0, 1)  --对话
Cls()  --清屏
TalkEx("老婆子多谢啦。", 15, 0)  --对话
Cls()  --清屏
TalkEx("龙王不必客气。这三个家伙的武功真是怪异。咦？这是什么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这就是圣火令。", 15, 0)  --对话
Cls()  --清屏
TalkEx("这上面好像有字？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我来看看。哦，这是波斯文字，我给你译出来。", 15, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
instruct_2(70, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("却不知这些人为何要为难婆婆？", 0, 1)  --对话
Cls()  --清屏
TalkEx("说来话长。我本是波斯明教的圣女。", 15, 0)  --对话
Cls()  --清屏
TalkEx("啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我来到中原，加入明教，本是寻找乾坤大挪移心法的。没想到对银叶先生动了真情，结为夫妻，这是犯了波斯明教的大忌，按照教规理应处死。我这么多年隐姓埋名，没想到还是被找到了。", 15, 0)  --对话
Cls()  --清屏
TalkEx("原来如此啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("看，又来了好多人。", 66, 0)  --对话
Cls()  --清屏
TalkEx("此地不宜久留，我们还是赶回光明顶吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我还要找我的无忌孩儿。", 13, 0)  --对话
Cls()  --清屏
TalkEx("义父……孩儿无忌不孝，没能早日前来迎接，累义父受尽辛苦。", 9, 1)  --对话
Cls()  --清屏
TalkEx("你，你说什么？", 13, 0)  --对话
Cls()  --清屏
TalkEx("\"拳学之道在凝神，意在力先方致胜……\"", 9, 1)  --对话
Cls()  --清屏
TalkEx("你，你当真便是我那无忌孩儿？", 13, 0)  --对话
Cls()  --清屏
TalkEx("义父……", 9, 1)  --对话
Cls()  --清屏
TalkEx("老天爷开眼，老天爷开眼！", 13, 0)  --对话
Cls()  --清屏
TalkEx("恭喜你们父子团圆。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我曾经说过，谁能把无忌孩儿给我带来，我就把屠龙刀送给谁，现在，这把武林至尊的屠龙宝刀就送给"..JY.Person[0]["外号"].."吧。", 13, 0)  --对话
Cls()  --清屏
instruct_2(43, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("老爷子，我和你说了吧，你这位义子，乃是堂堂的明教教主，你反倒是他的属下。", 0, 1)  --对话
Cls()  --清屏
TalkEx("这，此话当真？", 13, 0)  --对话
Cls()  --清屏
TalkEx("事情是这样的……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("属下金毛狮王谢逊参见教主。", 13, 0)  --对话
Cls()  --清屏
TalkEx("义父不必多礼。那些波斯人不久就会攻来，此地不宜久留，我们一起回光明顶吧。", 9, 1)  --对话
Cls()  --清屏
TalkEx("一切听教主安排。韩夫人，你也和我们一起回光明顶吧。", 13, 0)  --对话
Cls()  --清屏
TalkEx("我已经破门出教……", 15, 0)  --对话
Cls()  --清屏
TalkEx("当年之事，你至今还耿耿于怀么？我明教这些年四分五裂，现在好不容易有了新教主，大家该当齐心协力。波斯明教肯定还会来找你麻烦，不如我们一起回光明顶吧。", 13, 0)  --对话
Cls()  --清屏
TalkEx("光明顶上，还容得下我吗？", 15, 0)  --对话
Cls()  --清屏
TalkEx("明教四王，紫白金青。自然一个也不能少。光明顶上的兄弟们，都很惦记你啊。一起回去吧。", 9, 1)  --对话
Cls()  --清屏
TalkEx("这，好吧，此地确实不宜久留，既然教主有命，属下紫杉龙王自当遵从。", 15, 0)  --对话
Cls()  --清屏
TalkEx("妈妈，我……想跟着教主……", 66, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，好，女大不由娘，你就跟着教主和这位"..JY.Person[0]["外号"].."吧。谢三哥，我们回光明顶。", 15, 0)  --对话
Cls()  --清屏
TalkEx("好，我们走。", 13, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(11, 109,1,0,282,0,0,5294,5294,5294,-2,-2,-2)  --修改场景事件
instruct_3(11, 101,1,0,283,0,0,5288,5288,5288,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
instruct_3(104, 53,1,0,972,0,0,7052,7052,7052,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_10(66)  --加入队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("你的队伍已满，我就直接去小村吧。", 66, 0)  --对话
instruct_3(70, 38,1,0,157,0,0,7008,7008,7008,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
