instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
TalkEx("谢法王，我还想向你打听一*下《倚天屠龙记》一书。", 0, 0)  --对话
Cls()  --清屏
TalkEx("此书就在我身上。", 13, 0)  --对话
Cls()  --清屏
TalkEx("太好了，能否借我一下？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."对我明教有大恩，按说*谢逊不应拒绝。但是此书乃*我明教镇教之宝，不可轻与*外人。", 13, 0)  --对话
Cls()  --清屏
TalkEx("那谢法王怎样才肯借出此书*呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我明教现在还有一心腹大患*……", 13, 0)  --对话
Cls()  --清屏
TalkEx("你是说那恶僧成昆？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不错，这成昆害我全家，更*处心积虑害我明教，只要"..JY.Person[0]["外号"].."把他的人头带来，我就将*此书赠与"..JY.Person[0]["外号"].."。", 13, 0)  --对话
Cls()  --清屏
TalkEx("好，一言为定。", 0, 1)  --对话
Cls()  --清屏
instruct_2(69, 1)
Cls()  --清屏
instruct_3(-2, -2,1,0,286,285,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(9, 0,0,0,0,0,284,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(9, 1,0,0,0,0,0,5296,5296,5296,-2,-2,-2)  --修改场景事件
instruct_3(9, 2,0,0,0,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(9, 3,0,0,0,0,0,6788,6788,6788,-2,-2,-2)  --修改场景事件
instruct_3(9, 4,0,0,0,0,0,5892,5892,5892,-2,-2,-2)  --修改场景事件
do return end
