instruct_14()  --场景变黑
instruct_13()  --场景变亮
instruct_25(28,24,31,19)  --场景移动
instruct_37(2)  --增加品德
TalkEx("好啊！成昆，原来你躲在这里，怎么，几个坏蛋聚在这里，是不是又在一起商量什么坏勾当？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！上次的事全被你坏了，我这次饶不了你。", 18, 0)  --对话
Cls()  --清屏
if WarMain(13, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("今天真是大快人心，替武林除了一个大害。", 0, 1)  --对话
Cls()  --清屏
instruct_2(219, 1)  --得到或失去物品
Cls()  --清屏
do return end
