instruct_26(40,9,4,0,0)  --修改场景事件
instruct_26(40,10,4,0,0)  --修改场景事件
instruct_26(40,12,4,0,0)  --修改场景事件
TalkEx("谢前辈，这是成昆的项上人头。成昆作恶多端已遭天谴。", 0, 1)  --对话
Cls()  --清屏
instruct_32(219, -1)  --得到或失去物品
TalkEx("是吗？哈！哈！成昆啊，成昆！你作恶多端终遭天谴，但，可惜啊，可惜！我不能亲手杀了你。", 13, 0)  --对话
Cls()  --清屏
TalkEx("成昆一事已了，谢法王能否……？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."为我明教付出许多，谢某感激不尽。如今成昆已死，这本《倚天屠龙记》自当赠予"..JY.Person[0]["外号"].."。", 13, 0)  --对话
Cls()  --清屏
instruct_2(155, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("这里还有一本书，是教中兄弟近日发现的，请"..JY.Person[0]["外号"].."一并收下。", 13, 0)  --对话
Cls()  --清屏
instruct_2(287, 1)  --得到或失去物品
Cls()  --清屏
instruct_3(-2, -2,1,0,4142,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
