TalkEx("莫非这二人竟是阳顶天夫妇？这里有封信，看看写些什么：", 0, 1)  --对话
Cls()  --清屏
TalkEx("今余神功第四层初成，即悉成昆之事，血气翻涌不克自制，真力将散，行当大归。天也命也，复何如耶？今余命在旦夕，有负衣教主重托，实为本教罪人。盼夫人持余亲笔遗书，召聚众人，令谢逊暂摄副教主之位，处份本教重务……", 221, 0,"阳顶天")  --对话
Cls()  --清屏
TalkEx("原来阳教主是在练功时，因知悉成昆的事后，不慎走火入魔了。而阳教主夫人……这里有把匕首，看来是因愧疚而自杀了。这个羊皮卷，大概就是他当时在练的\"神功\"吧。", 0, 1)  --对话
Cls()  --清屏
instruct_2(74, 1)  --得到或失去物品
instruct_35(9, 1, 97, 50)  --张无忌洗乾坤
instruct_3(-2, 3,1,0,292,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,-2,0,0,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,-2,0,0,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
