TalkEx("怎么会这样！怎么会这样！", 10, 0)  --对话
Cls()  --清屏
TalkEx("你是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这位"..JY.Person[0]["外号"].."，你可知道，我明*教为何会变成这样？", 10, 0)  --对话
Cls()  --清屏
TalkEx("这是六大派……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("我得到信息，就马上赶来，没想到还是晚了一步。", 10, 0)  --对话
Cls()  --清屏
TalkEx("你是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我乃明教光明右使范遥。这*位"..JY.Person[0]["外号"].."，你可否帮我一个忙*？", 10, 0)  --对话
Cls()  --清屏
TalkEx("当然可以，前辈请讲。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("我明教还有紫杉龙王和金毛狮王两位，能否麻烦小兄弟去把他们请来。", 10, 0)  --对话
else
	TalkEx("我明教还有紫杉龙王和金毛狮王两位，能否麻烦小姑娘去把他们请来。", 10, 0)  --对话
end
Cls()  --清屏
TalkEx("他们在哪里啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这……我也不太清楚，咱们*分头找找吧。", 10, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,296,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(73, 2,0,0,0,0,297,0,0,0,-2,-2,-2)  --修改场景事件
do return end
