instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
TalkEx("范遥，你干什么去了？光明顶怎么会变成这个样子？", 13, 0)  --对话
Cls()  --清屏
TalkEx("你还说我！要不是你到处惹是生非，咱明教也不会和六大派结下这么大的仇！", 10, 0)  --对话
Cls()  --清屏
TalkEx("我，唉，我真是愧对明教啊，我只有以死谢罪啦！", 13, 0)  --对话
Cls()  --清屏
TalkEx("狮王不可！眼下大仇未报，不可呀！", 10, 0)  --对话
Cls()  --清屏
TalkEx("是啊，范右使所言极是，狮王！", 0, 1)  --对话
Cls()  --清屏
TalkEx("又是你！你说吧，你助我明教，有什么企图？", 13, 0)  --对话
Cls()  --清屏
TalkEx("这个嘛，我要找一本书，名叫《倚天屠龙记》。", 0, 1)  --对话
Cls()  --清屏
TalkEx("此书乃我明教历代相传，不可轻与外人。", 10, 0)  --对话
Cls()  --清屏
TalkEx("如今明教都已不复存在，何言外人？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这……", 10, 0)  --对话
Cls()  --清屏
TalkEx("好，"..JY.Person[0]["外号2"].."，只要你帮我明教复仇，这本书就送给你！", 13, 0)  --对话
Cls()  --清屏
TalkEx("好，一言为定。", 0, 1)  --对话
Cls()  --清屏
TalkEx("剿灭六大派，就从最近的昆仑派开始吧，我二人先去，你尽快赶到。", 13, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 90,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 94,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(68, 18,0,0,0,0,0,5348,5348,5348,-2,-2,-2)  --修改场景事件
instruct_3(68, 19,0,0,0,0,0,5290,5290,5290,-2,-2,-2)  --修改场景事件
instruct_3(68, 17,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 20,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 21,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 22,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 23,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 24,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 25,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 26,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 27,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 28,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 29,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(68, 0,0,0,0,0,299,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(68, 14,0,0,0,0,299,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(68, 15,0,0,0,0,0,5294,5294,5294,-2,-2,-2)  --修改场景事件
instruct_3(68, 16,0,0,0,0,0,5334,5334,5334,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
