instruct_14()  --场景变黑
instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_37(-3)  --增加品德
TalkEx("没想到明教还留下你们两个余孽。", 7, 0)  --对话
Cls()  --清屏
TalkEx("废话少说，血债血偿。", 13, 0)  --对话
Cls()  --清屏
TalkEx("就凭你们二人之力，就想灭我昆仑不成？", 7, 0)  --对话
Cls()  --清屏
TalkEx("还有我！", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们上！", 10, 0)  --对话
Cls()  --清屏
if WarMain(155, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(124, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("好"..JY.Person[0]["外号2"].."，你果然守约。", 10, 0)  --对话
Cls()  --清屏
instruct_2(89, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("昆仑已灭，下一个，崆峒！", 13, 0)  --对话
Cls()  --清屏
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(34, 16,0,0,0,0,0,5364,5364,5364,-2,-2,-2)  --修改场景事件
instruct_3(34, 17,0,0,0,0,0,5364,5364,5364,-2,-2,-2)  --修改场景事件
instruct_3(34, 18,0,0,0,0,0,5364,5364,5364,-2,-2,-2)  --修改场景事件
instruct_3(34, 19,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 27,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 26,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 25,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 24,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 23,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 22,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 21,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 20,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(34, 54,0,0,0,0,0,5294,5294,5294,-2,-2,-2)  --修改场景事件
instruct_3(34, 55,0,0,0,0,0,5334,5334,5334,-2,-2,-2)  --修改场景事件
instruct_3(34, 53,0,0,0,0,300,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
