Cls()  --清屏
if instruct_16(1) == false then  --是否在队伍
	Cls()  --清屏
	TalkEx("他的女人是我的，宝藏也是*我的，武功也是我的，哈哈*哈……", 72, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你可是辽东大侠胡一刀之子*？", 72, 0)  --对话
Cls()  --清屏
TalkEx("你，你是什么人？", 1, 1)  --对话
Cls()  --清屏
TalkEx("你可知道你的杀父仇人是谁*？", 72, 0)  --对话
Cls()  --清屏
TalkEx("前辈如果知道，还望见教。*胡某感激不尽。", 1, 1)  --对话
Cls()  --清屏
TalkEx("你可知道\"打遍天下无敌手\"金面佛苗人凤？", 72, 0)  --对话
Cls()  --清屏
TalkEx("苗大侠的武功人品，是在下*一直久仰的。", 1, 1)  --对话
Cls()  --清屏
TalkEx("嘿嘿，你父胡一刀就是死在*苗人凤剑下！", 72, 0)  --对话
Cls()  --清屏
TalkEx("什么？……你怎么知道？", 1, 1)  --对话
Cls()  --清屏
TalkEx("此事乃我亲眼所见，绝无虚*假。你可以找苗人凤当面对*质。", 72, 0)  --对话
Cls()  --清屏
TalkEx("如此多谢了，我这就去找苗*人凤。", 1, 1)  --对话
Cls()  --清屏
TalkEx("且慢，你可有本事战胜苗人*凤？", 72, 0)  --对话
Cls()  --清屏
TalkEx("父仇不共戴天，胡某尽力而*为。", 1, 1)  --对话
Cls()  --清屏
TalkEx("这位"..JY.Person[0]["外号"].."，你可是在找十四*天书？", 72, 0)  --对话
Cls()  --清屏
TalkEx("你怎么什么都知道？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈，这就是我的本事。我*还可以告诉你，苗人凤身上*，就有你要的东西！", 72, 0)  --对话
Cls()  --清屏
TalkEx("你告诉我们这些，你有什么*企图？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."果然是明白人。不瞒"..JY.Person[0]["外号"].."，我也要从苗人凤身上找*一幅地图。你要报父仇，你*要找天书，我们有共同的敌*人苗人凤，无奈这苗人凤武*艺太高强。我们不妨一起合*作，我有办法让苗人凤束手*就擒。怎么样？", 72, 0)  --对话
Cls()  --清屏
TalkEx("大丈夫处世当光明磊落。父*仇虽大，胡某也绝不做小人*勾当。", 1, 1)  --对话
Cls()  --清屏
if instruct_9() then  --是否要求加入
	instruct_37(-2)  --增加品德
	Cls()  --清屏
	instruct_3(104, 84,1,0,973,0,0,7012,7012,7012,-2,-2,-2)  --修改场景事件
	instruct_3(3, 9,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 12,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 11,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(3, 10,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	TalkEx("胡大哥，我觉得这位先生说*的有道理，只要能达到我们*的目的，用什么手段不重要*。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("哼！我胡某看错人了！告辞*！", 1, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_21(1)  --离开队伍
	Cls()  --清屏
	instruct_13()  --场景变亮
	Cls()  --清屏
	TalkEx("唉，胡大哥，怎么那么心急*啊！", 0, 1)  --对话
	Cls()  --清屏
	TalkEx(JY.Person[0]["外号"].."，我们不必管他。要除*掉苗人凤，光靠你我二人还*不够，我们还要再找一个人*。", 72, 0)  --对话
	Cls()  --清屏
	TalkEx("谁？", 0, 0)  --对话
	Cls()  --清屏
	TalkEx("一个跌打医生！", 72, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(24, 0,0,0,0,0,33,0,0,0,0,0,0)  --修改场景事件
	instruct_3(50, 1,1,0,32,0,0,5168,5168,5168,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		Cls()  --清屏
		instruct_10(72)  --加入队伍
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去*小村吧。", 72, 0)  --对话
	Cls()  --清屏
	instruct_3(70, 40,1,0,159,0,0,7012,7012,7012,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_37(2)  --增加品德
TalkEx(JY.Person[0]["外号"].."不妨再考虑考虑。", 72, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,4,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(24, 0,0,0,0,0,5,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(3, 9,1,0,637,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 12,1,0,637,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 11,1,0,637,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 10,1,0,637,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
