instruct_14()  --场景变黑
instruct_26(40,9,1,0,0)  --修改场景事件
instruct_26(40,10,1,0,0)  --修改场景事件
instruct_26(40,12,1,0,0)  --修改场景事件
instruct_39(4)  --打开场景
instruct_13()  --场景变亮
instruct_37(-9)  --增加品德
instruct_30(46,28,39,28)  --人物移动
TalkEx("明教余孽，受死吧！", 8, 0)  --对话
Cls()  --清屏
if WarMain(152, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 28,0,0,0,0,0,5962,5962,5962,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("崆峒派莫要惊惶，华山派得到信息，前来增援！", 109, 0)  --对话
Cls()  --清屏
TalkEx("来得好，省得我们到处跑了！", 13, 0)  --对话
Cls()  --清屏
if WarMain(153, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(142, 1)  --得到或失去物品
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 43,0,0,0,0,0,5358,5358,5358,-2,-2,-2)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 51,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 49,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("魔教休得猖狂，峨嵋派前来支援！", 6, 0)  --对话
Cls()  --清屏
TalkEx("老贼尼，赶来送死，我们就成全你！", 10, 0)  --对话
Cls()  --清屏
if WarMain(154, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 53,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 51,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
--[[
instruct_3(33, 13,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 12,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 11,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 10,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 9,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 8,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 7,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 28,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 28,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 27,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 26,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 25,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 24,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(33, 20,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件]]
Cls()  --清屏
instruct_13()  --场景变亮
--instruct_2(120, 1)  --得到或失去物品
Cls()  --清屏
instruct_2(37, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("哈哈哈，如今四派已灭，就剩下少林和武当了。先诛少林，再灭武当，唯我明教，武林称王！哈哈哈……", 13, 0)  --对话
Cls()  --清屏
TalkEx("这是老夫自创的独门功法，就送给你吧！", 13, 0)  --对话
Cls()  --清屏
instruct_2(69, 1)  --得到或失去物品
Cls()  --清屏
instruct_3(-2, 54,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 55,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(33, 0,0,0,0,0,4206,0,0,0,-2,-2,-2)  --周芷若事件
instruct_3(33, 1,0,0,0,0,4206,0,0,0,-2,-2,-2)  --周芷若事件
instruct_3(33, 2,0,0,0,0,0,5398,5398,5398,-2,-2,-2)  --修改场景事件
instruct_3(33, 29,0,0,0,0,0,4686*2,4686*2,4686*2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
