--function oldevent_301()

    if instruct_60(-2,38,2286,0,46) ==true then    --  60(3C):判断场景-2事件位置38是否有贴图2286否则跳转到:Label0

        if instruct_16(49,0,42) ==true then    --  16(10):队伍是否有[虚竹]否则跳转到:Label1
            instruct_3(-2,38,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
            instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
            instruct_14();   --  14(E):场景变黑
            instruct_13();   --  13(D):重新显示场景
            instruct_1(2599,49,0);   --  1(1):[虚竹]说: 谢谢施主送我回少林，我这就去了。佛祖曾经对我说，如果有人送我回少林，那这个人就是个好人，因为他放弃了小无相功、天山六阳掌、天山折梅手、八荒六合功等武功，因此佛祖要给这个人加上十点道德。施主，你真是个好人，再会。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_21(49);   --  21(15):[虚竹]离队
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_37(10);   --  37(25):增加道德10
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label1

    end    --:Label0


    if instruct_60(-2,36,2286,0,935) ==true then    --  60(3C):判断场景-2事件位置36是否有贴图2286否则跳转到:Label2
		if instruct_16(631) == false then  --是否在队伍
			Cls()  --清屏
			say("倚天邪线少林剧情需要周芷若在队才可触发。",0,2)
			Cls()  --清屏
			null(-2,-2)
			do return end  --无条件结束事件
		end
        instruct_14();   --  14(E):场景变黑
		
		instruct_3(-2,36,0,0,0,0,0,0,0,0,-2,-2,-2);   -- 事件判定
		
		addevent(-2, 91, 1, nil, nil, 2667*2)
		
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,49,16);   --  30(1E):主角走动53-19--50-19
		
		stands()
		
		say("范右使，怎么不见狮王？",0,1)
		
		say("说来惭愧，此前我们夜谈少林寺，岂料突然间杀出三个老和尚，使出一套神鬼莫测的功夫，将我们打败。",10,0)
		
		say("最终狮王被擒，那三个老和尚更是扬言，要在端午节举行屠狮英雄会。",10,0)
		
		say("Ｄ屠狮英雄会？！",0,1)
		
		say("正是，狮王多年前失手错杀少林寺空见神僧，一直心有愧疚，此次狮王甘心被擒，未必没有以命偿命的心思在里面……",10,0)
		
		say("我已经了解，多年来六大派与明教互相杀戮结下深仇，整个事情的罪魁祸首乃是成昆。",0,1)
		
		say("范右使，狮王现在何处？",0,1)
		
		say("少林后山。",10,0)
		
		say("事不宜迟，我这就去向他们解释事情的经过，期盼能够解开其中的误会。",0,1)
		
		say("那就有劳"..JY.Person[0]["外号"].."了，这把屠龙刀是狮王的随身之物，希望能帮到你，我回光明顶等你的好消息。",10,0)
		
		instruct_2(43, 1)	--屠龙刀
		
		dark()
		
		null(-2, 91)
		
		addevent(-2, 91, 1, nil, nil, 4685*2)
		
		addevent(-2, 90, 1, 4111, 1, -2)
		
        light()
		
		say(JY.Person[0]["外号"].."，如今倚天剑和屠龙刀都已在你手中，这刀剑中的秘密我也不妨说给你听。", 357, 0,"周芷若")  --对话
		
		say("周姑娘请讲。",0,1)
		
		say("只需这般……如此这般……", 357, 0,"周芷若")  --对话
		
		say("什么！此话当真？",0,1)
		
		say("这是家师临终之前托付于我的，想必不假。"..JY.Person[0]["外号"].."如果不信，当场试试便知。", 357, 0,"周芷若")  --对话
		
		say("好，那就试试。",0,1)
		
		dark()
		
		light()
		
		if JY.Thing[37]["使用人"] ~= -1 then
			JY.Person[JY.Thing[37]["使用人"]]["武器"] = -1
			JY.Thing[37]["使用人"] = -1
		end
		if JY.Thing[43]["使用人"] ~= -1 then
			JY.Person[JY.Thing[43]["使用人"]]["武器"] = -1
			JY.Thing[43]["使用人"] = -1
		end
		
		instruct_2(37,-1)
		
		instruct_2(43,-1)
		
		instruct_2(287,1)
		
		instruct_2(290,1)	--白蟒鞭法
		
		instruct_32(288,1)
		
		instruct_32(289,1)
		
		say("这是……想不到这刀剑之中还有如此秘密，周掌门，这次可要多谢你了。",0,1)
		
		say(JY.Person[0]["外号"].."不用客气，这九阴真经中的武功奥妙无穷，小妹只求习得一招半式，以光大本门。", 357, 0,"周芷若")  --对话
		
		say("好说，好说。",0,1)
		
		dark()
		
		null(-2,-2)
		
		null(-2,91)
		
		light()
		
		awakening(631, 1)	--周芷若觉醒一次
		
		local xid = 631;
		if JY.Base["畅想"] == 631 then
			xid = 0
		end
	
		DrawStrBoxWaitKey("周芷若五系兵器值各提升十点", C_ORANGE, CC.DefaultFont,nil,LimeGreen)
		AddPersonAttrib(xid, "拳掌功夫", 10)
		AddPersonAttrib(xid, "指法技巧", 10)
	    AddPersonAttrib(xid, "御剑能力", 10)
	    AddPersonAttrib(xid, "耍刀技巧", 10)
	    AddPersonAttrib(xid, "特殊兵器", 10)
		
		--周芷若洗九阴
		instruct_35(631,1,107,0)
		SetTianNei(631,107)	--周芷若天内洗九阴
		SetTianWai(631, 2, 11)
		SetTianWai(631, 3, 164)
		DrawStrBoxWaitKey("周芷若学会武功【Ｇ九阴神功Ｏ】", C_ORANGE, CC.DefaultFont, 2)
		
		local r = JYMsgBox("请选择", "是否要替换周芷若的第一格武功？", {"白骨爪","白蟒鞭","放弃"}, 3, 357)
		if r == 1 then
			instruct_35(631,0,11,0)
			instruct_2(102,1)	--白骨爪
		elseif r == 2 then
			instruct_35(631,0,164,0)
		end
		do return; end
    end    --:Label2


    if instruct_60(-2,37,2286,0,1815) ==true then    --  60(3C):判断场景-2事件位置37是否有贴图2286否则跳转到:Label4
		JY.Person[50]["姓名"] = "萧峰"
		if JY.Base["畅想"] == 50 then
			JY.Person[0]["姓名"] = "萧峰"
		end
        instruct_37(3);   --  37(25):增加道德3
        instruct_26(40,13,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,15,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_26(40,14,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,37,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
        instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
        instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,48,0,0,0,0,0,6380,6380,6380,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,58,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,59,0,0,0,0,0,6304,6304,6304,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,61,1,0,572,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
        instruct_3(-2,60,1,0,572,0,0,7136,7136,7136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
        instruct_3(-2,62,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,63,0,0,0,0,0,5330,5330,5330,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,64,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,65,0,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,66,0,0,0,0,0,7126,7126,7126,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,70,0,0,0,0,0,4280*2,4280*2,4280*2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(53,19,52,19);   --  30(1E):主角走动53-19--52-19
        instruct_30(52,19,52,37);   --  30(1E):主角走动52-19--52-37
        instruct_40(2);   --  40(28):改变主角站立方向2
		stands()
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_25(52,37,43,37);   --  25(19):场景移动52-37--43-37
        instruct_25(43,37,43,44);   --  25(19):场景移动43-37--43-44
        instruct_25(43,44,52,44);   --  25(19):场景移动43-44--52-44
        instruct_25(52,44,52,37);   --  25(19):场景移动52-44--52-37
        instruct_25(52,37,48,36);   --  25(19):场景移动52-37--48-36
        instruct_1(2419,48,0);   --  1(1):[游坦之]说: 少林寺玄慈方丈，少林派是武林中各门派之首，丐帮是江湖第一大帮，向来并峙中原，不相统属。今日咱们却要分个高下，胜者为武林盟主，败者服从武林盟主号令，不得有违。天下各位英雄好汉，今日都聚集在此，有哪一位不服，尽可向武林盟主挑战。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2420,70,0);   --  1(1):[玄慈]说: 阿弥陀佛。丐帮数百年来，乃中原武林的侠义正道，天下英雄，无不瞻仰。庄帮主新任帮主，敝派得讯迟了，未及遣使道贺，不免有简慢之罪，谨此谢过。却不知庄帮主今日何以忽兴问罪之师，还盼见告。天下英雄，俱在此间，是非曲直，自由公论。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2421,48,0);   --  1(1):[游坦之]说: 我大宋南有辽国，西有西夏、吐蕃，北有大理，四夷虎视眈眈，这个……这个……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2422,0,1);   --  1(1):[???]说: 什么"南有辽国，北有大理"，好大一个丐帮，竟由你这种不学无术之人出任帮主，岂不让天下英雄笑话！你要争武林盟主是吗？不用玄慈方丈动手，我先来领教领教丐帮得降龙十八掌和打狗棒法！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2423,48,0);   --  1(1):[游坦之]说: 降龙十八掌？……这个……这个……
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(197,4,0,0) ==false then    --  6(6):战斗[197]是则跳转到:Label5
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label5

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2424,0,1);   --  1(1):[???]说: 你这是什么毒功！！身为丐帮帮主，为什么不用降龙十八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2425,48,0);   --  1(1):[游坦之]说: 这个……这是……因为……这个武功比降龙十八掌厉害……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2426,50,0);   --  1(1):[乔峰]说: 谁说这邪门毒功胜过了降龙十八掌？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,69,0,0,0,0,0,8240,8240,8240,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,68,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_30(52,37,52,43);   --  30(1E):主角走动52-37--52-43
        instruct_30(52,43,45,43);   --  30(1E):主角走动52-43--45-43
        instruct_40(3);   --  40(28):改变主角站立方向3
		stands()
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2427,0,1);   --  1(1):[???]说: 乔大哥、阿朱姑娘！
        instruct_0();   --  0(0)::空语句(清屏)
		if JY.Person[0]["性别"] == 0 then
			TalkEx("小兄弟好。今后不要再叫我乔大哥了。我是契丹人，萧峰！", 50, 0)  --对话
		else
			TalkEx("妹子好。今后不要再叫我乔大哥了。我是契丹人，萧峰！", 50, 0)  --对话
		end
        --instruct_1(2428,50,0);   --  1(1):[乔峰]说: 小兄弟好。今后不要再叫我乔大哥了。我是契丹人，萧峰！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2429,0,1);   --  1(1):[???]说: 乔也罢，萧也罢，汉人也好，契丹也好，你始终是我的好大哥！
        instruct_0();   --  0(0)::空语句(清屏)
		if JY.Person[0]["性别"] == 0 then
			TalkEx("哈哈哈，好兄弟！", 50, 0)  --对话
		else
			TalkEx("哈哈哈，好妹子！", 50, 0)  --对话
		end
        --instruct_1(2430,50,0);   --  1(1):[乔峰]说: 哈哈哈，好兄弟！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2431,0,2);   --  1(1):[AAA]说: 众人：姓乔的，你杀了我的兄长，血仇未曾得报，今日和你拼了！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2432,0,2);   --  1(1):[AAA]说: 众人：这乔峰乃契丹胡虏，人人得而诛之，今日可再也不能容他或者走下少室山！
        instruct_0();   --  0(0)::空语句(清屏)
		say("Ｌ＜这乔峰如今已被逐出丐帮，成为中原武林的公敌，我正好趁此机会，收揽人心，以为己助＞", 51, 0)  --对话
		instruct_0();
		say("萧兄，你是契丹英雄，视我中原豪杰有如无物，区区姑苏慕容复今日想领教阁下高招。", 51, 0)  --对话
		instruct_0();
		say("在下死在萧兄掌下，也算是为中原豪杰尽了一分微力，虽死犹荣。", 51, 0)  --对话
        --instruct_1(2433,51,0);   --  1(1):[慕容复]说: ＜这乔峰如今已被逐出丐帮，成为中原武林的公敌，我正好趁此机会，收揽人心，以为己助。＞  萧兄，你是契丹英雄，视我中原豪杰有如无物，区区姑苏慕容复今日想领教阁下高招。在下死在萧兄掌下，也算是为中原豪杰尽了一分微力，虽死犹荣。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2434,0,1);   --  1(1):[???]说: 住口！你与萧大哥素无恩怨，为何一再苦苦相逼！你处心积虑，收买人心，就为了你那虚无缥缈的皇帝梦！要碰我大哥，先过我这一关！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(198,4,0,0) ==false then    --  6(6):战斗[198]是则跳转到:Label6
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label6

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2435,48,0);   --  1(1):[游坦之]说: 杀父之仇，不共戴天，姓萧的，今日便来做个了断！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2436,50,0);   --  1(1):[乔峰]说: 尽管来吧，萧某何惧！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(199,4,0,0) ==false then    --  6(6):战斗[199]是则跳转到:Label7
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label7

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2437,103,0);   --  1(1):[???]说: 久闻降龙十八掌天下无双，贫僧也要领教一二。
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(200,4,0,0) ==false then    --  6(6):战斗[200]是则跳转到:Label8
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label8

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
		
		instruct_2(269, 1)	--无相劫指
		
        --instruct_1(2438,98,0);   --  1(1):[???]说: ＜这萧峰武功卓绝，而且似乎与段正淳他们交情不错，不如今日借着人多势众，将之除去……＞我们也上！
		say("Ｌ＜这萧峰武功卓绝，而且似乎与段正淳他们交情不错，不如今日借着人多势众，将之除去……＞Ｗ我们也上！",98,0);
        instruct_0();   --  0(0)::空语句(清屏)
        --instruct_1(2439,207,0);   --  1(1):[???]说: 这萧峰乃是契丹胡虏，武林公敌，更是我们丐帮的叛徒，丐帮兄弟们，一起上啊！
		TalkEx("这萧峰乃是契丹胡虏，武林公敌，更是我们丐帮的叛徒，丐帮兄弟们，一起上啊！", 207, 0,"丐帮弟子")  --对话
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2440,0,1);   --  1(1):[???]说: 想仗着人多欺负人吗？来吧！
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_6(81,4,0,0) ==false then    --  6(6):战斗[81]是则跳转到:Label9
            instruct_15(0);   --  15(F):战斗失败，死亡
            do return; end
            instruct_0();   --  0(0)::空语句(清屏)
        end    --:Label9

        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        --instruct_1(2441,76,0);   --  1(1):[???]说: 啊……表哥小心！……公子手下留情啊！
		say("啊……表哥小心！……"..JY.Person[0]["外号"].."手下留情啊！",76,0);
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2442,0,1);   --  1(1):[???]说: 哼，看在王姑娘的面子上，今日姑且留你一命！
        instruct_0();   --  0(0)::空语句(清屏)
        --instruct_1(2443,51,0);   --  1(1):[慕容复]说: ＜我……我今日数次惨败，居然还要女人求情来保住性命，我还有何颜面活在这世上，不如干脆……＞
		say("Ｌ＜我……我今日数次惨败，居然还要女人求情来保住性命，我还有何颜面活在这世上，不如干脆……＞",51,0);
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2444,113,0);   --  1(1):[???]说: 住手！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_3(-2,67,0,0,0,0,0,7132,7132,7132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2445,113,0);   --  1(1):[???]说: 你有儿子没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2446,51,0);   --  1(1):[慕容复]说: 我尚未婚配，何来子嗣？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2447,113,0);   --  1(1):[???]说: 你有祖宗没有？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2448,51,0);   --  1(1):[慕容复]说: 自然有！我自愿就死，与你何干？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2449,113,0);   --  1(1):[???]说: 你高祖有儿子，你曾祖、祖父、父亲都有儿子，便是你没儿子！嘿嘿，大燕国当年慕容恪、慕容垂何等英雄，却不料都变成了断种绝代的无后之人！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2450,51,0);   --  1(1):[慕容复]说: 这……慕容复见识短绌，得蒙高人指点迷津，大恩大德，没齿难忘。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2451,113,0);   --  1(1):[???]说: 萧大侠武功卓绝，果然名不虚传，老夫想领教几招！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2452,50,0);   --  1(1):[乔峰]说: 不敢！请！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2453,112,0);   --  1(1):[???]说: 哈哈哈……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,71,0,0,0,0,0,7134,7134,7134,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_1(2454,113,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2454,112,0);   --  1(1):[???]说: 你……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2455,113,0);   --  1(1):[???]说: 你在少林寺中一躲数十年，所为何事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2456,112,0);   --  1(1):[???]说: 我也正要问你，你在少林寺中一躲数十年，又所为何事？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2457,113,0);   --  1(1):[???]说: 我藏身少林，是为了寻找一些东西。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2458,112,0);   --  1(1):[???]说: 我也是为了寻找一些东西，我想找得东西已经找到，我想你要找的东西也已经找到了，否则我们三次较量，该当分出了高下。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2459,113,0);   --  1(1):[???]说: 不错，尊驾武功了得，你我互相钦服，不用再较量了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2460,112,0);   --  1(1):[???]说: 甚好！
        instruct_0();   --  0(0)::空语句(清屏)
        --instruct_1(2461,50,0);   --  1(1):[乔峰]说: ＜这个声音……不正是那日救我出聚贤庄的黑衣人吗？……＞ 恩公，请受萧峰一拜！
		say("Ｌ＜这个声音……不正是那日救我出聚贤庄的黑衣人吗？……＞Ｗ恩公，请受萧峰一拜！",50,0);
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2462,112,0);   --  1(1):[???]说: 恩公？哈哈哈，你再仔细看看我！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2463,50,0);   --  1(1):[乔峰]说: 你……你是我爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2464,112,0);   --  1(1):[???]说: 好孩儿，好孩儿，我正是你爹爹。咱爷俩一般的身形相貌。不用记认，谁都知道我是你的老子。那日雁门关外，中原豪杰不问情由，便杀了你不会武功的妈妈。孩儿，你说此仇该不该报？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2465,50,0);   --  1(1):[乔峰]说: 杀母之仇，不共戴天，焉可不报？智光大师、谭公、谭婆、赵钱孙等人皆已死于非命，可是孩儿至今不知那位带头大哥是谁。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2466,112,0);   --  1(1):[???]说: 那些人都是我杀的！那个带头大哥就在少室山！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2467,50,0);   --  1(1):[乔峰]说: 是谁？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2468,70,0);   --  1(1):[玄慈]说: 萧老施主，雁门关外一役，老衲铸成大错。众家兄弟为老衲包涵此事，又一一送命。老衲今日再死，实在已经晚了。慕容博慕容老施主，当日你假传音讯，说道契丹武士要大举来少林寺夺取武学典籍，以致酿成种种大错，你可也曾有丝毫内疚于心吗？
        instruct_0();   --  0(0)::空语句(清屏)
        --instruct_1(2469,113,0);   --  1(1):[???]说: 方丈大师，你眼光好生厉害，居然将我认了出来
		say("方丈大师，你眼光好生厉害，居然将我认了出来。",113,0);   --  1(1):[???]说: 方丈大师，你眼光好生厉害，居然将我认了出来
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2470,51,0);   --  1(1):[慕容复]说: 爹爹，你……你没有……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2471,70,0);   --  1(1):[玄慈]说: 慕容老施主，老衲今日听你对令郎的劝导言语，才知你姑苏慕容氏竟是帝王之裔，所谋者大。那么你假传音讯的用意，也就明白不过了。只是你所图谋的大事，却也终究难成，那不是枉自害死了这许多无辜的性命么？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2472,113,0);   --  1(1):[???]说: 谋事在人，成事在天！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2473,112,0);   --  1(1):[???]说: 慕容老贼，原来你才是罪魁祸首，上来领死吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2474,113,0);   --  1(1):[???]说: 哈哈哈，恕不奉陪！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2475,112,0);   --  1(1):[???]说: 想跑？追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2476,50,0);   --  1(1):[乔峰]说: 追！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,59,0,0,0,0,0,-2,-2,-2,0,17,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        instruct_3(-2,71,0,0,0,0,0,-2,-2,-2,-2,16,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,16,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,67,0,0,0,0,0,-2,-2,-2,-2,17,50);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        --instruct_1(2478,0,1);   --  1(1):[AAA]说: 恩……他们竟然跑向了少林的藏经阁，我得过去看看
		say("他们跑向了少林寺的藏经阁，我得过去看看。",0,1);   --  1(1):[AAA]说: 恩……他们竟然跑向了少林的藏经阁，我得过去看看
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_19(26,52);   --  19(13):主角移动至1A-34
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        instruct_25(26,52,15,54);   --  25(19):场景移动26-52--15-54
        --instruct_1(2479,0,1);   --  1(1):[AAA]说: ＜这老和尚是何方神圣？竟然能降服萧远山和慕容博两位老英雄？＞
		say("Ｌ＜这老和尚是何方神圣？竟然能降服萧远山和慕容博两位老英雄？＞",0,1);
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2480,114,0);   --  1(1):[???]说: 你二人由生到死、由死到生地走了一遍，心中还有什么放不下？倘若适才就此死了，还有什么兴复大燕、报复妻仇的念头？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2481,112,0);   --  1(1):[???]说: 弟子生平杀人，无虑百数，倘若被我所杀之人的眷属皆来向我复仇索命，弟子虽死百次，亦自不足。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2482,114,0);   --  1(1):[???]说: 你呢？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2483,113,0);   --  1(1):[???]说: 庶民如尘土，帝王亦如尘土。大燕不复国是空，复国亦是空。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2484,114,0);   --  1(1):[???]说: 大彻大悟，善哉善哉，你二人这就随我去吧。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,50,0);   --  1(1):[乔峰]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2477,51,0);   --  1(1):[慕容复]说: 爹爹……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,0,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
        instruct_3(-2,35,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
        instruct_3(-2,34,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
        instruct_3(-2,33,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
        instruct_3(-2,32,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
        instruct_3(-2,31,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
        instruct_3(-2,30,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
        instruct_3(-2,29,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
        instruct_3(-2,28,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
        instruct_3(-2,27,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
        instruct_3(-2,26,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
        instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
        instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
        instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
        instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
        instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
        instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
        instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
        instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
        instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
        instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
        instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
        instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
        instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
        instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
        instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
        instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
        instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
        instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
        instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
        instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
        instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
        instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
        instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
        instruct_3(-2,68,0,0,0,0,0,-2,-2,-2,-2,25,52);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,-2,-2,-2,-2,26,53);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(-2,71,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
        instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
        instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
        --instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
        instruct_19(26,52);
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        --instruct_1(2485,50,0);   --  1(1):[乔峰]说: 好兄弟，你是个顶天立地的好男儿，我知道你在寻找《天龙八部》一书，此书我今日就赠送与你。
		if JY.Person[0]["性别"] == 0 then
			say("好兄弟，你是个顶天立地的好男儿，我知道你在寻找《天龙八部》一书，此书我今日就赠送与你。",50,0);
		else
			say("好妹子，你英气豪爽，大哥我甚是敬佩喜欢，我知道你在寻找《天龙八部》一书，此书我今日就赠送与你。",50,0);
		end
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(147,1);   --  2(2):得到物品[天龙八部][1]
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2486,0,0);   --  1(1):[AAA]说: 多谢大哥。不知大哥今后有何打算？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2508,50,0);   --  1(1):[乔峰]说: 我会与阿朱去塞外。塞外牛羊，绝不是空许约！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2488,104,0);   --  1(1):[???]说: 大哥，你待我真好。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(2489,50,0);   --  1(1):[乔峰]说: 这降龙十八掌乃天下至刚的掌法，我不想此掌法从此失传，今日也一并传给你吧。希望你将此掌法用于正途，发扬光大。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(86,1);   --  2(2):得到物品[降龙十八掌][1]
        instruct_0();   --  0(0)::空语句(清屏)
        --instruct_1(2490,0,1);   --  1(1):[AAA]说: 多谢大哥。大哥教诲，小弟紧记在心。
		if JY.Person[0]["性别"] == 0 then
			say("多谢大哥。大哥教诲，小弟紧记在心。",0,1);
		else
			say("多谢大哥。大哥教诲，小妹紧记在心。",0,1);
		end
        instruct_0();   --  0(0)::空语句(清屏)
		if JY.Person[0]["性别"] == 0 then
			say("阿朱，我们走吧。兄弟，日后有缘，也许还有相见之日。告辞了。",50,0);
		else
			say("阿朱，我们走吧。妹子，日后有缘，也许还有相见之日。告辞了。",50,0);
		end
        --instruct_1(2491,50,0);   --  1(1):[乔峰]说: 阿朱，我们走吧。兄弟，日后有缘，也许还有相见之日。告辞了。
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
        instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
        instruct_3(77,0,1,0,1061,0,0,6414,6414,6414,-2,-2,-2);   --  3(3):修改事件定义:场景[万鳄岛]:场景事件编号 [0]
		instruct_3(-2,14,1,0,4143,0,0,-2,-2,-2,-2,-2,-2)  --挑战扫地僧事件
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        do return; end
    end    --:Label4

    if JY.Person[51]["品德"] == 41 then	--用慕容复的道德做判定
		local txrw =0
		if inteam(51) then
			txrw = txrw + 1
		end
		if inteam(76) then
			txrw = txrw + 1
		end
		if inteam(48) then
			txrw = txrw + 1
		end
		if txrw ~= 3 then
			say("天龙邪线少林剧情需要慕容复，王语嫣，游坦之同时在队才可触发。",0,2)
			null(-2,-2)
			do return end
		else
			JY.Person[50]["姓名"] = "萧峰"
			if JY.Base["畅想"] == 50 then
				JY.Person[0]["姓名"] = "萧峰"
			end
			instruct_14();   --  14(E):场景变黑
			instruct_3(-2,16,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
			instruct_3(-2,0,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
			instruct_3(-2,34,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
			instruct_3(-2,35,0,0,0,0,0,5372,5372,5372,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
			instruct_3(-2,1,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
			instruct_3(-2,33,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
			instruct_3(-2,32,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
			instruct_3(-2,31,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
			instruct_3(-2,30,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
			instruct_3(-2,29,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
			instruct_3(-2,28,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
			instruct_3(-2,27,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
			instruct_3(-2,26,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
			instruct_3(-2,6,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [6]
			instruct_3(-2,5,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [5]
			instruct_3(-2,4,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [4]
			instruct_3(-2,3,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
			instruct_3(-2,2,0,0,0,0,0,5420,5420,5420,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
			--instruct_3(-2,48,0,0,0,0,0,6380,6380,6380,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
			instruct_3(-2,58,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
			instruct_3(-2,57,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
			instruct_3(-2,56,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
			instruct_3(-2,55,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
			instruct_3(-2,54,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
			instruct_3(-2,53,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
			instruct_3(-2,52,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
			instruct_3(-2,51,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
			instruct_3(-2,50,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
			instruct_3(-2,49,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
			instruct_3(-2,59,0,0,0,0,0,6304,6304,6304,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
			instruct_3(-2,61,1,0,572,0,0,6312,6312,6312,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
			instruct_3(-2,60,1,0,572,0,0,7136,7136,7136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
			instruct_3(-2,62,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
			instruct_3(-2,63,0,0,0,0,0,5330,5330,5330,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
			instruct_3(-2,64,0,0,0,0,0,8212,8212,8212,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
			instruct_3(-2,65,0,0,0,0,0,7128,7128,7128,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
			instruct_3(-2,66,0,0,0,0,0,7126,7126,7126,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
			--instruct_3(-2,70,0,0,0,0,0,8216,8216,8216,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
			
			addevent(-2, 88, 1, nil, nil, 6380)	--游坦之
			addevent(-2, 89, 1, nil, nil, 4281*2)	--明王

			JY.Base["人X1"]=48
			JY.Base["人Y1"]=36
			instruct_40(3)  --主角面向左
			stands()
			
			instruct_0();   --  0(0)::空语句(清屏)
			
			instruct_13();   --  13(D):重新显示场景

			instruct_0();   --  0(0)::空语句(清屏)
			
			say("少林寺玄慈方丈，少林派是武林中各门派之首，丐帮是江湖第一大帮，数百年来并峙中原，不相统属。", 0, 4)  --对话
			
			say("今日咱们要分个高下，胜者为武林盟主，带领大伙儿保国安民，败者服从武林盟主号令，不得有违。", 0, 4)  --对话
			
			say("天下各位英雄好汉，今日都聚集在少室山上，有哪一位不服，尽可向武林盟主挑战。", 0, 4)  --对话
			
			say("阿弥陀佛。丐帮数百年来，乃中原武林的侠义正道，天下英雄，无不敬仰。", 70, 0)  --对话
			
			say("贵帮推举新帮主，敝派得讯迟了，未及遣使道贺，不免有简慢之罪，谨此谢过。", 70, 0)  --对话
			
			say("贵帮前任帮主汪剑通帮主，与敝派交情着实不浅。却不知帮主今日何以忽兴问罪之师，还盼见告。天下英雄，俱在此间，是非曲直，自有公论。", 70, 0)  --对话
			
			say("Ｌ＜少林方丈，果然是不简单＞", 0, 4)  --对话
			
			say("我大宋北有辽国，西有西夏、吐蕃，南有大理，四夷虎视眈眈。", 0, 4)  --对话
			
			say("然我大宋兵微将寡，国势脆弱，全赖我武林义士，江湖同道，大伙儿一同匡扶，这才能外抗强敌，内除奸人。", 0, 4)  --对话
			
			say("〔众人〕不错，不错。", 0, 2)  --对话
			
			say("只不过近年来外患日深，大伙儿本当齐心合力，共赴艰危。可是各门各派，各帮各会，却你争我斗，不能够齐心。", 0, 4)  --对话
			
			say("契丹人乔峰单枪匹马地来聚贤庄一闹，中原豪杰便一败涂地。又听说西域星宿海的星宿老怪曾连杀少林派的两名高僧，少林派束手无策……", 0, 4)  --对话
			
			say("阿弥陀佛。老衲两位师弟不幸为奸人所害，着实令人心痛。然敝派正在商议对策，不劳外人费心。", 70, 0)  --对话
			
			say("方丈此言差矣。我大宋国步艰危，江湖同道却又不能齐心合力，以致常受番邦欺压。", 0, 4)  --对话
			
			say("因此丐帮主张立一位武林盟主，大伙儿听奉号令，有什么大事发生，便不致乱成一团了。", 0, 4)  --对话
			
			say("玄慈大师，你只需胜得了在下，丐帮便唯少林马首是瞻，从此并肩抗敌。", 0, 4)  --对话
			
			say("此乃造福中原武林，造福黎民百姓之举，望方丈勿再碍于门派，身份之见，阻挠利于天下苍生的大业。", 0, 4)  --对话
			
			say("〔众人〕丐帮帮主的话，确实有些道理。", 0, 2)  --对话
			
			say("帮主的话，倒也言之成理。阁下既非要老衲出手不可，老衲若再顾念贵帮和敝派数百年的交情，坚不肯允，倒是对贵帮不敬了。", 70, 0)  --对话
			
			say("老衲今日便以本派大金刚掌接一接帮主的降龙十八掌绝技，也好让天下英雄好汉，瞧瞧丐帮帮主数百年来的嫡传功夫。", 70, 0)  --对话
			
			say("Ｌ＜这老和尚一定是明知我不会降龙十八掌，故意将我一军＞", 0, 4)  --对话
			
			say("降龙十八掌只是二流功夫，怎么比得上我们帮主的Ｇ逍遥游Ｗ？", 207, 4,"丐帮弟子")  --对话
			
			say("谁说降龙十八掌只是二流功夫？", 50, 0)  --对话
			
			dark()
			
			addevent(-2, 69, 1, nil, nil, 4120*2)
			addevent(-2, 85, 1, nil, nil, 3048*2)
			addevent(-2, 86, 1, nil, nil, 3048*2)
			
			light()
			
			say("〔小部分丐帮帮众〕乔帮主，乔帮主来了！", 0, 2)  --对话
			
			say("契丹人萧峰已给丐帮逐出，与丐帮更无瓜葛。众位何得仍用旧日称呼？众位兄弟，别来俱都安好？", 50, 0)  --对话
			
			say("〔小部分丐帮帮众〕乔……乔……你老人家好，自别之后，咱们无日不……不想念你老人家。", 0, 2)  --对话
			
			say("大哥，别来可好？这可想煞小弟了。", 53, 4)  --对话
			
			say("兄弟，别来多事，一言难尽，差幸你我俱都安好。", 50, 0)  --对话
			
			say("〔众人〕姓乔的，你杀了我的兄长，血仇未曾得报，今日和你拼了！", 0, 2)  --对话
			
			say("〔众人〕这乔峰乃契丹胡虏，人人得而诛之，今日可再也不能容他活着走下少室山！", 0, 2)  --对话
			
			say("Ｌ＜今日本想暗中探访\"带头大哥\"的身份，想不到少室山上竟有这许多对头聚在一起。＞", 50, 0)  --对话
			
			say("Ｌ＜眼下一场恶战在所难免，能否全身而退殊难预料，何必搭上段誉兄弟？＞", 50, 0)  --对话
			
			say("兄弟，此时局面恶劣，你我兄弟难以多叙，你暂且退开，山高水长，后会有期。", 50, 0)  --对话
			
			say("大哥，做兄弟的跟你结义之时，说什么来着？", 53, 4)  --对话
			
			say("咱俩有福同享，有难同当，不求同年同月同日生，但愿同年同月同日死。今日大哥有难，兄弟安能苟且偷生？", 53, 4)  --对话
			
			say("兄弟，你的好意，哥哥甚是感谢。他们想要杀我，却也没这么容易。你快退开，否则我要分手护你，反而不便迎敌。", 50, 0)  --对话
			
			say("你不用护我，他们和我无怨无仇，如何便来杀我？", 53, 4)  --对话
			
			say("Ｌ＜轻轻摇头，心头苦涩：倘若无怨无仇便不构陷加害，世间种种恶行，估计可以消去大半了＞", 50, 0)  --对话
			
			say("杀父之仇，不共戴天。姓萧的，咱们今日便来做个了断！",48, 0)  --对话
			
			say("游兄，我来助你！", 0, 4)  --对话
			
			--游坦之，慕容复，王语嫣，血量临时翻倍
			JY.Person[48]["血量翻倍"] = JY.Person[592]["血量翻倍"]
			JY.Person[51]["血量翻倍"] = JY.Person[592]["血量翻倍"]
			JY.Person[76]["血量翻倍"] = JY.Person[592]["血量翻倍"]
			
			--主角+游坦之 双挑乔狗
			if WarMain(249, 0) == false then  --战斗开始
				instruct_15()  --死亡
				Cls()  --清屏
				do return end  --无条件结束事件
				Cls()  --清屏

			end
			light()
			
			say("Ｌ＜这乔峰如今已被逐出丐帮，成为中原武林的公敌，我正好趁此机会，收揽人心，以为己助＞", 51, 0)  --对话
			
			say("萧兄，你是契丹英雄，视我中原豪杰有如无物，区区姑苏慕容复今日想领教阁下高招。", 51, 0)  --对话
			
			say("在下死在萧兄掌下，也算是为中原豪杰尽了一分微力，虽死犹荣。", 51, 0)  --对话
			
			say("慕容兄，这可就是你的不是了。我大哥和你素无嫌隙，你又何必乘人之危？", 53, 4)  --对话
			
			say("段兄要做打抱不平的英雄好汉，一并上来赐教便是。", 51, 0)  --对话
			
			say("我有什么本领来赐教于你？只不过说句公道话罢了。", 53, 4)  --对话
			
			say("段公子的六脉神剑很是厉害，表哥且不可大意！", 76, 0)  --对话
			
			--主角+游坦之+慕容复+王语嫣VS乔狗+段誉
			if WarMain(250, 0) == false then  --战斗开始
				instruct_15()  --死亡
				Cls()  --清屏
				do return end  --无条件结束事件
				Cls()  --清屏

			end
			light()
			
			say("久闻六脉神剑天下无双，贫僧也要领教一二。", 103, 0)  --对话
			
			say("兄弟，今日敌手之强，大哥此生未见。如今咱们陷身重围之中，寡不敌众，已势难脱身。", 50, 0)  --对话
			
			say("但你我生死与共，不枉了结义一场，死也罢，活也罢，大家痛痛快快的喝他一场。拿酒来！", 50, 0)  --对话	
			
			say("不错，正要和大哥喝一场酒！", 53, 0)  --对话
			
			say("大哥，三弟，你们喝酒抗敌，怎么不来叫我？", 49, 4)  --对话
			
			dark()
			
			--虚竹登场
			
			addevent(-2, 87, 1, nil, nil, 4282*2)
			light()
			
			say("大哥，这也是我的结义哥哥。他出家时法名虚竹，还俗后叫做虚竹子。咱二人结拜之时，将你也结拜在内了。二哥，快来拜见大哥。", 53, 0)  --对话
			
			say("大哥在上，小弟叩见。", 49, 4)  --对话
			
			say("Ｌ＜我命在顷刻，情势凶险无比，但这人不怕艰危，挺身而出，足见是个重义轻生的大丈夫、好汉子。萧峰和这种人相结为兄弟，却也不枉了。＞", 50, 0)  --对话
			
			say("兄弟，萧某得能结交你这等英雄好汉，欢喜得紧。大家痛饮一场，放手一战吧！", 50, 0)  --对话
			
			--主角+游坦之+慕容复+王语嫣+鸠摩智VS乔狗+段誉+虚竹
			if WarMain(251, 0) == false then  --战斗开始
				instruct_15()  --死亡
				Cls()  --清屏
				do return end  --无条件结束事件
				Cls()  --清屏

			end
			light()
			
			--游坦之，慕容复，王语嫣，血量翻倍还原
			JY.Person[48]["血量翻倍"] = 1
			JY.Person[51]["血量翻倍"] = 1
			JY.Person[76]["血量翻倍"] = 1
			
			say("今日虽然取胜，但三人兄弟情义，确实令人可敬可叹……", 0, 4)  --对话
			
			--特殊奖励：全兵器值+10
			DrawStrBoxWaitKey("特殊奖励：主角五系兵器值提升十点", C_RED, CC.DefaultFont,nil,C_GOLD)
			AddPersonAttrib(0, "拳掌功夫", 10)
			AddPersonAttrib(0, "指法技巧", 10)
			AddPersonAttrib(0, "御剑能力", 10)
			AddPersonAttrib(0, "耍刀技巧", 10)
			AddPersonAttrib(0, "特殊兵器", 10)
			
			dark()
			--三兄弟离去
			null(-2,87)
			null(-2,61)
			null(-2,69)
			null(-2,85)
			null(-2,86)
			light()
			
			say("方丈大师，今日忽生变故，始料未及。武林盟主一事，今日不提也罢。不知那《天龙八部》一书，可在少林寺中？", 0, 4)  --对话
			
			say("此书本非少林所有，老衲也是因缘而得，便送与"..JY.Person[0]["外号"].."了。唯望"..JY.Person[0]["外号"].."少生杀戮，以天下苍生为重。", 70, 0)  --对话
			
			instruct_2(147, 1)	--天龙八部
			
			say("Ｌ＜这"..JY.Person[0]["外号2"].."及其帮手果然厉害，少林派也知难而退了，不妨再结交一下＞", 103, 0)  --对话
			
			say("此间事情已了，小僧也该告辞了。这本《火焰刀法》乃小僧生平绝学，就赠与"..JY.Person[0]["外号"].."了。", 103, 0)  --对话
			
			instruct_2(135, 1)	--火焰刀法
			
			say("多谢大师。", 0, 4)  --对话
			
			dark()

			for i = 26, 35 do
				null(-2, i)
			end
	
			for i = 0, 6 do
				null(-2, i)
			end
			
			for i = 49, 60 do
				null(-2, i)
			end
			
			for i = 62, 66 do
				null(-2, i)
			end
			
			null(-2, 88)	--游坦之
			null(-2, 89)	--明王
			
			addevent(42, 1, 1, 4114, 1, -2)	--凌波微步事件
			
			light()
			
			instruct_37(-8)
			
			JY.Person[51]["品德"] = 31	--燕子坞开门的条件
			
			do return end
		end
	end
	
	instruct_0();   --  0(0)::空语句(清屏)
--end

