instruct_37(1)  --增加品德
TalkEx("她就要来了，怎么办？", 16, 0)  --对话
Cls()  --清屏
TalkEx("我们还是躲起来吧。", 17, 0)  --对话
Cls()  --清屏
TalkEx("往哪躲呢？", 16, 0)  --对话
Cls()  --清屏
TalkEx("二位前辈，不知何事惊惶，*晚辈能否帮得上忙？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们有个极厉害的对头，要*来寻仇，怎么办……", 16, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,5288,5288,5288,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("胡青牛，看你今天往哪跑！", 15, 0)  --对话
Cls()  --清屏
TalkEx("不好，她来了，老婆子，我*们只有等死了。", 16, 0)  --对话
Cls()  --清屏
TalkEx("老头子……", 17, 0)  --对话
Cls()  --清屏
TalkEx("两位前辈莫慌，我来会会她*。", 0, 1)  --对话
Cls()  --清屏
if WarMain(156, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哼，改日再来取你狗命！", 15, 0)  --对话
Cls()  --清屏
TalkEx("多谢"..JY.Person[0]["外号"].."相救之恩。", 16, 0)  --对话
Cls()  --清屏
TalkEx("这个人是谁啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("她，其实就是我们明教的紫*杉龙王，现在隐居在灵蛇岛*。", 17, 0)  --对话
Cls()  --清屏
TalkEx("只因多年前，我拒绝为她丈*夫看病，导致她丈夫惨死。*如今，她是来寻仇了。", 16, 0)  --对话
Cls()  --清屏
TalkEx("哦，原来她就是紫杉龙王啊*。我看她这一去，恐怕还要*回来，二位前辈不知有何打*算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("老婆子，你说怎么办？", 16, 0)  --对话
Cls()  --清屏
TalkEx("我怎么知道？要是有个能避*难的地方就好了……", 17, 0)  --对话
Cls()  --清屏
TalkEx("这样吧，如果二位不嫌弃，*不妨去小村。那里是南贤北*丑的住地，我想金花婆婆应*该不会去那里杀人的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那真是太好了，老婆子，咱*们这就动身吧。", 16, 0)  --对话
Cls()  --清屏
TalkEx("多谢"..JY.Person[0]["外号"].."。我外子略通医术*，我则略通毒术，如果"..JY.Person[0]["外号"].."*有用得到我夫妇的地方，尽*管开口，我们这就去小村啦*。", 17, 0)  --对话
Cls()  --清屏
instruct_3(104, 72,1,0,949,0,0,5286,5286,5286,-2,-2,-2)  --修改场景事件
instruct_3(104, 80,1,0,950,0,0,5290,5290,5290,-2,-2,-2)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(70, 31,1,0,109,0,0,5286,5286,5286,-2,-2,-2)  --修改场景事件
instruct_3(70, 32,1,0,111,0,0,5290,5290,5290,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
Cls()  --清屏
do return end
