TalkEx("前辈就是张三丰太师父吗，晚辈叩见。", 0, 1)  --对话
Cls()  --清屏
TalkEx("正是老朽。", 5, 0)  --对话
Cls()  --清屏
TalkEx("晚辈实在荣幸万分，能见到当今武林的泰山北斗。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("那里，那里。小兄弟太夸奖老朽了。据我所知，小兄弟你是在寻找十四天书吧？", 5, 0)  --对话
else
	TalkEx("那里，那里。小姑娘太夸奖老朽了。据我所知，小姑娘你是在寻找十四天书吧？", 5, 0)  --对话
end
Cls()  --清屏
TalkEx("前辈也知道\"十四天书\"？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我与南贤是老交情了，你的事情我大概知道一些。", 5, 0)  --对话
Cls()  --清屏
TalkEx("不知前辈是否知道这些书的下落？", 0, 1)  --对话
Cls()  --清屏
TalkEx("老朽淡出江湖已久，所以并不太清楚这些书的下落。", 5, 0)  --对话
Cls()  --清屏
TalkEx("这样啊，那我还是到别处再问问吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你在江湖闯荡的过程中，若能维持侠义的心，老朽倒是愿意指点你一两招，或许能对你有些帮助。", 5, 0)  --对话
Cls()  --清屏
TalkEx("真的吗？能得到前辈的指点，晚辈将一生受用无穷。", 0, 1)  --对话
Cls()  --清屏
TalkEx("记着一件事，习武之人要常保有一副侠义心肠。", 5, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,311,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
