if instruct_16(91) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("这……这一定就是我爹的尸*骨了……爹，我把娘的骨灰*带来了，娘说要和你合葬在*一起，我这就帮你们完成心*愿。", 91, 0)  --对话
Cls()  --清屏
TalkEx("姑娘请节哀，我来帮你。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_19(22, 28)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
instruct_3(-2, 1,1,0,319,0,0,6700,6700,6700,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,1,0,319,0,0,6696,6696,6696,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("从墙上的字来看，这位金蛇*郎君夏前辈真是一位了不起*的高人啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那是，我爹爹自然了不起。", 91, 0)  --对话
Cls()  --清屏
TalkEx("这就是金蛇剑吧，插的好深*……", 0, 1)  --对话
Cls()  --清屏
TalkEx("对了，袁大哥提到过这把金*蛇剑，你帮我把它拔下来，*我们去还给袁大哥。", 91, 0)  --对话
Cls()  --清屏
instruct_3(-2, 0,1,0,320,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
