if instruct_16(72) == false then  --是否在队伍
	TalkEx(JY.Person[0]["外号"].."有何贵干哪？", 4, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(-1)  --增加品德
instruct_3(3, 9,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 12,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 11,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 10,1,0,639,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
TalkEx("老朋友来了，还不出来欢迎*啊？", 72, 1)  --对话
Cls()  --清屏
TalkEx("呵呵，我当是谁，原来是田*大侠，稀客稀客啊。", 4, 0)  --对话
Cls()  --清屏
TalkEx("你这个冒牌的跌打医生，又*在这研究什么害人的法子呢*？", 72, 1)  --对话
Cls()  --清屏
TalkEx("小人这点手段，哪能瞒得了*田大侠。不知田大侠此来有*何贵干？", 4, 0)  --对话
Cls()  --清屏
TalkEx("这位"..JY.Person[0]["外号"].."有些事情，要求你*助一臂之力。", 72, 1)  --对话
Cls()  --清屏
TalkEx("这位"..JY.Person[0]["外号"].."英明神武，一表人*才，定是成大事之人。不知*有何吩咐？", 4, 0)  --对话
Cls()  --清屏
TalkEx("哪里哪里，阎大夫过奖了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我们现在要去对付苗人凤，*如此这般……", 72, 1)  --对话
Cls()  --清屏
TalkEx("嘿嘿，您就放心好啦。", 4, 0)  --对话
Cls()  --清屏
instruct_3(104, 57,1,0,947,0,0,5168,5168,5168,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	Cls()  --清屏
	TalkEx("如此我就与你们同行吧。", 4, 0)  --对话
	Cls()  --清屏
	instruct_10(4)  --加入队伍
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx(JY.Person[0]["外号"].."的队伍已满，我就直接*去小村啦。如果要去对付苗*人凤，别忘了叫上我。", 4, 0)  --对话
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 21,1,0,105,0,0,5168,5168,5168,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
