instruct_14()  --场景变黑
instruct_3(-2, 1,0,0,0,0,0,6368,6368,6368,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,6370,6370,6370,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,6098,6098,6098,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("嗯嗯，好好……", 178, 0)  --对话
Cls()  --清屏
TalkEx("到时候就……哈哈……", 179, 0)  --对话
Cls()  --清屏
TalkEx("好，就这么办，走！", 177, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("这三个家伙鬼鬼祟祟，好像*有什么阴谋……", 0, 1)  --对话
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
