if instruct_16(91) == false then  --是否在队伍
	TalkEx("青青，你在哪里啊，你在哪里？", 54, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_14()  --场景变黑
instruct_3(-2, 14,1,0,4199,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
instruct_21(91)  --离开队伍
instruct_19(12,38)
stands()
instruct_40(2)  --主角面向上
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("青青，你终于回来了……", 54, 0)  --对话
Cls()  --清屏
TalkEx("哼，回来又怎样，你怎么不去找你青梅竹马的小慧姑娘！", 91, 0)  --对话
Cls()  --清屏
TalkEx("她……她的心上人是她的崔师哥，跟我有什么关系。", 54, 0)  --对话
Cls()  --清屏
TalkEx("你为什么用她的发钗？难道我就没有发钗么？", 91, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜她这简直是无理取闹……唉，算了，我还是别说话了……＞", 54, 0)  --对话
Cls()  --清屏
TalkEx("你怎么不说话？见了她就笑逐颜开，见了我就闷闷不乐！", 91, 0)  --对话
Cls()  --清屏
TalkEx("我……我哪有？青青，这些日子，你上哪里去了？", 54, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜唉，这位温大小姐真让人受不了，这位袁兄今后可要受苦啦，我还是不要在这当灯泡了＞Ｗ二位既已重逢，在下这就告辞了。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("你还知道关心我啊！我去了华山，把我父母合葬在一起……对了，袁大哥，你说过我爹的金蛇剑法一定要配合金蛇剑才有威力，我就让他帮我把剑拔下来了，喏，给你。", 91, 0)  --对话
else
	TalkEx("你还知道关心我啊！我去了华山，把我父母合葬在一起……对了，袁大哥，你说过我爹的金蛇剑法一定要配合金蛇剑才有威力，我就让她帮我把剑拔下来了，喏，给你。", 91, 0)  --对话
end
Cls()  --清屏
instruct_32(40,-1)  --得到或失去物品
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("他？哎呦，我们俩光顾着说话，怠慢了兄台，还望见谅。多谢兄台对……对她的照顾。", 54, 0)  --对话
else
	TalkEx("她？哎呦，我们俩光顾着说话，怠慢了女侠，还望见谅。多谢女侠对……对她的照顾。", 54, 0)  --对话
end
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("谁要他来照顾？是他让我加入他的队伍，给他做帮手！", 91, 0)  --对话
else
	TalkEx("谁要她来照顾？是她让我加入她的队伍，给她做帮手！", 91, 0)  --对话
end
Cls()  --清屏
TalkEx("Ｌ＜……这位大小姐，我可惹不起＞Ｗ啊，是，温姑娘武艺非凡，帮了在下不少忙。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你听到没有！", 91, 0)  --对话
Cls()  --清屏
TalkEx("……", 54, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜……我还是不要打扰他们二位了＞", 0, 1)  --对话
Cls()  --清屏
instruct_3(95, 16,1,0,4198,0,0,4677*2,4677*2,4677*2,-2,-2,-2)  --阿九
instruct_3(-2, -2,1,0,4199,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
