if instruct_4(232) == false then  --是否使用物品
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(1)  --增加品德
Cls()  --清屏
TalkEx("阿九姑娘，你看！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("好啊，原来是闵子华的哥哥自己贪财好色，焦公礼杀了他，也可算是为民除害了。这太白三英里通外国，挑拨离间……", 356,0,"阿九")  --对话
Cls()  --清屏
TalkEx("那我们明天去金龙帮揭发了他们，有证据在手，看他们谁敢抵赖。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，明日我也去。", 356,0,"阿九")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(59, 15,1,0,327,0,0,8214,8214,8214,-2,-2,-2)  --修改场景事件
instruct_3(59, 14,1,0,328,0,0,6086,6086,6086,-2,-2,-2)  --修改场景事件
instruct_3(59, 18,0,0,0,0,0,6106,6106,6106,-2,-2,-2)  --修改场景事件
instruct_3(59, 17,0,0,0,0,0,5388,5388,5388,-2,-2,-2)  --修改场景事件
instruct_3(59, 16,0,0,0,0,0,5420,5420,5420,-2,-2,-2)  --修改场景事件
instruct_3(59, 21,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(59, 22,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(59, 19,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(59, 20,0,0,0,0,0,5412,5412,5412,-2,-2,-2)  --修改场景事件
instruct_3(59, 24,0,0,0,0,0,6092,6092,6092,-2,-2,-2)  --修改场景事件
instruct_3(59, 23,0,0,0,0,0,6366,6366,6366,-2,-2,-2)  --修改场景事件
instruct_3(59, 25,0,0,0,0,0,6366,6366,6366,-2,-2,-2)  --修改场景事件
instruct_3(59, 26,0,0,0,0,0,5186,5186,5186,-2,-2,-2)  --修改场景事件
instruct_3(59, 27,0,0,0,0,0,7060,7060,7060,-2,-2,-2)  --修改场景事件
instruct_3(59, 28,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
instruct_3(59, 29,0,0,0,0,326,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(59, 33,0,0,0,0,0,4677*2,4677*2,4677*2,-2,-2,-2)  --阿九
Cls()  --清屏
stands()
instruct_40(3)  --设置主角方向
instruct_13()  --场景变亮
TalkEx("时候不早了，该去金龙帮看看了。", 0, 1)  --对话
Cls()  --清屏
do return end
