instruct_37(3)  --增加品德
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(25,43,25,36)  --场景移动
instruct_25(25,36,20,36)  --场景移动
instruct_25(20,36,46,36)  --场景移动
instruct_25(46,36,31,36)  --场景移动
TalkEx("焦公礼，你杀了我大哥，今日还相抵赖么？", 181, 0)  --对话
Cls()  --清屏
TalkEx("闵二爷怎么这么大的火气，有话慢慢说。", 243, 0,"焦公礼")  --对话
Cls()  --清屏
TalkEx("谁跟你慢慢说，今日我定要为兄报仇！", 181, 0)  --对话
Cls()  --清屏
TalkEx("且慢！", 0, 1)  --对话
Cls()  --清屏
instruct_25(31,36,25,43)  --场景移动
instruct_30(25,43,25,42)  --人物移动
instruct_30(25,42,32,42)  --人物移动
instruct_30(32,42,32,36)  --人物移动
instruct_40(2)  --设置主角方向
Cls()  --清屏
TalkEx("请各位看一看这是什么？", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_32(232,-1)  --得到或失去物品
instruct_13()  --场景变亮
TalkEx("这……这……我大哥他……", 181, 0)  --对话
Cls()  --清屏
TalkEx("闵二爷，我看今日之事就此作罢吧，你们化干戈为玉帛……", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，谁知道你这些东西是不是自己伪造的！", 183, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("你，你，居然把证据撕毁，姓梅的，你还要不要脸！", 0, 1)  --对话
Cls()  --清屏
TalkEx("也不知是谁不要脸了？害死了人家兄长，还造几封狗屁不通的书信来冤枉死人。反正人已经死了，任你撒个弥天大谎！", 183, 0)  --对话
Cls()  --清屏
TalkEx("不错，杀兄大仇不可不报！洞玄师弟，我们拿下这"..JY.Person[0]["外号2"].."！", 181, 0)  --对话
Cls()  --清屏
TalkEx("两个打一个，好没羞！", 91, 0)  --对话
Cls()  --清屏
TalkEx("臭丫头，没见过世面，仙都派两仪剑法，向来是两人同使！", 181, 0)  --对话
Cls()  --清屏
TalkEx("你——！好，我们就来赌一把，二位一起上，如果能赢得了这位"..JY.Person[0]["外号"].."，我们马上离开此地。如果你们输了，大功坊的房子就归我！怎么样，敢赌么？", 91, 0)  --对话
Cls()  --清屏
TalkEx("哼，赌就赌，看我在这"..JY.Person[0]["外号2"].."身上戳两个透明窟窿！洞玄师弟，我们上！", 181, 0)  --对话
Cls()  --清屏
if WarMain(158, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你……你……", 181, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，大功坊的房子归我喽！", 91, 0)  --对话
Cls()  --清屏
TalkEx("阁下武功了得，梅某来领教一二。", 183, 0)  --对话
Cls()  --清屏
if WarMain(159, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("技不如人，梅某告辞！", 183, 0)  --对话
Cls()  --清屏
TalkEx("别想跑～", 0, 1)  --对话
Cls()  --清屏
TalkEx("怎么？阁下还想赶尽杀绝么？", 183, 0)  --对话
Cls()  --清屏
TalkEx("梅大哥，不是说你，我是说太白三英！", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！你有点欺人太甚了吧，大伙一起上！", 183, 0)  --对话
Cls()  --清屏
if WarMain(160, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("这太白三英，里通外国，挑拨离间，今日之事全是他们挑起的。梅大哥、闵二爷，我看此事就此罢手吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("……告辞！", 183, 0)  --对话
Cls()  --清屏
TalkEx("闵二爷，咱们打的赌呢？", 91, 0)  --对话
Cls()  --清屏
TalkEx("哼，闵某说话算话，大功坊归你了。告辞！", 181, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哈哈，我赢了他的房子，哈哈哈，袁大哥，咱们这就去大功坊好好玩玩。", 91, 0)  --对话
Cls()  --清屏
TalkEx("你……唉，真拿你没办法……", 54, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("这梅剑和、刘培生都是华山派的，算起来还是我的晚辈，我今日实在不便出手干预。幸亏兄台及时赶到。……喂，青青，等等我……", 54, 0)  --对话
else
	TalkEx("这梅剑和、刘培生都是华山派的，算起来还是我的晚辈，我今日实在不便出手干预。幸亏女侠及时赶到。……喂，青青，等等我……", 54, 0)  --对话
end
Cls()  --清屏
say("这次多亏了"..JY.Person[0]["外号"].."仗义相助，阿九在此谢过了。", 356,0,"阿九")		--对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 11,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,330,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_17(95,0,12,48,986)  --设置场景的值
instruct_3(95, 10,1,0,343,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(83, 41,0,0,0,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
instruct_3(83, 43,0,0,0,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
instruct_3(83, 44,0,0,0,0,344,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("金龙帮上下全体帮众感谢"..JY.Person[0]["外号"].."大恩大德。", 243, 0,"焦公礼")  --对话
Cls()  --清屏
TalkEx("焦帮主太客气了。", 0, 1)  --对话
Cls()  --清屏
do return end
