instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_30(47,47,47,40)  --人物移动
instruct_30(47,40,45,40)  --人物移动
Cls()  --清屏
TalkEx("咦？想不到这大功坊的地下*还有宝藏？这次打赌赚的值*啊！", 0, 1)  --对话
Cls()  --清屏
TalkEx("青青的父亲曾经留给她母亲*一幅藏宝图，经过我多日寻*访，发现藏宝地点应该就是*在大功坊，所以青青才会提*出以大功坊为赌注的。", 54, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，原来你们是早有预谋*啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我这叫神机妙算！*……袁大哥……*我……怎么突然这么困……", 91, 0)  --对话
Cls()  --清屏
TalkEx("我……好像也……很困……", 0, 1)  --对话
Cls()  --清屏
TalkEx("不好，有人放毒！", 54, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(96, 12,0,0,0,0,0,7060,7060,7060,-2,-2,-2)  --修改场景事件
instruct_3(96, 9,0,0,0,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
instruct_3(96, 0,0,0,0,0,345,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_27(-1,6014,6024)  --显示人物动画
stands()
TalkEx("头好沉……我怎么睡在这了*？……袁大哥和温姑娘呢？*……咦，这里有封信……什*么？五仙教抓走了温姑娘！*袁大哥已经赶去了，我也去*看看吧。", 0, 1)  --对话
Cls()  --清屏
do return end
