instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_30(15,30,18,30)  --人物移动
instruct_30(18,30,18,28)  --人物移动
stands()
say("青青、青青、你怎么样？", 54, 0)  --对话
Cls()  --清屏
say("温姑娘怎么了？", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	say("兄台来得正是时候，快拦住那个恶道，他打伤了青青。", 54, 0)  --对话
else
	say("女侠来得正是时候，快拦住那个恶道，他打伤了青青。", 54, 0)  --对话
end
Cls()  --清屏
say("嘿嘿，交给我了，我看你往哪儿跑。", 0, 1)  --对话
Cls()  --清屏
say("哼，你们这么多人打我一个，也不害臊。有本事单打独斗！", 184, 0)  --对话
Cls()  --清屏
say("好，我就和你单打独斗。要是我输了，随你下山。", 0, 1)  --对话
Cls()  --清屏
say("哈哈哈，这话要是那穆老儿说出来，我还有几分相信。你个乳臭未干的娃娃，拿命来！", 184, 0)  --对话
Cls()  --清屏
if WarMain(161, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(18, 30)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(3)  --增加品德
say("青青、青青……", 54, 0)  --对话
Cls()  --清屏
say("袁大哥，我……恐怕不行了……", 91, 0)  --对话
Cls()  --清屏
if instruct_16(16) then  --是否在队伍
	say("我来看看……有我蝶谷医仙胡青牛在，没有什么不行的！", 16, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_37(3)  --增加品德
	say("青青，你，太好了，你还活着，我……", 54, 0)  --对话
	Cls()  --清屏
	say("袁大哥，瞧你哭的像个泪人一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	say("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	say("呵呵呵，先生神乎其技，不愧医仙之名啊！", 185, 0)  --对话
	Cls()  --清屏
	say("哪里哪里，穆先生过奖了。", 16, 0)  --对话
	Cls()  --清屏
	say("承志啊，还不快谢过胡前辈和这位"..JY.Person[0]["外号"].."。", 185, 0)  --对话
	Cls()  --清屏
	say("是，两位大恩，袁承志在此谢过。今后若有任何差遣，袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	say("袁公子太客气了。不过，我倒真有件事情想请穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	say("我一直在寻找十四天书，不知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	say("其他的书我不知道，我这里有一本《碧血剑》，应该是你想要的吧。"..JY.Person[0]["外号"].."帮我华山派许多，这本书就赠与"..JY.Person[0]["外号"].."吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	say("多谢穆老前辈。", 0, 1)  --对话
	Cls()  --清屏
	say("承志啊，这位"..JY.Person[0]["外号"].."帮了你这么多，我看，今后你就跟着他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	say("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	say("承志哥哥，我要跟师傅到藏边学功夫，千里迢迢，以后不容易相见了。",356,0,"阿九")
	Cls()  --清屏
	say("我等你三年……你如果三年不来，就不必来了，我就落发做了尼姑，心里永远记着你……不，我等你十年……",356,0,"阿九")
	Cls()  --清屏
	say("我一定会来见你的，不到一年我就来了。阿九妹子，见不到你，我会死的。", 54, 0)  --对话	
	Cls()  --清屏
	dark()
	null(-2,29)
	light()
	say("喂，你要是敢去找她我马上就再死一次给你看！", 91, 0)  --对话
	Cls()  --清屏
	say("……", 54, 0)  --对话
	Cls()  --清屏
	awakening(54, 1)	--袁承志觉醒一次
	say(JY.Person[0]["外号"].."手刃玉真子，此次华山聚会也算功德圆满，大家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."，我和青青去小村了，随时听候"..JY.Person[0]["外号"].."差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

end
if instruct_16(28) then  --是否在队伍
	say("我来看看……有我平一指在，没有什么不行的！", 28, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_37(3)  --增加品德
	say("青青，你，太好了，你还活着，我……", 54, 0)  --对话
	Cls()  --清屏
	say("袁大哥，瞧你哭的像个泪人一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	say("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	say("呵呵呵，先生神乎其技，老朽佩服，不过先生号称\"杀人名医\"，是不是还要再杀一人呢？", 185, 0)  --对话
	Cls()  --清屏
	say("唉，没治好令狐公子，我这条命早已输给这位"..JY.Person[0]["外号"].."了，\"杀人名医\"的名号再也不要提起啦。", 28, 1)  --对话
	Cls()  --清屏
	say("承志啊，还不快谢过平前辈和这位"..JY.Person[0]["外号"].."。", 185, 0)  --对话
	Cls()  --清屏
	say("是，两位大恩，袁承志在此谢过。今后若有任何差遣，袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	say("袁公子太客气了。不过，我倒真有件事情想请穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	say("我一直在寻找十四天书，不知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	say("其他的书我不知道，我这里有一本《碧血剑》，应该是你想要的吧。"..JY.Person[0]["外号"].."帮我华山派许多，这本书就赠与"..JY.Person[0]["外号"].."吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	say("多谢穆老前辈。", 0, 1)  --对话
	Cls()  --清屏
	say("承志啊，这位"..JY.Person[0]["外号"].."帮了你这么多，我看，今后你就跟着他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	say("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	say("承志哥哥，我要跟师傅到藏边学功夫，千里迢迢，以后不容易相见了。",356,0,"阿九")
	Cls()  --清屏
	say("我等你三年……你如果三年不来，就不必来了，我就落发做了尼姑，心里永远记着你……不，我等你十年……",356,0,"阿九")
	Cls()  --清屏
	say("我一定会来见你的，不到一年我就来了。阿九妹子，见不到你，我会死的。", 54, 0)  --对话	
	Cls()  --清屏
	dark()
	null(-2,29)
	light()
	say("喂，你要是敢去找她我马上就再死一次给你看！", 91, 0)  --对话
	Cls()  --清屏
	say("……", 54, 0)  --对话
	Cls()  --清屏
	awakening(54, 1)	--袁承志觉醒一次
	say(JY.Person[0]["外号"].."手刃玉真子，此次华山聚会也算功德圆满，大家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."，我和青青去小村了，随时听候"..JY.Person[0]["外号"].."差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件
	Cls()  --清屏

end
if instruct_16(45) then  --是否在队伍
	say("我来看看……有我阎王敌薛慕华在，没有什么不行的！", 45, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 11,0,0,0,0,0,7062,7062,7062,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_37(3)  --增加品德
	say("青青，你，太好了，你还活着，我……", 54, 0)  --对话
	Cls()  --清屏
	say("袁大哥，瞧你哭的像个泪人一样，让别人看了笑话……", 91, 0)  --对话
	Cls()  --清屏
	say("啊，是是，呵呵，我……", 54, 0)  --对话
	Cls()  --清屏
	say("呵呵呵，先生神乎其技，不愧是阎王敌啊！", 185, 0)  --对话
	Cls()  --清屏
	say("哪里哪里，穆先生过奖了。", 45, 0)  --对话
	Cls()  --清屏
	say("承志啊，还不快谢过薛前辈和这位"..JY.Person[0]["外号"].."。", 185, 0)  --对话
	Cls()  --清屏
	say("是，两位大恩，袁承志在此谢过。今后若有任何差遣，袁某愿赴汤蹈火！", 54, 0)  --对话
	Cls()  --清屏
	say("袁公子太客气了。不过，我倒真有件事情想请穆老前辈和袁公子帮帮我。", 0, 1)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."但讲无妨。", 185, 0)  --对话
	Cls()  --清屏
	say("我一直在寻找十四天书，不知穆老前辈可有线索？", 0, 1)  --对话
	Cls()  --清屏
	say("其他的书我不知道，我这里有一本《碧血剑》，应该是你想要的吧。"..JY.Person[0]["外号"].."帮我华山派许多，这本书就赠与"..JY.Person[0]["外号"].."吧。", 185, 0)  --对话
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	say("多谢穆老前辈。", 0, 1)  --对话
	Cls()  --清屏
	say("承志啊，这位"..JY.Person[0]["外号"].."帮了你这么多，我看，今后你就跟着他，帮他找寻十四天书吧。", 185, 0)  --对话
	Cls()  --清屏
	say("是，弟子谨遵师命。", 54, 0)  --对话
	Cls()  --清屏
	say("承志哥哥，我要跟师傅到藏边学功夫，千里迢迢，以后不容易相见了。",356,0,"阿九")
	Cls()  --清屏
	say("我等你三年……你如果三年不来，就不必来了，我就落发做了尼姑，心里永远记着你……不，我等你十年……",356,0,"阿九")
	Cls()  --清屏
	say("我一定会来见你的，不到一年我就来了。阿九妹子，见不到你，我会死的。", 54, 0)  --对话	
	Cls()  --清屏
	dark()
	null(-2,29)
	light()
	say("喂，你要是敢去找她我马上就再死一次给你看！", 91, 0)  --对话
	Cls()  --清屏
	say("……", 54, 0)  --对话
	Cls()  --清屏
	awakening(54, 1)	--袁承志觉醒一次
	say(JY.Person[0]["外号"].."手刃玉真子，此次华山聚会也算功德圆满，大家就此散了吧。", 185, 0)  --对话
	Cls()  --清屏
	say(JY.Person[0]["外号"].."，我和青青去小村了，随时听候"..JY.Person[0]["外号"].."差遣。", 54, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(104, 83,1,0,992,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(104, 75,1,0,966,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 51,1,0,197,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
	instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件
	Cls()  --清屏

end
say("青青，你不会有事的……", 54, 0)  --对话
Cls()  --清屏
say("袁大哥，能认识你，我很开心，真的很开心……", 91, 0)  --对话
Cls()  --清屏
say("青青，青青……", 54, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
null(-2,29)
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,1,0,0,0,0,6700,6700,6700,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,0,0,0,6696,6696,6696,-2,-2,-2)  --修改场景事件
instruct_3(80, 13,0,0,0,0,0,7064,7064,7064,-2,-2,-2)  --修改场景事件
instruct_3(80, 12,0,0,0,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
instruct_3(80, 30,0,0,0,0,0,4676*2,4676*2,4676*2,-2,-2,-2)  --阿九
instruct_19(23, 19)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
say("承志哥哥，人死不能复生……请……节哀。", 356,0,"阿九")  --对话
Cls()  --清屏
say("我……我想一个人静一静……", 54, 0)  --对话
Cls()  --清屏
say("孩子，你不要总想这件事了，到处去游历一番，痛苦会随着时间慢慢减轻。活着的人，总是要好好活下去的……", 185, 0)  --对话
Cls()  --清屏
say("……", 54, 0)  --对话
Cls()  --清屏
say("袁公子……", 0, 1)  --对话
Cls()  --清屏
say("人生不如意，十有八九啊……", 185, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(78, 0,1,0,347,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
say("阿九半响无语，眼泪扑簌簌地落下。", 0, 2)  --对话
Cls()  --清屏
say("阿九姑娘，你也别难过了，我跟你一起去找袁公子。", 0, 1)  --对话
Cls()  --清屏

if instruct_20() == false then  --判断队伍是否已满
	dark()
	null(-2,30)
	light()
	instruct_10(629)
else
	say("你的队伍已满，我就直接去小村吧。", 356,0,"阿九")  --对话
	dark()
	null(-2,30)
	instruct_3(70, 51,1,0,4201,0,0,4676*2,4676*2,4676*2,-2,-2,-2)  --修改场景事件
	light()
end
do return end
