Cls()  --清屏
if instruct_16(629) == false then  --是否在队伍
	Cls()  --清屏
	say("……", 54, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
dark()
instruct_19(22,27)
stands()
instruct_40(2)  --主角面向上
addevent(-2, 5, 1, nil, nil, 4679*2)
light()
say("袁公子，没想到在这遇见你。", 0, 1)  --对话
Cls()  --清屏
say("原来是你啊，我正要去找你呢。", 54, 0)  --对话
Cls()  --清屏
say("找我？", 0, 1)  --对话
Cls()  --清屏
say("是啊，我这些年到处游历，无意中发现了一本奇书《碧血剑》，我想可能就是你要寻找的天书之一吧。", 54, 0)  --对话
Cls()  --清屏
say("太好了，这正是我要找的书！", 0, 1)  --对话
Cls()  --清屏
say("承志哥哥，难道你没想要找我吗？",356,0,"阿九")
Cls()  --清屏
say("阿九妹子……", 54, 0)  --对话
Cls()  --清屏
say("袁公子，你武艺高强，如果你愿意加入我们一起寻找天书，那就再好不过了。", 0, 1)  --对话
Cls()  --清屏
say("好吧，看到你们，我的心也再度活跃起来。", 54, 0)  --对话
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	say("你能走出过去的束缚，我真替你感到高兴。", 0, 1)  --对话
	Cls()  --清屏
	dark()
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	light()
	instruct_10(54)  --加入队伍
	Cls()  --清屏
	instruct_2(156, 1)  --得到或失去物品
	Cls()  --清屏
	do return end  --无条件结束事件
end
say("你的队伍已满，我就直接去小村吧。", 54, 0)  --对话
Cls()  --清屏
dark()
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
light()
instruct_3(70, 18,1,0,145,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_2(156, 1)  --得到或失去物品
Cls()  --清屏
do return end  --无条件结束事件
