if instruct_20() then  --判断队伍是否已满
	say("……",239,0,"焦宛儿")
	do return end
end
instruct_3(-2, -2, 1, 0, 361, 0, 0, -2, -2, -2, -2, -2, -2)
say("敢问姑娘是这金龙帮中人吗？",0,1)
instruct_0()
say("是又怎么样？你想连我也一起杀么？你来呀，你来呀！",239,0,"焦宛儿")
instruct_0()
say("姑娘不要急，这些人不是我杀的，在下只是寻找一些东西路过这里。",0,1)
instruct_0()
say("呜呜呜，爹，师兄，你们死得好惨……",239,0,"焦宛儿")
instruct_0()
say("请节哀。",0,1)
instruct_0()
say("你是不是在找十四天书？其中一本《碧血剑》的下落我知道。",239,0,"焦宛儿")
instruct_0()
say("哦？请姑娘明示。",0,1)
instruct_0()
say("告诉你可以，不过你要先帮我报仇。",239,0,"焦宛儿")
instruct_0()
say("Ｌ＜为了天书，只能答应了＞Ｗ好，一言为定。",0,1)
instruct_0()
say("灭我金龙帮的人当中，有几个是华山派穆人清的徒弟，其中一个袁承志刚去了云南五仙教。",239,0,"焦宛儿")
instruct_0()
say("Ｌ＜袁公子，你不要怪我，虽然我们也有过一面之交，不过现在……＞Ｗ",0,1)
instruct_0()
say("我跟你一起去，你先帮我把人埋了。",239,0,"焦宛儿")
 
dark()

for i = 2, 15 do
	null(-2,i)
end

light()
instruct_10(607)
instruct_2(51, 1)  --得到或失去物品
Cls()  --清屏
instruct_3(96, 0, 0, 0, 0, 0, 354, 0, 0, 0, -2, -2, -2)
instruct_17(95, 0, 12, 48, 986)
instruct_3(95, 10, 1, 0, 343, 0, 0, -2, -2, -2, -2, -2, -2)
do return end