instruct_3(-2, 1,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,356,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(80, 7,0,0,0,0,0,7064,7064,7064,-2,-2,-2)  --修改场景事件
instruct_3(80, 6,0,0,0,0,0,7068,7068,7068,-2,-2,-2)  --修改场景事件
instruct_3(80, 10,0,0,0,0,0,5364,5364,5364,-2,-2,-2)  --修改场景事件
instruct_3(80, 5,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(80, 9,0,0,0,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
instruct_3(80, 8,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(80, 14,0,0,0,0,0,6818,6818,6818,-2,-2,-2)  --修改场景事件
instruct_3(80, 15,0,0,0,0,0,7032,7032,7032,-2,-2,-2)  --修改场景事件
instruct_3(80, 2,0,0,0,0,357,0,0,0,-2,-2,-2)  --修改场景事件
instruct_30(42,26,35,26)  --人物移动
Cls()  --清屏
TalkEx("袁承志呢？出来！", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么人胆敢在此吵闹，拿下！", 201, 0,"五仙教徒")  --对话
Cls()  --清屏
if WarMain(163, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 9,1,0,355,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(35,26,35,27)  --人物移动
instruct_30(35,27,29,27)  --人物移动
stands()
TalkEx("哼，看我们教主怎么收拾你！", 201, 0,"五仙教徒")  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小帅哥功夫不错啊，我们来单挑怎么样？", 83, 0)  --对话
else
	TalkEx("小美女功夫不错啊，我们来单挑怎么样？", 83, 0)  --对话
end
Cls()  --清屏
TalkEx("Ｌ＜这五仙教的教主竟是这么年轻的一个女子……＞Ｗ单挑就单挑，还怕你不成！", 0, 1)  --对话
Cls()  --清屏
if WarMain(164, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
--何铁手的血量翻倍还原
JY.Person[83]["血量翻倍"] = 1
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你，你，竟然功夫这么好！", 83, 0)  --对话
Cls()  --清屏
TalkEx("这下知道厉害了吧，快让袁承志出来！", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，不过你要先答应我一件事。", 83, 0)  --对话
Cls()  --清屏
TalkEx("什么事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你的功夫这么好，我想拜你为师。", 83, 0)  --对话
Cls()  --清屏
TalkEx("这，这，你不是开玩笑吧？", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("哈哈哈，你怕什么，我当然不是开玩笑。我呢，就是想跟在你身边学点功夫。怎么了，小帅哥，不敢把姐姐留在身边吗？", 83, 0)  --对话
else
	TalkEx("哈哈哈，你怕什么，我当然不是开玩笑。我呢，就是想跟在你身边学点功夫。怎么了，小美女，不敢把姐姐留在身边吗？", 83, 0)  --对话
end
Cls()  --清屏
if instruct_9() then  --是否要求加入
	JY.Person[83]["主运轻功"] = 0
	TalkEx("师父在上，受徒儿一拜。那袁承志确实来过这里，不过现在已经回华山了。", 83, 0)  --对话
	Cls()  --清屏
	instruct_3(104, 78,1,0,984,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		instruct_10(83)  --加入队伍
		instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去小村吧。", 83, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 55,1,0,181,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
do return end
