if JY.Person[0]["性别"] == 0 then
	TalkEx("怎么了，小帅哥，不敢把姐姐留在身边吗？", 83, 0)  --对话
else
	TalkEx("怎么了，小美女，不敢把姐姐留在身边吗？", 83, 0)  --对话
end
Cls()  --清屏
if instruct_9() then  --是否要求加入
	JY.Person[83]["主运轻功"] = 0
	TalkEx("师父在上，受徒儿一拜。那袁承志确实来过这里，不过现在已经回华山了。", 83, 0)  --对话
	Cls()  --清屏
	instruct_3(104, 78,1,0,984,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		instruct_10(83)  --加入队伍
		instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去*小村吧。", 83, 0)  --对话
	Cls()  --清屏
	instruct_3(70, 55,1,0,181,0,0,7042,7042,7042,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
do return end
