if instruct_16(607) == false then  --是否在队伍
	Cls()  --清屏
	say("此段剧情需要焦宛儿在队才可触发。",0,2)
	Cls()  --清屏
	instruct_30(15, 30, 14, 30)
	do return end  --无条件结束事件
end
instruct_30(15,30,20,30)  --人物移动
instruct_30(20,30,20,25)  --人物移动
instruct_40(2)
stands()
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
TalkEx("华山派的人都在啊？", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("兄台，是你啊。", 54, 0)  --对话
else
	TalkEx("姑娘，是你啊。", 54, 0)  --对话
end
Cls()  --清屏
TalkEx("姓袁的，我明人不作暗事，你不用跟我套近乎，过去的交情一笔勾销。我今日来此，是要为金龙帮报仇的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("金龙帮的事，是我做的，与小师叔无关。我们应闵二爷之邀，为他大哥报仇。这和阁下有什么关系？", 183, 0)  --对话
Cls()  --清屏
--TalkEx("你甭管我和金龙帮是什么关系！反正我今日来，就是要为金龙帮报仇，华山派的人，一个也活不了！", 0, 1)  --对话
say("好，你们既然承认了，那就动手吧。",239,4,"焦宛儿")
Cls()  --清屏
TalkEx("华山乃清修之所，岂容你这恶徒胡作非为！", 185, 0)  --对话
Cls()  --清屏
if WarMain(165, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
--[[
instruct_3(-2, 4,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,1,0,0,0,0,5436,5436,5436,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,1,0,0,0,0,5428,5428,5428,-2,-2,-2)  --修改场景事件
instruct_3(59, 14,1,0,358,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件]]
for i = 5, 10 do
	null(-2,i)
end
null(-2,14)
null(-2,15)
stands()
light()
instruct_2(156, 1)
instruct_0()
TalkEx("原来天书就在他们手里。", 0, 1)  --对话
instruct_0()
if instruct_16(83) then  --是否在队伍
	Cls()  --清屏
	say("这是……我教遗失的金蛇三宝？",83,0)
	Cls()  --清屏
	instruct_2(30,10)
	instruct_2(40,1)
	do return end  --无条件结束事件
end
instruct_37(-5)  --增加品德
do return end
