TalkEx("怎么办，怎么办……", 238, 0,"丁珰")  --对话
Cls()  --清屏
TalkEx("姑娘有何为难之事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我的天哥练功走火入魔，需*要玄冰碧火酒来调和内息，*你能不能帮我去拿来？", 238, 0,"丁珰")   --对话
Cls()  --清屏
TalkEx("去哪拿啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("就在隔壁。我爷爷的几个徒*弟在那看着，我不方便露面*，你帮帮忙吧，我不会亏待*你的。", 238, 0,"丁珰")   --对话
Cls()  --清屏
TalkEx("哈哈，原来你让我去偷你自*己家的东西啊。好吧，看你*急的那副样子，我这个人最*心软了。你爷爷的徒弟，不*会很厉害吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("几个草包，很容易打发。你*快去啊。", 238, 0,"丁珰")   --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,367,372,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,1,0,369,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,1,0,369,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,1,0,369,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
