instruct_37(1)  --增加品德
TalkEx("什么人！", 199, 0,"丁氏门人")  --对话
Cls()  --清屏
TalkEx("啊，是我。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是谁？想干什么！", 199, 0,"丁氏门人")  --对话
Cls()  --清屏
TalkEx("这个，我想借一下那个什么\"玄冰碧火酒\"。", 0, 1)  --对话
Cls()  --清屏
TalkEx("原来是来偷酒的，"..JY.Person[0]["外号2"].."，着家伙！", 199, 0,"丁氏门人")  --对话
Cls()  --清屏
if WarMain(166, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("唉，何必逼我动手呢？何必呢？何——必——呢——？", 0, 1)  --对话
Cls()  --清屏
do return end
