instruct_37(2)  --增加品德
instruct_14()  --场景变黑
instruct_26(61,19,1,0,0)  --修改场景事件
instruct_26(61,18,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(47,36,25,31)  --场景移动
TalkEx("爷爷，四爷爷，你们快宰了这姓白的。", 238, 0,"丁珰")  --对话
Cls()  --清屏
TalkEx("哼，你们以二敌一，算什么好汉。", 43, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，我丁不三本来就不是什么好汉。你听好了，我是和你单打独斗，老四也是和你单打独斗，我们可不是以二敌一。", 162, 0)  --对话
Cls()  --清屏
TalkEx("我叫他下去，他不肯。他叫我停手，我也不听他的。我们俩同时和你单打独斗！", 163, 0)  --对话
Cls()  --清屏
TalkEx("岂有此理！", 43, 0)  --对话
Cls()  --清屏
TalkEx("你们别打了，白师父是好人。", 38, 0)  --对话
Cls()  --清屏
TalkEx("住手！", 0, 1)  --对话
Cls()  --清屏
instruct_25(25,31,47,36)  --场景移动
instruct_30(47,36,26,36)  --人物移动
instruct_40(0)  --设置主角方向
Cls()  --清屏
TalkEx("你们两个真是为老不尊，明明两人欺负一个，还恬不知耻！", 0, 1)  --对话
Cls()  --清屏
TalkEx("老四，我耳朵没毛病吧。", 162, 0)  --对话
Cls()  --清屏
TalkEx("气死我了！气死我了！", 163, 0)  --对话
Cls()  --清屏
TalkEx("不就是二打一么，冲着我来吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("嘿嘿，老四，这"..JY.Person[0]["外号2"].."吹牛的本事比你还强。", 162, 0)  --对话
Cls()  --清屏
TalkEx("气死我了！气死我了！"..JY.Person[0]["外号2"].."，拿命来！", 163, 0)  --对话
Cls()  --清屏
if WarMain(168, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("……你……我今天没吃饱，你等着……", 163, 0)  --对话
Cls()  --清屏
TalkEx("丁珰，我们走。", 162, 0)  --对话
Cls()  --清屏
TalkEx("你——哼！天哥……", 238, 0,"丁珰")   --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(25, 31)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("多谢"..JY.Person[0]["外号"].."救命之恩。", 43, 0)  --对话
Cls()  --清屏
TalkEx("白大侠不必这么客气。在下还有一事相求。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."请讲。", 43, 0)  --对话
Cls()  --清屏
TalkEx("这个石……石帮主是我朋友……", 0, 1)  --对话
Cls()  --清屏
TalkEx("既是"..JY.Person[0]["外号"].."开口，今日暂且放过这小贼，改日再落到我手里，哼！告辞！", 43, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(25, 28)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
if JY.Person[0]["性别"] == 0 then
	TalkEx("大哥哥，谢谢你了。", 38, 0)  --对话
else
	TalkEx("大姐姐，谢谢你了。", 38, 0)  --对话
end
Cls()  --清屏
TalkEx("你和雪山派到底有什么仇啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我也不知道，他们说我是雪山派的叛徒，可是我自己也不知道是怎么回事。", 38, 0)  --对话
Cls()  --清屏
TalkEx("…………", 0, 1)  --对话
Cls()  --清屏
TalkEx("那个白师父是好人，他可能是认错人了。我要回长乐帮了。", 38, 0)  --对话
Cls()  --清屏
TalkEx("你知道自己是长乐帮帮主？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我也不知道，好多事情我都不知道，是他们告诉我的。贝先生是好人，他还给我治病呢。他说让我去帮他们接个什么铜牌子，不然他们都会死的。所以我必须要回去了。", 38, 0)  --对话
Cls()  --清屏
TalkEx("唉，你还真是好人啊。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(94, 15,0,0,0,0,381,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(94, 16,1,0,382,0,0,5152,5152,5152,-2,-2,-2)  --修改场景事件
instruct_3(94, 17,0,0,0,0,0,5144,5144,5144,-2,-2,-2)  --修改场景事件
instruct_3(94, 18,0,0,0,0,0,5150,5150,5150,-2,-2,-2)  --修改场景事件
instruct_3(94, 2,1,0,383,0,0,7070,7070,7070,-2,-2,-2)  --修改场景事件
instruct_3(94, 9,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(39, 9,1,0,386,0,0,5274,5274,5274,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
