--修改原39事件，不可杀狄云
--OEVENTLUA[39] = function()
    --instruct_3(-2,-2,-2,0,40,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_1(179,0,1);   --  1(1):[AAA]说: 你是谁，在这做什么？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(180,37,0);   --  1(1):[狄云]说: 唉，我叫狄云，是个不幸之人。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(181,0,1);   --  1(1):[AAA]说: 我要找些书，随便到这个山洞来看看。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(182,37,0);   --  1(1):[狄云]说: 你还是早些离去的好，免得被我这个不幸之人连累。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(183,0,1);   --  1(1):[AAA]说: 你到底发生了什么事，说来听听。
    instruct_0();   --  0(0)::空语句(清屏)
    say("几年前，我随师父和师妹到荆州去为我万震山万师叔祝寿，但后来却被师叔他们诬赖我勾结盗匪，偷了他万家的金银珠宝，并意图非礼小师娘。而县府大人也没明察秋毫，就把我关了起来。后来听说我师父死了，我师妹……师妹她……她……竟嫁给了万师兄。",37,0); 
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(185,0,1);   --  1(1):[AAA]说: 你很爱你师妹，是吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(186,37,0);   --  1(1):[狄云]说: 我师妹怎能…………怎能嫁给那个姓万的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(187,0,1);   --  1(1):[AAA]说: 那你后来怎么离开那荆州大牢，又怎么会在这里？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(188,37,0);   --  1(1):[狄云]说: 在狱中的几年，同牢的丁典丁大哥告诉了我许多江湖上的事，也教了我"神照经"大法。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(189,0,1);   --  1(1):[AAA]说: 神照经？听起来很厉害的样子……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(190,37,0);   --  1(1):[狄云]说: 突然有一天，丁大哥带我逃狱，说要去看一位朋友。但想不到是丁大哥的红粉知己死了，而她父亲，也就是荆州府尹，居然在她女儿的棺木上下毒，为的就是要害死丁大哥，丁大哥后来就中毒死了。而我逃走了，后来就回到了这里。这个山洞，是我和师妹以前儿时常来玩的地方。
    instruct_0();   --  0(0)::空语句(清屏)

    if instruct_9(0,93) ==true then    --  9(9):是否要求加入?否则跳转到:Label0
        instruct_1(191,0,1);   --  1(1):[AAA]说: 看你也无家可归，和我一起走吧，路上也有个照应。
        instruct_0();   --  0(0)::空语句(清屏)
        if instruct_20(32,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label2
		    instruct_37(2);   --  37(25):增加道德2
		    instruct_1(192,37,0);   --  1(1):[狄云]说: 好吧！如果你不怕被我这个不幸之人连累的话。

            instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
            instruct_3(104,81,1,0,956,0,0,7232,7232,7232,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [81]
            instruct_10(37);   --  10(A):加入人物[狄云]
            instruct_0();   --  0(0)::空语句(清屏)
              
			instruct_3(62,13,1,0,0,0,0,6700,6700,6700,0,0,0);		--修改破庙事件
			instruct_3(62,12,1,0,8012,0,0,6696,6696,6696,0,0,0);		--修改破庙事件
            do return end
        end
		instruct_37(2);   --  37(25):增加道德2
		say("你的队伍已满，我就直接去小村吧。",37,0); 
		instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
		instruct_3(104,81,1,0,956,0,0,7232,7232,7232,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [81]
		instruct_3(70, 7,1,0,125,0,0,5090,5090,5090,-2,-2,-2)  --修改场景事件
		instruct_3(70, 8,1,0,125,0,0,5092,5092,5092,-2,-2,-2)  --修改场景事件

		instruct_0();   --  0(0)::空语句(清屏)
              
		instruct_3(62,13,1,0,0,0,0,6700,6700,6700,0,0,0);		--修改破庙事件
		instruct_3(62,12,1,0,8012,0,0,6696,6696,6696,0,0,0);		--修改破庙事件
        do return end
    end
	do return end
	