Cls()  --清屏
if instruct_16(1) == false then  --是否在队伍
	Cls()  --清屏
	TalkEx("胡斐怎么没和"..JY.Person[0]["外号"].."一起来？", 72, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("二位考虑得如何了？", 72, 0)  --对话
Cls()  --清屏
TalkEx("大丈夫处世当光明磊落。父*仇虽大，胡某也绝不做小人*勾当。", 1, 1)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	Cls()  --清屏
	TalkEx(JY.Person[0]["外号"].."不妨再考虑考虑。", 72, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_37(-4)  --增加品德
instruct_3(104, 84,1,0,973,0,0,7012,7012,7012,-2,-2,-2)  --修改场景事件
instruct_3(3, 9,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 12,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 11,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(3, 10,1,0,638,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
TalkEx(JY.Person[0]["外号"].."果然英明。", 72, 0)  --对话
Cls()  --清屏
TalkEx("哼！我胡某看错人了！告辞*！", 1, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_21(1)  --离开队伍
Cls()  --清屏
instruct_13()  --场景变亮
Cls()  --清屏
TalkEx("唉，胡大哥，怎么那么心急*啊！", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，我们不必管他。要除*掉苗人凤，光靠你我二人还*不够，我们还要再找一个人*。", 72, 0)  --对话
Cls()  --清屏
TalkEx("谁？", 0, 0)  --对话
Cls()  --清屏
TalkEx("一个跌打医生！", 72, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(24, 0,0,0,0,0,33,0,0,0,0,0,0)  --修改场景事件
instruct_3(50, 1,1,0,32,0,0,5168,5168,5168,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	Cls()  --清屏
	instruct_10(72)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 72, 0)  --对话
Cls()  --清屏
instruct_3(70, 40,1,0,159,0,0,7012,7012,7012,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end
