--重新修改雪山事件
--OEVENTLUA[41] = function()
		
		--龙门客栈事件还未触发前不可进入
		if GetS(86, 9, 10, 5) ~= 1 then
			say( "这地方好冷，还是出去吧。",0,1);		--[主角]：这地方好冷，还是出去吧。
			JY.Base["人X1"] = JY.Scene[JY.SubScene]["出口X1"];
			JY.Base["人Y1"] = JY.Scene[JY.SubScene]["出口Y1"];
			return;
		end

		
    instruct_3(3,5,1,0,643,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [5]
    instruct_3(3,6,1,0,643,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [6]
    instruct_3(3,8,1,0,643,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[有间客栈]:场景事件编号 [8]
    instruct_3(-2,0,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [0]
    instruct_3(-2,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [1]
    instruct_3(-2,2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
    instruct_30(27,49,27,34);   --  30(1E):主角走动27-49--27-34
    instruct_25(27,34,27,30);   --  25(19):场景移动27-34--27-30
    instruct_1(197,0,2);   --  1(1):[AAA]说: "落~花~流~水~"
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(198,0,1);   --  1(1):[AAA]说: 这里怎么这么热闹？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(199,94,0);   --  1(1):[???]说: 哼，邪魔歪道，人人得而诛*之！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(200,95,0);   --  1(1):[???]说: 血刀老祖，你已经走投无路*了！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(201,96,0);   --  1(1):[???]说: 你作恶多端，今日就让你血*债血偿。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(202,52,0);   --  1(1):[花铁干]说: 血刀老祖，看枪。
    instruct_0();   --  0(0)::空语句(清屏)
    say("快把我女儿放了，否则今日我们兄弟定让你生不如死！",96,0);		--[水岱]：快把我女儿放了，否则今日我们兄弟定让你生不如死！
    instruct_0();   --  0(0)::空语句(清屏)
    say(JY.Person[0]["外号2"].."，帮帮我，他们四个欺负我一个。",97,0);   --  1(1):[???]说: 
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(204,0,1);   --  1(1):[???]说: 这个……听说……你是坏人*啊！
    instruct_0();   --  0(0)::空语句(清屏)
    say(JY.Person[0]["外号2"].."，他们内力已经不行了，你帮了我，我就送你一本好书！",97,0);   --  1(1):[???]说: 小子，他们内力已经不行了*，你帮了我，我就送你一本*好书！
    instruct_0();   --  0(0)::空语句(清屏)
	say("Ｌ＜书？难道是天书？＞",0,1)
    instruct_0();   --  0(0)::空语句(清屏)
	say("这位"..JY.Person[0]["外号"].."真要与我们为敌吗？",96,0);
    instruct_0();   --  0(0)::空语句(清屏)
    say("Ｌ＜怎么办，狄兄弟还在血刀老祖手里。真的要和“落花流水”为敌么？＞",0,1);

    if DrawStrBoxYesNo(-1, -1, "是否要帮助血刀老祖？", C_WHITE, CC.DefaultFont) then  --是/否
        instruct_37(-2);   --  37(25):增加道德-2
        instruct_1(208,0,1);   --  1(1):[???]说: 为了天书，只好如此了！
        instruct_0();   --  0(0)::空语句(清屏)
		
		--花铁干血量翻倍
		JY.Person[52]["血量翻倍"] = JY.Person[592]["血量翻倍"]
		
        if instruct_6(42,4,0,0) ==false then    --  6(6):战斗[42]是则跳转到:Label1
            instruct_15(0);   --  15(F):战斗失败，死亡
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label1

		--花铁干血量翻倍
		JY.Person[52]["血量翻倍"] = 1
		
        instruct_17(-2,1,24,31,0);   --  17(11):修改场景贴图:当前场景层1坐标18-1F
        instruct_17(-2,1,27,27,0);   --  17(11):修改场景贴图:当前场景层1坐标1B-1B
        instruct_17(-2,1,30,34,0);   --  17(11):修改场景贴图:当前场景层1坐标1E-22
		light()
		
		say("你这个恶人，杀了我爹爹，我和你拼了！",305,4,"水笙")
		
		DrawStrBoxWaitKey("水笙愤怒之极，激发了体内的潜能", C_GOLD, CC.DefaultFont,nil,LimeGreen)
		
		if WarMain(252, 0) == false then  --主角单挑水笙
			Cls()  --清屏
			instruct_15()  --死亡
			Cls()  --清屏
			do return end  --无条件结束事件
		end
		null(-2,8)	--无酒不欢：删除水笙
		JY.Person[37]["品德"] = 40	--用狄云的品德来判定是邪线
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景

		say("水姑娘……", 37, 1);
		
		if JY.Person[0]["性别"] == 0 then
			say("大哥，想不到你是这种人，今后我们还是分道扬镳吧。", 37, 1);
		else
			say("女侠，想不到你是这种人，今后我们还是分道扬镳吧。", 37, 1);
		end
		
		dark()
		null(-2,7)	--无酒不欢：删除狄云
		light()
		
        say(JY.Person[0]["外号"].."饶命，"..JY.Person[0]["外号"].."饶命……",52,0);   --  1(1):[花铁干]说: 少侠饶命，少侠饶命……
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(210,0,1);   --  1(1):[AAA]说: 喂，你刚才还正义凛然的，*现在怎么了？
        instruct_0();   --  0(0)::空语句(清屏)
        say("小人有眼不识泰山，不该与"..JY.Person[0]["外号"].."为敌啊！",52,0);   --  1(1):[花铁干]说: 小人有眼不识泰山，不该与*少侠为敌啊
        instruct_0();   --  0(0)::空语句(清屏)

        if instruct_9(0,105) ==true then    --  9(9):是否要求加入?否则跳转到:Label2
            instruct_37(-1);   --  37(25):增加道德-1
            instruct_1(212,0,1);   --  1(1):[???]说: 哈哈哈，看你还挺识相的，*以后就跟着我吧。
            instruct_0();   --  0(0)::空语句(清屏)
            say("多谢"..JY.Person[0]["外号"].."不杀之恩，花铁干愿为"..JY.Person[0]["外号"].."牵马坠镫。",52,0);   --  1(1):[花铁干]说: 多谢少侠不杀之恩，花铁干*愿为少侠牵马坠镫。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(104,87,1,0,964,0,0,7236,7236,7236,-2,-2,-2);   --  3(3):修改事件定义:场景[钓鱼岛]:场景事件编号 [87]

            if instruct_20(30,0) ==false then    --  20(14):队伍是否满？是则跳转到:Label3
                instruct_10(52);   --  10(A):加入人物[花铁干]
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_17(-2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标19-1D
                instruct_0();   --  0(0)::空语句(清屏)
                say(JY.Person[0]["外号2"].."，你还不赖嘛，加入我血刀门吧！",97,0); 
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_1(215,0,1);   --  1(1):[AAA]说: 废话少说，书在哪？
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_1(216,97,0);   --  1(1):[???]说: 够爽快，拿去！
                instruct_0();   --  0(0)::空语句(清屏)
                instruct_2(139,1);   --  2(2):得到物品[血刀经][1]
                instruct_0();   --  0(0)::空语句(清屏)
                do return; end
            end    --:Label3

            instruct_1(12,52,0);   --  1(1):[花铁干]说: 你的队伍已满，我就直接去*小村吧。
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_3(70,41,1,0,141,0,0,7014,7014,7014,-2,-2,-2);   --  3(3):修改事件定义:场景[小村]:场景事件编号 [41]
            instruct_17(-2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标19-1D
            instruct_0();   --  0(0)::空语句(清屏)
            say(JY.Person[0]["外号2"].."，你还不赖嘛，加入我血刀门吧！",97,0); 
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(215,0,1);   --  1(1):[AAA]说: 废话少说，书在哪？
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_1(216,97,0);   --  1(1):[???]说: 够爽快，拿去！
            instruct_0();   --  0(0)::空语句(清屏)
            instruct_2(139,1);   --  2(2):得到物品[血刀经][1]
            instruct_0();   --  0(0)::空语句(清屏)
            do return; end
        end    --:Label2

        instruct_1(217,0,1);   --  1(1):[???]说: 哼，我生平最看不起的就是*你这种人。受死吧！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(176,52,0);   --  1(1):[花铁干]说: 啊——
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_14();   --  14(E):场景变黑
        instruct_17(-2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标19-1D
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_13();   --  13(D):重新显示场景
        say(JY.Person[0]["外号2"].."，你还不赖嘛，加入我血刀门吧！",97,0); 
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(215,0,1);   --  1(1):[AAA]说: 废话少说，书在哪？
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_1(216,97,0);   --  1(1):[???]说: 够爽快，拿去！
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_2(139,1);   --  2(2):得到物品[血刀经][1]
        instruct_0();   --  0(0)::空语句(清屏)
        do return; end
    end    --:Label0

    instruct_1(218,0,1);   --  1(1):[???]说: 即便为了天书，我也不能做*违反道义之事，血刀老祖，*你觉悟吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_37(2);   --  37(25):增加道德2

    if instruct_6(7,5,0,0) ==false then    --  6(6):战斗[7]是则跳转到:Label4
        instruct_0();   --  0(0)::空语句(清屏)
        instruct_15(0);   --  15(F):战斗失败，死亡
        do return; end
        instruct_0();   --  0(0)::空语句(清屏)
    end    --:Label4
	
	light()

		instruct_3(-2,3,1,0,0,0,0,8744,8744,8744,0,0,0);			--血刀老祖贴图 变换
		
		
		say("徒儿，你居然对我暗下毒手，我绝不饶你，受死吧！", 97,0);		--[血刀老祖]：徒儿，你居然对我暗下毒手，我绝不饶你，受死吧
		if JY.Person[0]["性别"] == 0 then
			say("你伤我大哥，我跟你拼了！！！", 37,0);		--[狄云]：你伤我大哥，我跟你拼了！！！
		else
			say("你打伤女侠，我跟你拼了！！！", 37,0);		--[狄云]：你伤我大哥，我跟你拼了！！！
		end
		DrawStrBoxWaitKey("拼搏中狄云神照功意外大成……", C_ORANGE, CC.DefaultFont);	--(系统提示：拼搏中狄云神经功意外大成..........）
		instruct_0();   --  0(0)::空语句(清屏)
		
		say("啊~~~", 97,0);		--[血刀老祖]：啊~~~
		say("呼呼~~~", 37,0);		--[狄云]：呼呼~~~
		
		dark()
		instruct_3(-2,3,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
	
		say("狄兄弟，你没事吧？",0,1);		--[主角]：狄兄弟，你没事吧
		say("没事，刚才在命悬一刻的时候，突然感觉精神力勃然而兴，才得以踹死这老恶僧。丁大哥说得没错，这神照功果然是武功第一奇功。", 37,0);
		
		local xid = 37;
		if JY.Base["畅想"] == 37 then
			xid = 0
		end
		QZXS("狄云攻防轻各能力提升三十点");		--(系统提示：狄云攻防轻能力各提升三十点）
		AddPersonAttrib(xid, "攻击力", 30)
		AddPersonAttrib(xid, "防御力", 30)
		AddPersonAttrib(xid, "轻功", 30)
	
		QZXS("狄云五系兵器值各提升十点");		--(系统提示：狄云四系兵器值各提升十点）
		AddPersonAttrib(xid, "拳掌功夫", 10)
		AddPersonAttrib(xid, "指法技巧", 10)
	    AddPersonAttrib(xid, "御剑能力", 10)
	    AddPersonAttrib(xid, "耍刀技巧", 10)
	    AddPersonAttrib(xid, "特殊兵器", 10)
		
		--狄云洗血刀
		instruct_35(37,1,63,0)
    

    instruct_3(-2,7,1,0,8003,0,0,9228,9228,9228,0,0,0);		--新增事件8003，重新加入狄云
		
		
    say("我等四人已经内力不济，多亏"..JY.Person[0]["外号"].."及时赶到。",94,0);   --  1(1):[???]说: 
    instruct_0();   --  0(0)::空语句(清屏)
    say("是啊，"..JY.Person[0]["外号"].."，你是手刃血刀老祖的大英雄啊！",95,0);   --  1(1):[???]说: 是啊，少侠，你是手刃血刀*老祖的大英雄啊
    instruct_0();   --  0(0)::空语句(清屏)
	say("回到中原后，我们一定为"..JY.Person[0]["外号"].."传名啊。",52,0);
    instruct_0();   --  0(0)::空语句(清屏)
    say(JY.Person[0]["外号"].."，感谢你的救命之恩，这本刀法你拿去吧，后会有期。",96,0);   --  1(1):[???]说: 
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_2(164,1);   --  2(2):得到物品[鬼头刀法][1]
    instruct_0();   --  0(0)::空语句(清屏)
	say("爹……我想……",305,4, "水笙");
	say("想你妈了吧？我们这就回去。",96,0);
	say("……狄大哥……再见了。",305,4, "水笙");
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,1,24,31,0);   --  17(11):修改场景贴图:当前场景层1坐标18-1F
    instruct_17(-2,1,27,27,0);   --  17(11):修改场景贴图:当前场景层1坐标1B-1B
    instruct_17(-2,1,30,34,0);   --  17(11):修改场景贴图:当前场景层1坐标1E-22
    instruct_17(-2,1,25,29,0);   --  17(11):修改场景贴图:当前场景层1坐标19-1D
	null(-2,8)	--无酒不欢：删除水笙
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
--end