--无酒不欢：新天邪聚贤庄
instruct_25(JY.Base["人X1"],JY.Base["人Y1"],29,27)
say("听闻薛神医和游氏兄弟在聚贤庄摆设英雄大宴，乔峰不齿于中原豪杰，岂敢厚颜前来赴宴？只是今日有急事相求薛神医，来得冒昧，还望恕罪。",50,0)

say("乔兄有什么事要在下效劳？",45,0)

say("只因在下行事鲁莽，累得这小姑娘中了别人的掌力，身受重伤。",50,0)

say("当今之世，除了薛神医外，无人再能医得，是以不揣冒昧，前来请薛神医救命。",50,0)

say("Ｌ＜微一沉吟＞Ｗ这位姑娘尊姓，和阁下有何瓜葛？",45,0)

say("你可是姓朱？",50,0)

say("乔大爷，我姓阮。", 104, 4)

say("薛神医，她原来姓阮，我也是此刻才知。",50,0)

say("如此说来，你跟这位姑娘并无深交？",45,0)

say("她只是某人的丫环，乔某虽不齿那人的做事，却不能对这丫环见死不救。",50,0)

say("Ｌ＜伸手给阿朱搭了搭脉＞Ｗ这位姑娘若不是敷了太行山谭公的治伤灵药，又得阁下以内力替她续命，恐怕早已死了。",45,0)

say("薛神医慈悲，请救了这位姑娘，乔峰日后不敢忘了大德。",50,0)

say("日后不敢忘了大德？难道今日你还想能活着走出这聚贤庄么？",45,0)

say("是活着出去也好，死着出去也罢，那是另一回事了。这位姑娘的伤势，还请薛先生医治才是。",50,0)

say("不论是谁带这姑娘来，我都给她医治。哼，单单是你带来，我便不治。",45,0)

say("众位今日群集聚贤庄，为的是商议对付乔某，姓乔的岂有不知？",50,0)

say("乔大爷，既然如此，你就不该为了我而到这里来冒险啦！", 104, 4)

say("我想众位都是堂堂丈夫，是非分明，要杀之而甘心的只乔某一人，跟这个小姑娘丝毫无涉。",50,0)

say("薛先生竟将痛恨乔某之意，牵连到阮姑娘身上，岂非大大的不该？",50,0)

say("Ｌ＜急得哭了出来＞Ｗ乔大爷，你快自己先走，不用管我！他们跟我无怨无仇，不会害我的。", 104, 4)

say("也罢，这位小姑娘，老夫便出手救治。",45,0)

say("但乔峰你罪大恶极，我们正在商议围捕，要将你乱刀分尸，祭你的父母，师父。",45,0)

say("你自己送上门来，那是再好也没有了。你便自行了断吧！",45,0)

say("有薛神医一言，乔峰便是血溅聚贤庄，给人乱刀分尸，那又算得什么？大丈夫生亦何欢，死又何惧？",50,0)

say("今日乔某与各位喝过了这绝交酒，咱们从前的交情就一笔勾销。哪一个先来决一死战！",50,0)

dark()

light()

say("乔狗厉害，大伙儿先杀了这丫头再说！",200,4,"青城弟子")

say("好不要脸！Ｌ＜他之前要脱身原本不难，但与众多武林高手恶斗之余还要分心照顾阿朱的周全，却是越来越不容易了＞",50,0)

dark()

light()

say("恶贼乔峰已身受重伤，别让他逃走！",45,0)

say("乔某今日自行了断，不死于鼠辈之手！",50,0)

say("Ｌ＜真是天助我也！＞",0,4)

instruct_25(29,27,JY.Base["人X1"],JY.Base["人Y1"])

instruct_30(JY.Base["人X1"],JY.Base["人Y1"],29,29)

say("乔峰，先把《天龙八部》交出来，再自行了断也不迟。",0,4)

say("乔某一生光明磊落，你信也好，不信也罢，那《天龙八部》并不在乔某身上。",50,0)

dark()

--萧远山出现
addevent(-2, 35, 1, nil, nil, 4283*2)

light()

say("跟我走！",112,0,"？？？")

say("阁下是？",50,4)

say("为一个相貌平平、非亲非故、无恩无义的女娃子枉送有用之躯，真是愚不可及！",112,0,"？？？")

say("你是谁？休想救走乔峰！",0,4)

--主角单挑萧远山
if WarMain(248, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end

addevent(-2, 35, 1, nil, nil, 4286*2)
light()

say(JY.Person[0]["外号2"].."功夫不错！看暗器！",112,0,"？？？")

instruct_2(268, 1)

say("……这是哪门子暗器啊？",0,4)

say("Ｒ哈～哈～哈…………",112,0,"？？？")

say("Ｌ＜正值迟疑迷惑、心神略分之际，听到此震耳欲聋的声音后只觉一阵晕眩＞",0,4)

instruct_14()  --场景变黑
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,1,0,568,569,0,3208*2,3208*2,3208*2,-2,-2,-2)  --修改场景事件
--instruct_3(54, 32,1,0,567,0,0,6084,6084,6084,-2,-2,-2)  --修改场景事件
null(-2,35)
null(-2,24)
null(-2,25)
instruct_19(11, 42)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
instruct_27(-1,6014,6024)  --显示人物动画
instruct_3(-2, 31,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(51, 25,0,0,0,0,594,0,0,0,-2,-2,-2)  --丐帮游坦之事件

say("啊……我这是在哪里啊？ｗ哦，想起来了，乔峰被一武功高强的青衣人救走。", 0, 4)  --对话

say("Ｌ＜不过乔峰已是中原武林的公敌，此后再难呼风唤雨。丐帮现在群龙无首，倒是有一场好戏看了＞", 0, 4)  --对话

instruct_37(-3)

do return end