say("少林后山乃本寺高僧修行之地，施主请回。",210,0,"少林弟子")

say("在下有要事求见三位高僧。",0,1)

say("师叔祖们闭关修行，多年来一向不见外人。",210,0,"少林弟子")

say("Ｌ＜看来这小和尚顽固的很，得想想其他办法＞",0,1)

say("Ｌ＜朗声道＞Ｗ晚辈受明教光明二使之托，前来拜见三位前辈高僧。",0,1)

say("Ｒ阿弥陀佛，老衲师兄弟三人闭关数十载，早已不闻尘务，施主请回吧。",346,0,"渡厄")

say("Ｌ＜继续朗声道＞Ｗ晚辈此次前来，是想化解金毛狮王谢逊与贵寺的恩怨，此事实在另有隐情，希望三位高僧能听在下解释事情的来龙去脉。",0,1)

say("Ｒ…………",346,0,"渡厄")

say("Ｒ让他进来吧。",346,0,"渡厄")

say("Ｌ＜糟糕，这"..JY.Person[0]["外号2"].."想干什么？千万别坏了我的一番布置，先潜入看看情况再说＞",18,0)

say("是，师叔祖。施主请进。",210,0,"少林弟子")

addevent(28, 90, 1, 4110, 1, -2)

My_Enter_SubScene(106,56,44,2)

instruct_37(1)

do return end