dark()

light()

instruct_30(32,19,22,19)

stands()

say("见过三位大师。晚辈此次受明教之托，期盼能够化解金毛狮王与贵寺的恩怨。",0,1)

say("哼，老衲且问你，明教怎么派你这后生"..JY.Person[0]["外号2"].."前来，Ｒ阳顶天Ｗ不敢来么？",346,0,"渡难")

say("阳教主逝世已很久了。",0,1)

say("啊，阳顶天竟然已经……",346,0,"渡厄")

say("大师想必识得阳教主了？",0,1)

say("自然识得。若非识得Ｒ大英雄阳顶天Ｗ，老衲师兄弟三人，又何必坐这三十余年的枯禅？",346,0,"渡厄")

say("Ｌ＜糟糕，看来他们和阳顶天不仅认识，还有深仇大怨＞",0,1)

say("老衲法名Ｇ渡厄Ｗ，这位白脸师弟，法名Ｇ渡劫Ｗ，这位黑脸师弟，法名Ｇ渡难Ｗ。阳顶天既死，我三人的深仇大恨，只好着落在明教身上。",346,0,"渡厄")

say("至于谢逊，我们师侄空见便是死在此人手下。阁下既来到此地，自是有恃无恐。数十年来恩恩怨怨，咱们武功上作一了断便是。",346,0,"渡厄")

say("Ｌ＜看来现在是解释不清了＞",0,1)

say("三位大师神功盖世，晚辈原本不应打扰，奈何谢逊涉及到《倚天屠龙记》一书的下落，晚辈纵是不自量力，也非救他不可。",0,1)

say("晚辈想请两位朋友相助，以三对三，公平领教。若侥幸能赢一招半式，希望三位神僧能让晚辈带走谢逊。",0,1)

say("好狂妄的"..JY.Person[0]["外号2"].."，过招吧！",346,0,"渡劫")

--战斗vs三渡，只能选两个队友
--周芷若血量临时翻倍
JY.Person[631]["血量翻倍"] = JY.Person[592]["血量翻倍"]

if WarMain(253, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏
end
JY.Person[631]["血量翻倍"] = 1

light()

say("阁下果然好身手，老衲师兄弟技不如人，谢逊你带走吧。",346,0,"渡厄")

say(JY.Person[0]["外号"].."请回吧，谢某生平最大的罪孽，就是杀了空见大师。",13,0)

say("谢某若是落入旁人之手，自当奋战到底，但今日囚在少林寺中，谢某甘心受戮，以抵偿空见大师这条性命。",13,0)

say("你失手伤了空见大师，那是受成昆这恶贼奸计摆布，何况狮王你血仇未报，岂能死在成昆手下？",0,1)

say("你说的成昆，可是圆真？",346,0,"渡难")

say("正是。那圆真俗家姓名，叫做成昆，外号混元霹雳手，原是金毛狮王谢逊的业师。",0,1)

say("成昆有一师妹，嫁与明教前教主阳顶天为妻。成昆一直对师妹有情，因情生妒，终与明教结下了深仇大恨。",0,1)

say("此后成昆处心积虑想摧毁明教，与阳夫人幽会私通以致激死阳顶天。假醉图奸谢逊之妻，杀其全家，逼使谢逊乱杀武林中人。",0,1)

say("其后拜空见神僧为师，并以已名约谢逊和空见神僧见面。空见大师慈悲为怀，一心化解双方的仇怨，相信了成昆。",0,1)

say("怎料成昆失信不出，致使空见大师身受谢逊一十三拳，饮恨而终……其种种罪恶，实令人发指也。",0,1)

say("Ｌ三僧越听越心惊，这些事情似乎件件匪夷所思，但事事入情入理，无不若合符节。",0,2)

say("Ｌ＜一声长叹＞Ｗ阳顶天原来是这样死的？",346,0,"渡厄")

say("晚辈不知阳教主如何与三位大师结仇，只怕其中有奸人挑拨是非，此人多半便是这圆真了。渡厄大师不妨回思往事，印证晚辈是否虚言相欺。",0,1)

say("那也有些道理。老衲与阳顶天结仇，这成昆出了大力。后来他恳求拜老衲为师，老衲向来不收弟子，这才引荐他拜在空见师侄门下。",346,0,"渡厄")

say("如此说来，这些都是他有意安排的了？",346,0,"渡厄")

say("不仅如此，目前他更觊觎少林寺掌门方丈之位，收罗党羽，阴谋密计，要害了空闻方丈取而代之……",0,1)

dark()

--成昆出现
addevent(-2, 6, 1, nil, nil, 2649*2)

light()

say("臭"..JY.Person[0]["外号2"].."一派胡言，受死吧！",18,0)

DrawStrBoxWaitKey("你被成昆偷袭得手，受伤了", C_RED, CC.Fontbig)

JY.Person[0]["生命"] = JY.Person[0]["生命"] - 300
JY.Person[0]["内力"] = JY.Person[0]["内力"] - 3000
JY.Person[0]["受伤程度"] = JY.Person[0]["受伤程度"] + 30

if WarMain(254, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏
end

null(-2,6)

light()

say("偷袭之人当真是圆真么？",346,4,"渡劫")

say("确实是他。",346,0,"渡难")

say("若非他做贼心虚，何必要……",346,4,"渡劫")

say("谢逊，你随这位"..JY.Person[0]["外号"].."下山吧。",346,4,"渡劫")

say("几个月来，在这地牢中每日听着三位高僧诵经念佛，听着山下寺中传来的晨钟暮鼓，回思往事，谢某手上染了许多无辜之人的鲜血，委实百死难赎。",13,0)

say("唉，诸般恶因罪孽，我比成昆做得更多。"..JY.Person[0]["外号"].."相救好意，谢某心领，但我已不愿下山离开。",13,0)

say("谢法王，你……你当真不愿意离开？",0,1)

say("正是。我所受的冤屈，你已对三位高僧分说明白。我所做的罪孽，却须由我自己身受报应。",13,0)

say(JY.Person[0]["外号"].."，你就去吧。这本《倚天屠龙记》请你收下，以谢数月来相助相救之德。",13,0)

instruct_2(155, 1)	--《倚天屠龙记》

say("今日重得见识当世贤豪，至感欣幸，阁下更是出类拔萃。",346,4,"渡厄")

say("这本金刚伏魔圈，乃是老衲师兄弟的看家本领，今日以此相赠，唯望阁下多多造福苍生，方不负此大好身手。",346,4,"渡厄")

instruct_2(171, 1)	--金刚伏魔圈

My_Enter_SubScene(28,49,14,3)

instruct_37(2)

addevent(11, 110, 1, 4113, 1, 2667*2)	--光明顶范遥

null(9,1)	--删除成昆

do return end