--畅想萧中慧不能种树
if JY.Base["畅想"] == 77 then
	do return end
end
if instruct_16(77) == false then
	do return end
end
instruct_30(35,31,34,31)
dark()

addevent(-2, 96, 1, nil, nil, 4302*2)

stands()

light()

local nick;

if JY.Person[0]["性别"] == 0 then
	nick = "哥哥"
else
	nick = "姐姐"
end

say(nick.."，这里就是你常说的Ｌ小村Ｗ吧！",77,0)

say("是啊，来参观一下吧。",0,1)

say("嘻嘻，那我看看～这里有个小池塘，好漂亮啊。",77,0)

say("嘿嘿，以前小村里空荡荡的，无趣的很。后来我一咬牙，花了好多天的功夫修了个池塘。",0,1)

say("你修的？真想不到！",77,0)

say("……什么意思嘛！",0,1)

say("＜莞尔一笑＞"..nick.."，Ｌ夏夜里在这里乘凉，看天上的星星，Ｗ一定很惬意吧？",77,0)

say("当然啦，池塘里还有星星的倒影呢！以后有你陪着一起数星星，就更惬意了！我还会讲很多江湖上的事给你听！",0,1)

dark()

JY.Base["人X1"] = 19
JY.Base["人Y1"] = 29
instruct_40(0)  --主角面向右
null(-2, 96)
addevent(-2, 97, 1, nil, nil, 4301*2)

light()

say("…………咦，这里有个木桩，是干嘛的？",77,0)

say("这是我以前用来练功的，不过已经荒废好久啦。",0,1)

say("那我们在这里种棵树吧，你说好不好？",77,0)

say("好啊！下次咱们去集市时，买颗小树苗回来！",0,1)

say("嘻嘻，刚才我们回来时，就路过一个集市。你稍等一下，我这就去买！",77,0)

dark()

null(-2, 97)

light()

say("Ｌ＜慧妹，真是个急性子啊……＞",0,1)

dark()

addevent(-2, 98, 1, nil, nil, 4300*2)

light()

say(nick.."，你看这是什么？",77,0)

say("这个……这个么……俺曾经认识的！",0,1)

say("＜抿嘴一笑＞卖树的老人说，这是一株稀有的Ｒ蟠桃树Ｗ。据说结出的Ｒ大蟠桃Ｗ不仅味道鲜美，对武学之人更是大有裨益呢！",77,0)

say("太好了！！慧妹辛苦啦～你休息一下，剩下的就看我的吧。",0,1)

dark()

--这里判定，如果已经有可以摘取的累计蟠桃，则树上直接带桃子
if JY.Person[520]["品德"] > 0 then
	addevent(-2, 65, 1, 4119, 1, 2366*2)
else
	addevent(-2, 65, 1, 4118, 1, 2365*2)
end

light()

say(nick.."，你看，我们栽的树…………好美啊…………",77,0)

say("嗯嗯，多亏我的慧妹雷厉风行，挑选有方，慧眼识“株”啊！",0,1)

say("＜脸一红＞就会耍贫嘴……我不在时，你要记得照顾它，给它浇水施肥除虫哦。",77,0)

say("放心吧，我最爱劳动了！",0,1)

dark()

null(-2, 98)
null(-2, -2)

JY.Person[521]["品德"] = 1

light()

do return end  --无条件结束事件