if instruct_20() then  --判断队伍是否已满
	say("人带的太多了。", 0, 1)
	instruct_30(JY.Base["人X1"], 32, JY.Base["人X1"], 33)
	do return end
else
	instruct_10(601)	--韦小宝入队
end

instruct_25(JY.Base["人X1"], 32, 48, 24)

say("皇上，这小太监手持匕首，招招狠辣，不留余地，到底是何用意？", 300, 0, "鳌拜")

say(JY.Person[0]["外号"].."！我们有危险，你快来帮我们拿下他！", 225, 4, "韦小宝")

say("好啊！原来是要蓄意害我，大伙儿一起死了罢！", 300, 0, "鳌拜")

--战斗

--可败，失败的话小宝用石灰粉

if WarMain(260, 0) == false then  --战斗开始
	instruct_19(48,29)
	
	stands()
	
	light()
	
	say("辣块妈妈的，想不到鳌拜这厮这么厉害。看来要出绝招了……石灰粉！", 225, 4, "韦小宝")
	
	say("啊！我的眼睛！", 300, 0, "鳌拜")
	
	say("趁现在！", 225, 4, "韦小宝")
	
	JY.Person[601]["品德"] = 40		--用韦小宝的品德判定是否打赢了鳌拜
	
	Cls()  --清屏
	
	dark()
end
instruct_19(48,29)
	
stands()
	
light()

say("我是忠臣！我无罪！这般阴谋害我，我死也不服！", 300, 0, "鳌拜")

say("你造反！你带了刀子来见皇上，罪该万死。", 225, 4, "韦小宝")

say("我没带刀子！", 300, 0, "鳌拜")

say("咦？你身上不是插了两把刀子？背上一把，手臂上还一把，还敢说没带刀？带下去，关入天牢！", 225, 4, "韦小宝")

say("冤枉，冤枉！皇上亲手杀我顾命大臣，先帝得知，必不饶你！", 300, 0, "鳌拜")

dark()

null(-2, 18)

light()

say("小宝，这位"..JY.Person[0]["外号"].."是谁？", 317, 0, "玄烨")

say("是我的一个朋友。", 225, 4, "韦小宝")

say("好，英雄不问出处。"..JY.Person[0]["外号"].."和小宝今日立下大功，朕重重有赏，你们需要什么尽管跟朕说。你要不要做官？", 317, 0, "玄烨")

say("谢过皇上好意，我自幼逍遥惯了，对做官没什么兴趣。我帮忙除掉鳌拜，只是因为鳌拜对汉人过于残暴欺虐，天下百姓怨声载道。", 0, 1)

say("希望皇上日后可以善待百姓，不分种族，一视同仁。", 0, 1)

say("嗯，朕会努力做一个好君主。这样吧，朕命你和小宝为钦差大臣，去抄鳌拜的家，如果看到有什么喜欢的东西，就随便拿好了。", 317, 0, "玄烨")

say("Ｌ＜这可是个大大的肥差啊，我韦小宝要发财了＞", 225, 4, "韦小宝")

say("皇上神机妙算，鸟生鱼汤，小桂子只是奉旨办事，又有什么功劳了？", 225, 4, "韦小宝")

say("Ｌ＜说不定会有天书的线索＞Ｗ谢皇上。", 0, 1)

instruct_2(273,1)	--皇宫令牌

Cls()  --清屏

dark()

for i = 15, 26 do
	null(-2, i)
end

--鳌拜府的门卫
null(107, 104)
null(107, 105)

addevent(108, 3, 0, 4129, 3, 0)	--可以离开皇宫了

instruct_3(71, 20,0,0,0,0,63,0,0,0,-2,-2,-2)  --神龙教事件开启
instruct_3(76, 12,0,0,0,0,89,-2,-2,-2,-2,-2,-2)  --台湾事件开启

light()

do return end