say("咦？那边不是洪七公和欧阳锋吗？",0,1)

instruct_25(28,29,24,41)

say("喂！你武功不错啊，你叫什么名字？",60,0)

say("我叫欧阳锋。",69,0)

say("喂！那我叫什么名字？",60,0)

say("你连自己名字都不知道？快回家想想吧！",69,0)

say("你肯定知道，你快告诉我。",60,0)

say("好吧，你名叫臭蛤蟆。",69,0)

say("臭蛤蟆？这名字虽然不好听，但是够霸气。",60,0)

say("只是不知道为什么，我一看见你就来气，接招！",60,0)

say("Ｌ＜两位前辈这样打下去也不是办法＞",0,1)

--主角移动
instruct_25(24,41,28,29)

instruct_30(28,29,28,41)

instruct_30(28,41,27,41)

stands()

say("两位，暂且住手！",0,1)

--主角单挑欧阳锋洪七公
if WarMain(263, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏
end

light()

instruct_37(2)  --增加品德

say("两位打了这么久，想必肚子都饿了吧，大家先来饱吃一顿再比如何？",0,1)

say("好极，好极，臭蛤蟆，先别打了。",69,0)

dark()

light()

say("他是欧阳锋，欧阳锋是坏人。",60,0)

say("不错，欧阳锋是坏人，欧阳锋该死。",69,0)

say("Ｌ＜看来老家伙已经被我打蒙了，居然说自己该死＞",60,0)

say("欧阳锋，咱们拳脚比不出胜败，再比兵器。",60,0)

say("不比啦，算你胜就是。",69,0)

say("什么算不算的，我非让你知道我的厉害不可。",60,0)

say("Ｌ＜两位前辈年事已高，再打下去怕是要同归于尽了＞",0,1)

dark()

light()

say("过瘾！",60,0)

say("Ｌ＜和老毒物的这番较量确实痛快，老叫化终于琢磨明白了那九阴真经总纲的奥妙＞",69,0)

say("臭蛤蟆，你服了我么？",69,0)

say("服什么？我还有许多厉害的招数没有用出来呢！",60,0)

say("哦？我欧阳锋也有很多厉害的绝招未使。臭蛤蟆，你见识过九阴真经么？",69,0)

say("哈哈！那九阴真经我早已烂熟于心，倒是应该让你见识见识！",60,0)

say("那你见识过丐帮的打狗棒法么？",69,0)

say("打狗棒法有什么了不起？",60,0)

if JY.Person[0]["性别"] == 0 then
	say("打狗棒法天下无双，就算我现在教给这位小兄弟，让他和你打，保准你臭蛤蟆也打不过。",69,0)
else
	say("打狗棒法天下无双，就算我现在教给这位小姑娘，让她和你打，保准你臭蛤蟆也打不过。",69,0)
end

say("放屁！我这有一路我自创的杖法，绝对不会输给你的什么打狗打猫棒法！",60,0)
--欧阳锋洗灵蛇
instruct_35(60, 2, 81, 999)
--洪七洗九阴
instruct_35(69, 2, 107, 50)
SetTianNei(69, 107)
instruct_49(69, 0)

local headid
--头像的确认
if JY.Base["标准"] > 0 then
	if JY.Person[0]["性别"] == 0 then
		headid = 280 + JY.Base["标准"]
	else
		headid = 500 + JY.Base["标准"]
	end
--特殊
elseif JY.Base["特殊"] > 0 then
	if JY.Person[0]["性别"] == 0 then
		headid = 290
	else
		headid = 510
	end
else
	headid = JY.Person[0]["头像代号"]
end

local r = JYMsgBox("请选择", "我应该帮哪位前辈？", {"北丐","西毒"}, 2, headid)
--帮北丐
if r == 1 then
	if JY.Person[0]["性别"] == 0 then
		say("小兄弟让老蛤蟆见识下打狗棒法。",69,0)
	else
		say("小姑娘让老蛤蟆见识下打狗棒法。",69,0)
	end
	--单挑灵蛇欧阳锋
	if WarMain(264, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件
		Cls()  --清屏
	end
	light()
	
	say("打狗棒法果然厉害，臭蛤蟆一定会想出破解之法，告辞。",60,0)
	
	dark()
	--欧阳锋离开
	null(-2, 3)
	
	light()
	
	if JY.Person[0]["性别"] == 0 then
		say("老叫花最怕欠人人情，这是打狗棒法的完整心法口诀，小兄弟记住了。",69,0)
	else
		say("老叫花最怕欠人人情，这是打狗棒法的完整心法口诀，小姑娘记住了。",69,0)
	end
	
	say("臭蛤蟆走了，老叫化也该走了。",69,0)
	
	dark()
	--洪七公离开
	null(-2, 2)
	
	null(-2,-2)
	
	light()
	
	instruct_2(167,1)	--打狗
	
	instruct_2(49,1)	--打狗棒
	
	--畅想杨过
	if JY.Base["畅想"] == 58 then
		local r = JYMsgBox("请选择", "是否要学习打狗棒法？", {"是","否"}, 2, 58)
		if r == 1 then
			JY.Person[0]["武功5"]=80
			JY.Person[0]["武功等级5"]=50
			JY.Person[0]["天赋外功3"]=80
		end
	end
	do return end
--帮西毒
else
	say("还是这"..JY.Person[0]["外号2"].."有眼光，我现在教你七十二路灵蛇杖法。",60,0)
	--单挑九阴洪七公
	if WarMain(265, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件
		Cls()  --清屏
	end
	light()
	
	say("老毒物啊老毒物！亏你想得出这破解之法，老叫化服了！好欧阳锋，好欧阳锋！",69,0)
	
	say("我是欧阳锋！我是欧阳锋！我是欧阳锋！你是老叫化洪七公！",60,0)
	
	say("今天老叫化甘拜下风，告辞。",69,0)
	
	dark()
	--洪七公离开
	null(-2, 2)
	addevent(111, 3, 1, nil, nil, 3985*2)	--欧阳锋
	light()
	
	say("哈哈，斗了一辈子，今天终于赢了老叫化！",60,0)
	
	say(JY.Person[0]["外号2"].."，你运气不错，我不想让这套灵蛇杖法失传，就传授给你吧！",60,0)
	
	dark()
	--欧阳锋离开
	null(-2, 3)
	
	null(-2,-2)
	
	light()
	
	instruct_2(247,1)	--灵蛇
	
	instruct_2(244,1)	--蛇杖
	
	--畅想杨过
	if JY.Base["畅想"] == 58 then
		local r = JYMsgBox("请选择", "是否要学习灵蛇杖法？", {"是","否"}, 2, 58)
		if r == 1 then
			JY.Person[0]["武功5"]=81
			JY.Person[0]["武功等级5"]=50
			JY.Person[0]["天赋外功3"]=81
		end
	end
	do return end
end
do return end