--主角
say("Ｌ＜这位姑娘好美啊，就像故事中的天仙一样＞",0,4)

--小龙女
say("你是谁？来古墓做什么？",59,0)

--主角
say("在下"..JY.Person[0]["姓名"].."，无意间路过此地。请问姑娘芳名？",0,4)

--小龙女
say("我姓龙，自幼便长在这里。",59,0)

--主角
say("龙姑娘住在古墓里，冷冷清清的，人生未免无趣。不如跟在下出去见识见识外面的大千世界，岂不是好？",0,4)

--小龙女
say("我没下过终南山。其实外面也不过是有山有树，有太阳月亮，有什么好？",59,0)

--主角
say("啊，那你可真是错过太多精彩啦。城里形形色色的东西，那才叫好看呢。",0,4)

--小龙女
say("外面真有那么好么？",59,0)
say("过儿也是这么说的……",59,0)
say("你，愿意带我出去找过儿吗？",59,0)

if DrawStrBoxYesNo(-1, -1, "是否带小龙女去找杨过？", C_WHITE, CC.DefaultFont) then  --是/否

	if instruct_20() == false then
		--入队后 主角
		say("Ｌ＜不知她口中的过儿是哪位，是她的心上人吗？＞",0,4)
		say("姑娘放心，在下一定尽力帮你找到你想找的人。",0,4)
		dark()
		null(-2,-2)
		instruct_39(45)  --打开场景程英居
		light()
		instruct_10(59)
		instruct_2(239, 1)	--金丝手套
		do return end
	end

	say("人似乎带的太多了。", 37, 1);

	do return end

end

say("对不起，我还有事。",0,4)

do return end