dark()

addevent(-2, 17, 1, nil, nil, 4363*2)

stands()

light()

--公孙绿萼
say("这位"..JY.Person[0]["外号"].."，我来救你出去。",333,0,"公孙绿萼")

--主角
say("公孙姑娘……",0,4)

--公孙绿萼
say("快跟我来，被我爹发现就麻烦了。",333,0,"公孙绿萼")

dark()

null(-2,-2)

null(-2,15)

null(-2,17)

instruct_19(47,9)

instruct_40(3)  --主角面向左

addevent(-2, 19, 1, nil, nil, 4366*2)

addevent(-2, 20, 1, nil, nil, 4361*2)

light()

--主角
say("呼……终于重见天日了！",0,4)

--裘千尺
say("现在带我去找公孙止！",332,4,"裘千尺")

--主角
say("恕我直言，公孙止武功高强，前辈恐怕……",0,4)

--裘千尺
say("嘿嘿……公孙止的家传武学，未必便没有破绽。你只管带我去就行了！",332,4,"裘千尺")

dark()

null(-2,19)

null(-2,20)

addevent(-2, 11, 0, 4151, 3, 0)

light()

do return end
