dark()

stands()

addevent(-2, 12, 1, nil, nil, 4361*2)

addevent(-2, 13, 1, nil, nil, 4363*2)

light()

instruct_25(31,19,29,8)  --场景移动

--裘千尺
say("公孙止，你还记得旧人么？",332,0,"裘千尺")

--公孙止
say("尊驾何人？",321,4,"公孙止")

--裘千尺
say("我和你谊属至亲，你假装不认得我么？",332,0,"裘千尺")

--公孙止
say("我与尊驾素不相识，说什么谊属至亲，岂不可笑？",321,4,"公孙止")

--绝情谷门人
say("主母，主母，你可没死啊！",351,5,"绝情谷众")

--裘千尺
say("王二叔，亏你还记得我！",332,0,"裘千尺")

--公孙止
say("都给我退开！贱人，你怎地又回来了？居然还有面目来见我？",321,4,"公孙止")

--公孙绿萼
say("爹！妈没死，没死啊。你快赔罪，请她原恕了吧！",333,0,"公孙绿萼")

--公孙止
say("请她原恕？我有什么不对了？",321,4,"公孙止")

--公孙绿萼
say("你将妈妈幽闭地底石窟之中，让她死不死、活不活的苦渡十多年时光。爹，你怎地对得住她？",333,0,"公孙绿萼")

--公孙止
say("是她先下手害我，你可知道？她将我推在情花丛中，叫我身受千针万刺之苦，你可知道？",321,4,"公孙止")

--公孙止
say("她将解药浸在砒霜液中，叫我服了也死，不服也死，你可知道？",321,4,"公孙止")

--公孙止
say("她还逼我手刃……手刃一个我心爱之人，你可知道？",321,4,"公孙止")

--公孙绿萼
say("女儿知道，那是……柔儿。",333,0,"公孙绿萼")

--公孙止
say("不错，是柔儿，是柔儿！就……就是这个狠心毒辣的贱人，逼得我杀了柔儿！",321,4,"公孙止")

--公孙止
say("Ｌ＜目露凶光＞Ｗ都一起给我受死吧！",321,4,"公孙止")

--战公孙止

if instruct_6(271,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end

light()

instruct_2(176,1)	--阴阳秘籍

--公孙止
say("Ｌ＜手捂左眼＞Ｗ我的眼睛，我的眼睛！",321,4,"公孙止")

--裘千尺
say("公孙止，我这枣核钉的滋味可还香甜？",332,0,"裘千尺")

--公孙止
say("哼……贼贱人别得意，我还会再回来的！",321,4,"公孙止")

--位置改变

dark()
null(-2,12)
null(-2,13)
addevent(-2, 1, 1, 4152, 1, 4360*2)
addevent(-2, 6, 1, 4152, 1, 4366*2)
light()

--主角
say("前辈，在下助你脱离地牢，打败公孙止，不知能否赐在下情花毒的解药绝情丹？",0,4)

--裘千尺
say("不错，我重见天日，也可说受你之赐。但我裘老太婆有仇必报，有恩却未必记在心上。",332,0,"裘千尺")

--畅想杨过
if JY.Base["畅想"] == 58 then
	--裘千尺
	say("这枚绝情丹，只会留给我的未来女婿。倘若你愿意娶我女儿，绝情丹就可以给你！",332,0,"裘千尺")

	--主角
	say("我与姑姑情投意合，前辈这岂不是强人所难？",0,4)

	--裘千尺
	say("绝情丹如今只剩下一颗。当今世上，除了我，没有人能救你的性命！",332,0,"裘千尺")

	--主角
	say("Ｌ＜这老太婆看来是不肯交出绝情丹了，我再去想其他的办法吧＞",0,4)

	--主角
	say("如此在下告辞了。",0,4)
else
	--裘千尺
	say("这枚绝情丹，只会留给我的未来女婿。倘若杨过愿意娶我女儿，绝情丹就可以给他！",332,0,"裘千尺")

	--主角
	say("杨兄弟和龙姑娘情投意合，前辈这岂不是强人所难？",0,4)

	--裘千尺
	say("绝情丹如今只剩下一颗。当今世上，除了我，没有人能救杨过的性命！",332,0,"裘千尺")

	--主角
	say("Ｌ＜这件事别人不能代他做主。还是先找到杨兄弟，看他本人的意思吧＞",0,4)

	--主角
	say("如此在下告辞了。",0,4)
end

null(-2,-2)
instruct_39(10) 	--打开场景蜘蛛洞
instruct_39(7)  	--打开场景独孤剑冢

instruct_25(29,8,31,19)  --场景移动

do return end
