if instruct_16(63) == false then  --是否在队伍
	Cls()  --清屏
	say("此段剧情需要程英在队才可触发。",0,2)
	Cls()  --清屏
	instruct_30(31, 19, 31, 20)
	do return end  --无条件结束事件
end
--畅想杨过
if JY.Base["畅想"] == 58 then
	dark()

	instruct_19(29,14)
	stands()
	--addevent(22, 21, 1, nil, nil, 4248*2)
	addevent(22, 22, 1, nil, nil, 4349*2)

	light()
	
	--小龙女
	say("裘老前辈，过儿命在顷刻，烦请前辈赐下绝情丹。",59,4)
else
	dark()

	instruct_19(29,12)
	stands()
	addevent(22, 21, 1, nil, nil, 4248*2)
	addevent(22, 22, 1, nil, nil, 4349*2)

	light()
	
	--主角
	say("裘老前辈，在下已将杨过带来了，烦请前辈赐下绝情丹。",0,5)
end

--裘千尺
say("如此说来，杨过你答应娶我女儿了？",332,0,"裘千尺")

--杨过
say("杨过今生今世只会娶姑姑一人，承蒙公孙姑娘错爱，杨过无以为报。",58,4)

--裘千尺
say("姓杨的，你当老婆子说的话是放屁吗？",332,0,"裘千尺")

--公孙绿萼
say("娘，你就把绝情丹交给杨大哥吧……否则……否则……",333,4,"公孙绿萼")

--公孙绿萼
say("Ｌ＜将匕首架在脖子上＞Ｗ娘，你再不答应，女儿当场死给你看！",333,4,"公孙绿萼")

--杨过
say("公孙姑娘，万万不可！",58,0)

--裘千尺
say("也罢，这就是绝情丹，你拿给他吧。",332,0,"裘千尺")

dark()
null(-2,6)
addevent(-2, 23, 1, nil, nil, 4366*2)
light()

--公孙绿萼
say("Ｌ＜送药之际，匕首被枣核钉打落＞Ｗ娘！",333,4,"公孙绿萼")

--裘千尺
say("你会明白娘的一片苦心的。",332,0,"裘千尺")

--裘千尺
say("来人，布渔网阵，将这些人统统拿下！",332,0,"裘千尺")

--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.Person[59]["攻击力"] = 190
	JY.Person[59]["防御力"] = 170
	JY.Person[59]["轻功"] = 220
	JY.Person[59]["血量翻倍"] = JY.Person[592]["血量翻倍"]
else
	--程英
	say(JY.Person[0]["外号"].."莫慌，我来帮你。",63,0)
end

--主角+程英战斗
if instruct_6(272,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end
light()

--主角
say("呼……总算拿到解药了。",0,5)

--裘千尺
say("哼，"..JY.Person[0]["外号2"].."别得意，你手上的那颗绝情丹是假的，哈哈哈……",332,0,"裘千尺")

dark()

addevent(-2, 13, 1, nil, nil, 4357*2)

light()

--公孙止
say("没错，那颗绝情丹是假的，不过倘若你不把真的交出来，你就再也见不到你女儿了。",321,5,"公孙止")

--公孙绿萼
say("爹爹……为什么？",333,4,"公孙绿萼")

--裘千尺
say("公孙老贼，你要绝情丹做甚？萼儿可也是你的女儿啊。",332,0,"裘千尺")

--公孙止
say("这个你就不必问了。你母女二人心向外人，一个叛夫，一个逆父，都不是好东西。",321,5,"公孙止")

--裘千尺
say("公孙老贼，算你狠。绝情丹这便给你。",332,0,"裘千尺")

--公孙止
say("算你识相。",321,5,"公孙止")

dark()
null(-2,13)
light()

--公孙绿萼
say("杨大哥，绝情丹被爹爹抢走了，你赶紧追啊！",333,4,"公孙绿萼")

--裘千尺
say("萼儿，赶紧推我出去，我一定要让公孙老贼知道我的厉害。",332,0,"裘千尺")

--畅想杨过
if JY.Base["畅想"] == 58 then
	dark()

	null(-2,1)
	null(-2,21)
	null(-2,22)
	null(-2,23)
	instruct_19(42,13)
	instruct_40(1)  --主角面向下
	addevent(-2, 25, 1, nil, nil, 3621*2)
	--addevent(-2, 26, 1, nil, nil, 3093*2)
	addevent(-2, 27, 1, nil, nil, 3622*2)
	addevent(-2, 24, 1, nil, nil, 4356*2)
	light()
else
	--主角
	say("我们也去看看。",0,5)

	dark()

	null(-2,1)
	null(-2,21)
	null(-2,22)
	null(-2,23)
	instruct_19(44,14)
	instruct_40(1)  --主角面向下
	addevent(-2, 25, 1, nil, nil, 3621*2)
	addevent(-2, 26, 1, nil, nil, 3093*2)
	addevent(-2, 27, 1, nil, nil, 3622*2)
	addevent(-2, 24, 1, nil, nil, 4356*2)
	light()
end

say("只见公孙止站在悬崖之上，只有一道宽不逾尺的石梁通向其站立之处。石梁和山崖都极为狭窄，勉强只够一人通过。",0,2)

--主角
say("公孙先生，绝情丹与你无用，你还是交出来吧。",0,5)

--公孙止
say("哼，你怎知对我无用？你多次与我为敌，受死吧！",321,5,"公孙止")

--双挑公孙止
--主角+程英战斗
if instruct_6(273,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end
light()

DrawStrBoxWaitKey("你得到了『绝情丹』", C_GOLD, 36,nil, C_RED)

--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.Person[59]["攻击力"] = 75
	JY.Person[59]["防御力"] = 55
	JY.Person[59]["轻功"] = 75
	JY.Person[59]["血量翻倍"] = 1
	--杨过
	say("龙儿，你觉得怎样？为什么脸色这样白？你运一口气试试。",58,0)

	--小龙女
	say("没什么，你快把丹药服了。",59,0)
else
	--主角
	say("杨兄，这药不假吧？",0,5)

	--杨过
	say("不假，多谢姑娘出手相助，只是杨某已不愿独生。",58,0)

	--杨过
	say("龙儿，你觉得怎样？为什么脸色这样白？你运一口气试试。",58,0)

	--小龙女
	say("没什么，你快把丹药服了。",59,0)

	--杨过
	say("Ｌ＜仔细看小龙女，见她额上黑气直逼眉心，眼见是没救了。＞Ｗ这枚丹药难救两人之命，要它何用？难道你死之后，我竟能独生么？",58,4)

	say("杨过说到此处，伤痛欲绝，左手一扬，将这世上仅此一枚能解他体内毒质的丹药，掷入了崖下万丈深谷之中。",0,2)

	--主角
	say("杨兄！",0,5)

	--程英
	say("杨大哥…………",63,0)
end

dark()

addevent(-2, 20, 1, nil, nil, 4361*2)

light()

--裘千尺
say("公孙老贼，他们放过你，我可不会放过你。我要你掉进鳄鱼潭中，永久不见天日！",332,0,"裘千尺")

--公孙止
say("啊……恶婆娘，随我一起下去吧！",321,5,"公孙止")

dark()

null(-2,20)
null(-2,24)
light()

--畅想杨过
if JY.Base["畅想"] == 58 then
	--小龙女
	say("过儿，你看那天边的晚霞多美，我们便在这里休息一晚吧。",59,0)

	--杨过
	say("好。",58,4)

	dark()
	null(-2,25)
	null(-2,26)
	null(-2,27)
	instruct_19(49,10)

	addevent(-2, 28, 1, nil, nil, 4364*2)
	addevent(-2, 29, 1, nil, nil, 3622*2)

	light()
else
	--主角
	say("Ｌ＜想不到这对生死冤家，最终竟然同穴而葬＞Ｗ",0,5)

	--小龙女
	say("今儿见了许多惨事，可是咱们自己的日子也不多了。",59,0)

	--小龙女
	say("过儿，你看那天边的晚霞多美，我们便在这里休息一晚吧。",59,0)

	--杨过
	say("好。",58,4)

	instruct_37(3); 

	dark()

	null(-2,25)
	null(-2,26)
	null(-2,27)
	addevent(-2, 33, 1, nil, nil, 4364*2)

	instruct_19(31,25)

	light()

	--公孙绿萼
	say(JY.Person[0]["外号"].."，绿萼有一事相告。",333,0,"公孙绿萼")

	--主角
	say("公孙姑娘请讲。",0,5)

	--公孙绿萼（“”内黄字）
	say("妈妈临走之前，曾告诉我在情花之旁，长有一种名叫“Ｇ断肠草Ｗ”的毒草，适量服食后或许可以以毒攻毒，解除那情花之毒。",333,0,"公孙绿萼")

	--主角
	say("那太好了，我们这就去找那“Ｇ断肠草Ｗ”，送给杨兄服食试试。",0,5)

	--公孙绿萼
	say("但此事妈妈也不确定，因为从未有人以身相试过。况且那“Ｇ断肠草Ｗ”毒性极是厉害，稍有不慎，可能情花之毒未解，倒是被断肠草毒死了。",333,0,"公孙绿萼")

	--主角
	say("服这毒自是甘冒大险，但反正杨兄已然无药可救，咱们死里求生，务当一试。",0,5)

	--公孙绿萼
	say("嗯，"..JY.Person[0]["外号"].."所言甚是。眼下还有一难事，就怕杨大哥无意求生，说什么也不肯尝试服用。",333,0,"公孙绿萼")

	--主角
	say("是啊，今日他就曾亲手把解药给毁了……这事确实棘手，哎……",0,5)

	--主角
	say("对了，程姑娘颇有智计，杨兄弟又对她素来信任，我去找她商量一下。",0,5)

	dark()

	null(-2,33)

	instruct_19(45,11)

	addevent(-2, 30, 1, nil, nil, 3093*2)
	addevent(-2, 28, 1, nil, nil, 4364*2)
	addevent(-2, 29, 1, nil, nil, 3622*2)

	light()
end

DrawStrBoxWaitKey("第二天清晨", C_GOLD, 36,nil, LimeGreen)


--杨过
say("龙儿，龙儿！你在哪里？",58,0)

--杨过
say("龙儿，龙儿！",58,0)

say("四下里山谷鸣响，传回来“龙儿，龙儿！”的呼声，但小龙女始终没有回答。",0,2)

--公孙绿萼
say("杨大哥，你看，这石碑上好像有字。",333,4,"公孙绿萼")

--畅想杨过
if JY.Base["畅想"] == 58 then
	dark()
	instruct_19(44,8)
	instruct_40(0)  --主角面向右
	--addevent(-2, 31, 1, nil, nil, 4248*2)
	light()
	
	--杨过
	say("Ｒ十六年后，在此相会，夫妻情深，勿失信约。ＨＤ小龙女嘱夫君杨郎，珍重万千，务求相聚。",58,0)

	--杨过
	say("她约我十六年后在此重会，那么她到哪里去了呢？她重伤未愈，一个人能去哪？",58,4)
else
	dark()
	null(-2,30)
	instruct_40(0)  --主角面向右
	addevent(-2, 31, 1, nil, nil, 4248*2)
	light()
	--杨过
	say("Ｒ十六年后，在此相会，夫妻情深，勿失信约。ＨＤ小龙女嘱夫君杨郎，珍重万千，务求相聚。",58,0)

	--杨过
	say("她约我十六年后在此重会，那么她到哪里去了呢？她身中剧毒，难以愈合，十天半月都未必挨得到，怎能有十六年之约？",58,4)

	--杨过
	say("她明明知道我已将绝情丹摔去，又怎能期我于十六年之后？",58,4)
end

--程英
say("杨大哥，大喜，大喜啊！",63,0)

--畅想杨过
if JY.Base["畅想"] == 58 then
	instruct_40(3)  --主角面向左
else
	addevent(-2, 31, 1, nil, nil, 3094*2)
end

--杨过
say("程姑娘，你说……说是喜讯么？",58,4)

--程英
say("杨大嫂应是遇到了南海神尼，当真旷世奇缘。",63,0)

--杨过
say("南海神尼，那是谁？",58,4)

--程英
say("南海神尼是佛门中的大圣，佛法与武功上的修为都深不可测。只因她足迹罕履中土，是以中原武林人士极少有人知她老人家的大名。",63,0)

--程英
say("我师父当年曾见过她一面，承蒙授以一套掌法，一生受用无穷，嗯，那是十六、三十二，不错，是三十二年之前的事了。",63,0)

--杨过
say("三十二年？",58,4)

--程英
say("是啊，这位神尼只怕已近百岁高龄。我师父说，每隔十六年，她老人家便来中土一行，恶人撞到了她那是前世不修。好人遇到了，她老人家必有慈悲。",63,0)

--程英
say("杨大嫂这等美艳如仙的人物，她老人家一定十分喜欢，将她收作徒儿，带到南海去了。",63,0)

--杨过
say("那我便到南海去找她，但不知神尼她老人家住在何处？",58,4)

--程英
say("你千万莫作此想，南海神尼所住的大智岛岂容外人涉足？而男子一登此岛，更立杀身之祸。",63,0)

--程英
say("杨大嫂既蒙神尼她老人家收留，相见有日，十六年弹指即过，又何必急在一时？",63,0)

--杨过
say("程姑娘，你……你不是故意在骗我吧？",58,4)

--程英
say("你再去瞧瞧石壁上的字迹，若非杨大嫂所书，我说的自然也未必是真。",63,0)

--杨过
say("那字迹没错。她写我这‘杨’字，右边那‘日’字下总是少写一画，这不是别人假冒的。",58,4)

--畅想杨过
if JY.Base["畅想"] == 58 then
	--程英
	say("大哥，你一定要好好保重，十六年后龙姑娘欣然归来，要是见不到你，只怕她也不肯再活了。",63,0)
	
	--杨过
	say("Ｌ＜是了，如果龙儿回来见不到我，她一定会很伤心＞",58,0)
	
	--杨过
	say("公孙姑娘，这次给你添了不少麻烦，十分抱歉。",58,0)
	
	--公孙绿萼
	say("杨大哥……没事的。",333,4,"公孙绿萼")
	
	dark()
	null(-2,-2)
	null(-2,28)
	null(-2,29)
	null(-2,31)
	--高升客栈剧情
	addevent(61, 34, 0, 4155, 3, 0)
	addevent(61, 35, 0, 4155, 3, 0)
	light()
else
	--程英
	say("那便好了。不瞒你说，我也觉得此事太过凑巧，一直还疑心是"..JY.Person[0]["外号"].."暗中布置了来让你宽心的呢。",63,0)

	--主角
	say("Ｌ＜程姑娘果然是人才啊，连我都快要信以为真了＞Ｗ",0,5)

	--主角
	say("杨兄，只可惜现在没有绝情丹了……唉，十六年后龙姑娘欣然归来，要是见不到你，只怕她也不肯再活了。",0,5)

	--杨过
	say("杨某行事鲁莽，此刻悔之晚矣。",58,0)

	--主角
	say("常听人说，毒蛇出没之处，七步内必有解救蛇毒之药，其他毒物，无不如此。说不定可以找到克制情花剧毒之物。",0,5)

	--杨过
	say("哎，此事谈何容易？实属渺茫。",58,0)

	--主角
	say("Ｌ＜该想办法让他振作起来＞Ｗ杨兄，你与神雕睽别已久，何不前去一访？我们会在绝情谷内尝试寻找克制情花之物，若天佑有所收获，便去找你。",0,5)

	--杨过
	say("如此就有劳"..JY.Person[0]["外号"].."了。",58,0)

	--公孙绿萼
	say(JY.Person[0]["外号"].."，我对这里比较熟悉，我帮你找。",333,4,"公孙绿萼")
	
	--绿萼入队

	dark()
	null(-2,-2)
	null(-2,28)
	null(-2,29)
	null(-2,31)
	instruct_17(22,1,34,23,0);   --  17(11):修改场景贴图:场景[绝情谷]层1坐标34-23
	instruct_3(7,6,1,0,216,217,0,6190,6190,6190,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [16]
	light()
end

instruct_37(2); 

do return end
