--主角
stands()

Cls();
local size = 60
local x = CC.ScreenW/2;
local y = CC.ScreenH/2;
local offx = (#"神雕线·十六年后")*size/4
local offy = size/2

lib.Background(0,y-50,CC.ScreenW,y+50,98)
DrawString(x-offx,y-offy,"神雕线·十六年后",M_DeepSkyBlue,size);  --静夜思
ShowScreen();
lib.Delay(1500);

dark()

addevent(-2, 39, 1, nil, nil, 4653*2)

light()

--路人甲
say("这天气真是折磨人，一会儿解冻，一会儿结冰，老天爷可真不给人好日子过。",190,0,"路人甲")

--路人乙
say("你别怨天怨地啦，咱们在这儿有个热火儿烤，有口安稳饭吃，还争什么？你只要在我们襄阳围城中住过，天下再苦的地方都变成安乐窝。",195,4,"路人乙")

--路人丙
say("请问老兄，那襄阳围城之中，却是怎生光景？",196,0,"路人丙")

--路人乙
say("蒙古鞑子的残暴，各位早已知闻，那也不用多说了。那一年蒙古十多万大军猛攻襄阳，襄阳城中数十万军民也是人人竭力守城，没一个畏缩退后的。像小人只是推车的小商贩，也搬土运石，出了一身力气来帮助守城。我脸上这老大的箭疤，便是给蒙古鞑子射的。",195,4,"路人乙")

--路人丙
say("这十多年来，若不是襄阳坚守不屈，咱们大宋半壁江山，只怕早不在了。",196,0,"路人丙")

--路人丁
say("其实守城的好官各地都有，只是朝廷忠奸不分，往往奸臣享尽荣华富贵，忠臣却含冤而死。",203,0,"路人丁")

--路人丁
say("前朝的岳爷爷不必说了，比如我们四川，从朝廷就屈杀了好几位守卫国土的大忠臣。",203,0,"路人丁")

--路人乙
say("那是谁啊？倒要请教。",195,4,"路人乙")

--路人丁
say("蒙古鞑子攻打四川十多年，全赖余大帅受御，全川百姓都当他万家生佛一般。那知皇上听信了奸臣丁大全的话，说余大帅什么擅权，又是什么跋扈，赐下药酒，逼得他自杀了，换了一个懦弱无能的奸党来做元帅。后来鞑子一攻，川北当场便受不住。阵前兵将是余大帅旧部，大家一样拼命死战。但那元帅只会奉承上司，一到打仗，调兵遣将什么都不在行，自然抵挡不住了。丁大全、陈大方这伙奸党庇护那狗屁元帅，反冤枉力战不屈的王惟忠将军通敌，竟将他全家逮京，把王将军斩首了。",203,0,"路人丁")

--路人丙
say("国家大事，便坏在这些奸臣手里。听说朝中三犬，这奸臣丁大全便是其中之一了。",196,0,"路人丙")

--路人甲
say("不错，朝中奸臣以丁大全、陈大方、胡大昌三人居首。临安人给他们名字那个‘大’字之旁都加上一点，称之为丁犬全、陈犬方、胡犬昌。",190,0,"路人甲")

--众人听到这里都笑了起来。
say("众人听到这里都笑了起来。",0,2)

--路人丁
say("听兄弟口音，是京都临安人氏了？",203,4,"路人丁")

--路人甲
say("正是。王将军是陈大方一手谋害的。王将军被绑赴刑场之时，再长街上高声大叫，说死后绝向玉皇大帝诉冤。",190,0,"路人甲")

--路人甲
say("王将军死后第三天，那陈大方在家中暴毙，他的首级却高悬在临安东门的钟鼓楼檐角之上，在一根长杆上高高挑着。",190,0,"路人甲")

--路人甲
say("这地方猿猴也爬不上去，别说是人了，若不是玉皇大帝派的天神天将，却是谁干的呢？",190,0,"路人甲")

--路人甲
say("此事临安无人不晓，却非我生安白造的。各位若到临安去，一问便知。",190,0,"路人甲")

--路人丁
say("这位兄弟的话的确不错。只不过杀陈大方的，并不是天神天将，却是一位英雄豪杰。",203,4,"路人丁")

--路人甲
say("想那陈大发是朝中大官，家将亲兵，防卫何等周密，常人怎杀的了他？再说，要把这奸臣的首级高高挑在钟楼的檐角之上，除非是生了翅膀，才有这等本领。",190,0,"路人甲")

--路人丁
say("本领非凡的奇人侠士，世上毕竟还是有的。但小弟若不是亲眼目睹，可也真的难以相信。",203,4,"路人丁")

--路人甲
say("你亲眼见他把陈大方的首级挂上高杆？你怎会亲眼看见？",190,0,"路人甲")

--路人丁
say("王惟忠将军有个儿子，王将军被逮时他逃走在外，朝中奸臣要斩草除根，派下军马追拿，那王将军之子也是个军官，虽会武艺，却是寡不敌众，眼见要被追兵逮住，却来了一位救星，赤手空拳的将数十名军马打得落花流水。小王将军便将父子卫国力战、却被奸臣陷害之情说了。那位大侠连夜赶赴临安，想要搭救王将军，但终于迟了两日，王将军已经被害。那大侠一怒之下，当晚便去割了陈大方的首级。那钟楼檐角虽是猿猴所不能攀援，但那位大侠只轻轻一纵，就跳了上去。",203,4,"路人丁")

--路人丙
say("这位侠客是谁？怎生模样？",196,0,"路人丙")

--路人丁
say("我不知这位侠客的姓名，只是见他少了一条右臂，相貌……相貌也很奇特，他骑一匹马，牵一匹马，另外那匹马上带着一头模样稀奇古怪的大鸟……",203,4,"路人丁")

--路人乙  （‘’内黄字）
say("不错，这便是江湖上赫赫有名的‘Ｇ神雕大侠Ｗ’！",195,4,"路人乙")

--女酒客甲
say("你也是大侠，我也是大侠，哼，这大侠未免也太多了。",217,4,"女酒客甲")

--郭襄
say("这位英雄如此作为，那也当得起称一声‘大侠’了。",327,0,"郭襄")

--女酒客甲
say("你怎能知道得这般清楚？还不是道听途说？江湖上的传闻，十成中倒有九成靠不住。",217,4,"女酒客甲")

--路人丁
say("Ｌ＜沉吟半响，正色道＞Ｗ小人姓王，王惟忠王将军便是先父。小人的性命是神雕大侠所救。",203,0,"路人丁")

--路人丁
say("小人身为钦犯，朝廷颁下海捕文书，要小人颈上的脑袋。但既涉及救命恩人的名声，小人可不敢贪生怕死，隐瞒不说。",203,0,"路人丁")

--路人丙
say("Ｌ＜大拇指一翘＞Ｗ小王将军，你是个好汉子，有哪个不要脸的胆敢去官府出首告密，大伙儿给他个白刀子进，红刀子出。",196,4,"路人丙")

--郭襄
say("神雕大侠，神雕大侠……王叔叔，这位神雕大侠武功既然这等高强，又怎地会少了一条手臂？",327,0,"郭襄")

--路人丁
say("我连神雕大侠的姓名也问不到，他老人家的身世是更加不知了。",203,4,"路人丁")

--路人丁
say("只是听说他经常去海边呆呆的看着海潮，一连数天都是如此。",203,4,"路人丁")

--郭襄
say("王大叔，神雕侠望着大海干嘛？他是在等人吗？",327,0,"郭襄")

--路人丁
say("这个我可不知道了，这种事我是不敢问的。",203,4,"路人丁")

--郭襄
say("那神雕侠虽然急人之难，解人之困，说不定他自己却有一件为难的心事呢？他为什么要呆呆的望着海潮？",327,0,"郭襄")

--女酒客乙
say("小妇人有个表妹，有缘见过神雕侠，她也曾见神雕侠呆望大海，神色古怪，因而亲口问过他。",218,0,"女酒客乙")

--女酒客乙
say("神雕侠说道：“我的结发妻子在大海彼岸，日夜记挂，不能相见。”",218,0,"女酒客乙")

--郭襄
say("原来他有妻子的，不知道为什么会在大海彼岸。他本领这样高强，干么不渡海去找她啊？",327,4,"郭襄")

--女酒客乙
say("我表妹也这般问过他。他说道：‘大海茫茫，不知到何处方能相见。’",218,0,"女酒客乙")

--郭襄
say("Ｌ＜轻轻叹道＞Ｗ我料想这样的人物，必是生具至性至情，果然不错。",327,4,"郭襄")

--郭襄
say("你表妹一定很美吧？她心中暗暗的在喜欢神雕侠，是不是？",327,4,"郭襄")

--女酒客乙
say("我表妹的相貌，原也可算是个美人。神雕侠救了她母亲，杀了他父亲。我表妹是不是暗中喜欢神雕侠，旁人可没法知道，现下她嫁了一个忠厚老实的庄稼人。神雕侠给了她一大笔钱。日子过得挺不错呢。",218,0,"女酒客乙")

--郭襄
say("神雕侠救了她母亲，杀了他父亲，这事可真奇了。",327,4,"郭襄")

--郭襄
say("大嫂，把你表妹的事说给我听，好不好？",327,4,"郭襄")

--女酒客乙
say("好啊。我姑丈是河南人，那一年蒙古鞑子打到内黄，把我姑丈掳去当了奴隶。我姑母带了我表妹，沿路讨饭，从河南寻到山东，又从山东寻到山西，寻访我姑丈的下落。",218,0,"女酒客乙")

--郭襄
say("万里寻夫，那可真是难得之极了。",327,4,"郭襄")

--女酒客乙
say("嗯，我姑母和表妹足足寻了四年，皇天不负苦心人，终于在淮北寻到了姑丈，原来他是在一个蒙古千户手下为奴。那时姑丈刚给千户打折了一条左腿。我姑母自然万分心痛，为了救夫，只得做起那不要脸的勾当，将自己和女儿都卖入了勾栏……",218,0,"女酒客乙")

--女酒客乙
say("后来我姑母千辛万苦的熬了多年，终于凑足了银子救出姑丈，却落得一纸休书的下场，实在不想活了，便到树林中解下腰带上了吊。",218,0,"女酒客乙")

--女酒客乙
say("皇天有眼，那位神雕侠正好经过，救了他下来，问明原委，只听得他怒气冲天。当晚便跳进千户府中。",218,0,"女酒客乙")

--女酒客乙
say("只见那千户正在逼迫我表妹，我姑丈居然在旁劝我表妹依从，说道她在勾栏里这些年，又不是良家闺女，难道还想起什么贞节牌坊么？",218,0,"女酒客乙")

--女酒客乙
say("神雕侠一拳打死了我姑丈，抓起那千户投入淮河之中，把我表妹救了出来。他说我姑母卖身救夫，可比一般贞女节妇更加令人起敬。",218,0,"女酒客乙")

--女酒客乙
say("他又说生平最恨的便是负心薄幸之人、奴颜事敌之辈，我姑父两老齐犯，他下手可不能容情了。",218,0,"女酒客乙")

--郭襄
say("Ｌ＜倏然神往＞Ｗ你们许多人都见过神雕侠，我却没福见过。若能见他一面，能听他说几句话，我……我又可比什么都欢喜。",327,4,"郭襄")
	
--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("Ｌ＜这小姑娘天真烂漫，不知道她为何想要见我？＞Ｗ",0,5)
	
	dark()
	null(-2,34)
	null(-2,35)
	null(-2,39)
	addevent(112, 1, 1, nil, nil, 4672*2)
	addevent(112, 2, 1, nil, nil, 4672*2)
	addevent(112, 8, 1, nil, nil, 4672*2)
	addevent(112, 22, 1, nil, nil, 4652*2)
	for i = 19, 21 do
		addevent(112, i, 0, 4194, 3, 0)
	end
	--万兽山庄
	instruct_17(112,1,20,18,0)
	instruct_17(112,1,19,18,1024*2)
	instruct_17(112,1,21,18,1026*2)
	light()
else
	--主角
	say("Ｌ＜没想到杨兄已经闯下了一番威名，着实令人钦佩＞Ｗ",0,5)

	--主角
	say("Ｌ＜这小姑娘天真烂漫，不如我去问问她愿不愿意跟我同行＞Ｗ",0,5)

	--主角
	say("妹子，你要见神雕侠却也不难，今日我领你去见他就是。",0,0)

	--郭襄
	say("好啊，只是我跟神雕侠素不相识，贸然求见，未免冒昧，又不知他见是不见。",327,4,"郭襄")

	--主角
	say("放心吧，有我引荐，他一定肯见你。",0,0)

	--郭襄
	say("好啊！那我们快走吧。",327,4,"郭襄")

	dark()
	null(-2,34)
	null(-2,35)
	null(-2,39)
	--黑龙潭
	addevent(21, 14, 1, 4156, 1, 3094*2)
	--万兽山庄
	instruct_17(112,1,20,18,0)
	instruct_17(112,1,19,18,1024*2)
	instruct_17(112,1,21,18,1026*2)
	light()

	--郭襄入队
	say("郭襄随队行动。",0,2)
end
do return end