TalkEx(JY.Person[0]["外号2"].."，本事不错嘛，居然能进得了我的黑龙潭。", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("这有什么难的，不就是九宫格嘛！二四为肩，六八为足，左七右三，戴九履一，五居中央。", 0, 1)  --对话
Cls()  --清屏
TalkEx("这……我原以为是我独创之法，没想到早有歌诀传世，唉，看来我要到桃花岛救人，是没什么希望了。", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("到桃花岛救人？不知前辈要救什么人？", 0, 1)  --对话
Cls()  --清屏
TalkEx("就是老顽童周伯通，我听说他被黄药师囚禁在桃花岛。", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("你是说周老爷子啊，他已经离开桃花岛了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("此话当真，你能不能把他找来见我？", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("恕在下斗胆，敢问前辈是周老爷子的什么人？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这……", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("Ｌ＜咦？这老太太的脸怎么红了？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉，说来话长……我本是大理的刘贵妃……", 237, 0,"瑛姑")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("……就这样，我的孩子死了，而我也再没见过周伯通。", 237, 0,"瑛姑")  --对话
Cls()  --清屏
TalkEx("原来是这样啊，前辈请放心，晚辈一定想办法把周老爷子请过来。", 0, 1)  --对话
Cls()  --清屏
instruct_3(20, 4,1,0,4158,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,1,0,1048,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
