if instruct_16(58) == false then  --是否在队伍
	Cls()  --清屏
	say("此段剧情需要杨过在队才可触发。",0,2)
	Cls()  --清屏
	do return end  --无条件结束事件

end
--畅想杨过
if JY.Base["畅想"] == 58 then
	dark()
	addevent(-2, 17, 1, nil, nil, 4653*2)
	light()
end
stands()

--周伯通
say("来来来，和老顽童过两招。",64,0)


--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("前辈，我带你去见一个人。",327,5,"郭襄")

	--周伯通
	say("去见谁啊？",64,0)

	--主角
	say("我说出此人名字来，你可不许拂袖便走。",327,5,"郭襄")

	--周伯通
	say("世间我有两人不见，一位是段皇爷，一位是他的贵妃瑛姑。",64,0)

	--周伯通
	say("除了这二人之外，我老顽童谁都见得。",64,0)

	--主角
	say("Ｌ＜老顽童生性纯朴，人却不傻。刚开口就猜到我的来意，这事情难办了＞",327,5,"郭襄")
else	
	--主角
	say("前辈，我带你去见一个人。",0,5)

	--周伯通
	say("去见谁啊？",64,0)

	--主角
	say("我说出此人名字来，你可不许拂袖便走。",0,5)

	--周伯通
	say("世间我有两人不见，一位是段皇爷，一位是他的贵妃瑛姑。",64,0)

	--周伯通
	say("除了这二人之外，我老顽童谁都见得。",64,0)

	--主角
	say("Ｌ＜老顽童生性纯朴，人却不傻。刚开口就猜到我的来意，这事情难办了＞",0,5)
end

--杨过
say("Ｌ＜看来只有使个激将之计＞Ｗ原来你曾输在他们手里，武功不及，因此害怕见他们。",58,4)

--周伯通
say("不是，不是！老顽童行事卑鄙下流，对不起他二人，因此没脸和他们相见。",64,0)


--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("难道他二人大祸临头，命在旦夕，你也不肯伸手相救吗么？",327,5,"郭襄")
else
	--主角
	say("难道他二人大祸临头，命在旦夕，你也不肯伸手相救吗么？",0,5)
end

--周伯通
say("Ｌ＜不禁一怔，想了一想＞Ｗ你想骗我吗？段皇爷的武功出神入化，怎会有大祸临头？倘若真有厉害的对头，他打不过，我也打不过。",64,0)

--杨过
say("老实跟你说了吧！瑛姑思念你得紧，无论如何要你去跟她一会。",58,4)

--畅想杨过
if JY.Base["畅想"] == 58 then
	--周伯通
	say("杨兄弟，这位小姑娘，你们只要再提一句，就请立即出我百花谷去，休怪我老顽童翻脸不认人。",64,0)
else	
	--周伯通
	say("杨兄弟，这位"..JY.Person[0]["外号"].."，你们只要再提一句，就请立即出我百花谷去，休怪我老顽童翻脸不认人。",64,0)
end

--杨过
say("周老兄，你想逐我们出这百花谷，却也不那么容易。",58,4)

--周伯通
say("嘿嘿，难道你想跟我动手不成？",64,0)

--杨过
say("正要领教！若我输了，立即便出这百花谷去，永世不再上门。若你输了，可得随我们去见瑛姑。",58,4)

--周伯通
say("不对，不对！第一，我怎会输给你这小娃娃？第二，就算我输了，我也决不去见刘贵妃！",64,0)

--杨过
say("Ｌ＜怒道＞Ｗ你赢了自然可以不去见她，输了仍然不见，那么咱们还赌赛什么？",58,4)

--周伯通
say("不见就是不见，有什么好说的。看拳！",64,0)

--杨过血量翻倍
JY.Person[58]["血量翻倍"] = JY.Person[592]["血量翻倍"]

--杨过单挑周伯通
if instruct_6(274,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end

--杨过血量翻倍还原
JY.Person[58]["血量翻倍"] = 1

light()

--杨过
say("伯通老兄，佩服佩服，小弟甘拜下风。",58,4)

--杨过
say("周老前辈是请不动的了，咱们走吧！",58,4)

--周伯通
say("且慢。且慢！你说这套什么销魂掌共有一十七路，尚有十三路未施啊？怎么走了？",64,0)

--杨过
say("咱们无冤无仇，何必性命相搏？",58,4)

--杨过
say("你向来待我很好，又待我妻子很好，我一直心下感激。你武功高强，小弟心服口服，认输便是。",58,4)

--周伯通
say("不对，不对！你没输，我也没赢，你要出这百花谷，除非把一十七路掌法使全了。",64,0)

--杨过
say("咦，这可好笑了。我们既然请不动你，那便拍手便走，难道连请客的也得留下吗？",58,4)

--周伯通
say("那我想你磕八个响头，拜你为师，你总肯教我了吧？杨过师父，弟子周伯通磕头！",64,0)

--杨过
say("Ｌ＜忙抢上扶起＞Ｗ这哪里敢当？",58,4)

--畅想杨过
if JY.Base["畅想"] == 58 then
	--主角
	say("周老爷子，你到底你为什么不肯去见瑛姑？你和我们去，我帮你和杨大哥说说，让他教你这路掌法。",327,5,"郭襄")

	--周伯通
	say("唉，都是年轻时犯下的糊涂事。如此如此……这般这般……",64,0)

	--周伯通
	say("后来段皇爷甚至连皇帝也不做而去做和尚，可见我实在对不起他之极了。",64,0)

	--主角
	say("大灯大师之所以出家，是为了对你不起，不是你对他不起，难道你不知道么？",327,5,"郭襄")

	--周伯通
	say("他有什么对不起我的？",64,0)

	--主角
	say("只为旁人害你儿子，他狠心见死不救。",327,5,"郭襄")

	--周伯通
	say("什么我的儿子？",64,0)

	--主角
	say("你和瑛姑生的孩子啊！",327,5,"郭襄")

	--周伯通
	say("什么！我有儿子！．．．．．",64,0)

	--主角
	say("周老前辈，瑛姑如此这般思念你，你始终不肯和她相见，于心何忍？",327,5,"郭襄")

	--周伯通
	say("她在哪里？",64,0)

	--主角
	say("她现在居住在黑龙潭，在铁掌山南边。",327,5,"郭襄")
else	
	--主角
	say("周老爷子，你到底你为什么不肯去见瑛姑？你和我们去，我帮你和杨兄弟说说，让他教你这路掌法。",0,5)

	--周伯通
	say("唉，都是年轻时犯下的糊涂事。如此如此……这般这般……",64,0)

	--周伯通
	say("后来段皇爷甚至连皇帝也不做而去做和尚，可见我实在对不起他之极了。",64,0)

	--主角
	say("大灯大师之所以出家，是为了对你不起，不是你对他不起，难道你不知道么？",0,5)

	--周伯通
	say("他有什么对不起我的？",64,0)

	--主角
	say("只为旁人害你儿子，他狠心见死不救。",0,5)

	--周伯通
	say("什么我的儿子？",64,0)

	--主角
	say("你和瑛姑生的孩子啊！",0,5)

	--周伯通
	say("什么！我有儿子！．．．．．",64,0)

	--主角
	say("周老前辈，瑛姑如此这般思念你，你始终不肯和她相见，于心何忍？",0,5)

	--周伯通
	say("她在哪里？",64,0)

	--主角
	say("她现在居住在黑龙潭，在铁掌山南边。",0,5)
end

instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(21, 11,1,0,1052,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮

--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.Person[0]["武功2"]=25
	JY.Person[0]["武功等级2"]=50
	JY.Person[0]["天赋外功2"]=25
	--主角
	say("咦，周老前辈呢？怎么一溜烟的就不见了，希望是去找瑛姑了。",327,5,"郭襄")

	--杨过
	say("妹子，此事已了。我和龙儿十六年之约的期限将近，我要去绝情谷找她了。",58,0)

	--主角
	say("大哥哥……Ｌ＜唉……愿龙姑娘吉人自有天相＞Ｗ我跟你一起去。",327,5,"郭襄")
	
	dark()
	--绝情谷剧情
	addevent(22, 36, 0, 4159, 3, 0)
	addevent(22, 37, 0, 4159, 3, 0)
	null(-2,17)
	light()
else
	--主角
	say("咦，老顽童呢？怎么一溜烟的就不见了，希望是去找瑛姑了。",0,5)

	--杨过
	if JY.Person[0]["性别"] == 0 then
		say("兄弟，此事已了。我和龙儿十六年之约的期限将近，我要去绝情谷找她了。",58,0)
	else
		say("妹子，此事已了。我和龙儿十六年之约的期限将近，我要去绝情谷找她了。",58,0)
	end

	--主角
	say("杨兄……Ｌ＜唉……愿龙姑娘吉人自有天相＞Ｗ在下自当一同前往。",0,5)

	--绝情谷剧情
	addevent(22, 36, 0, 4159, 3, 0)
	addevent(22, 37, 0, 4159, 3, 0)

	--杨过
	say("这本黯然销魂掌是我毕生武学之所凝聚，就送给你吧。",58,0)

	--主角
	say("多谢杨兄。",0,5)
end

--得到物品【黯然销魂掌】X 1
instruct_2(87,1)

instruct_37(3)  --增加品德
do return end
