if instruct_16(38) == false then  --是否在队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(61,19,1,0,0)  --修改场景事件
instruct_26(61,18,1,0,0)  --修改场景事件
if JY.Person[0]["性别"] == 0 then
	TalkEx("大哥，这没有什么好看的，我们走了好不好……", 38, 1)  --对话
else
	TalkEx("女侠，这没有什么好看的，我们走了好不好……", 38, 1)  --对话
end
Cls()  --清屏
TalkEx("贤弟，小声一点，别吵到两位岛主练功……", 0, 1)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这些字怎么如此古怪，看上一眼，便会头晕？至阳穴好热，原来这些蝌蚪看似乱钻乱游，其实还是和内息有关＞", 38, 1)  --对话
Cls()  --清屏
TalkEx("这位石兄弟双眼注目这“太玄经”，原来是位精通蝌蚪文的大方家。", 39, 0)  --对话
Cls()  --清屏
TalkEx("小人一个字也不识，只是瞧这些小蝌蚪十分好玩，便多看了一会。", 38, 1)  --对话
Cls()  --清屏
TalkEx("这就是了，这部“太玄经”以古蝌蚪文写成，我本来正自奇怪，石兄弟年纪轻轻，居然有此奇才，识得这种古奥文字。", 40, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜我还是别打扰二位岛主好了……可是这蝌蚪还真好玩……咦！这些蝌蚪怎么在我身体各处跑了起来…………怎么这样地舒畅……＞", 38, 1)  --对话
Cls()  --清屏
TalkEx("贤弟，你干什么？", 0, 1)  --对话
Cls()  --清屏
instruct_35(38,1,102,50)  --学会武功
instruct_46(38,3000)  --增加内力最大值
instruct_47(38,50)  --增加攻击力
instruct_45(38,50)  --增加轻功
SetTianNei(38,102)	--石破天天内洗太玄
--石头单挑二岛主，不可败
if WarMain(257, 1) == false then
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
light()
TalkEx("啊！好累，我怎么觉得好累。", 38, 1)  --对话
Cls()  --清屏
TalkEx("贤弟，你总算清醒过来了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("怎么，难道我昏迷过去了吗？", 38, 1)  --对话
Cls()  --清屏
TalkEx("是啊！原先我以为你又着魔了，后来龙岛主说你正悟出神功，我才没有去吵你，前后算起来已有三天了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("是吗？已经三天了，难怪我觉得好饿。", 38, 1)  --对话
Cls()  --清屏
TalkEx("石兄弟，我兄弟俩闷在心中数十年的大疑团，终于得以解开，真是太感激你了。", 39, 0)  --对话
Cls()  --清屏
TalkEx("我怎么……怎么解破的?", 38, 1)  --对话
Cls()  --清屏
TalkEx("石兄弟何必如此谦虚？你参透了这首“侠客行”的石壁图谱，不但是现今武林中的第一人，除了当年在石壁上雕写图谱的那位前辈之外，只怕古往今来，也极少有人及得上你。", 39, 0)  --对话
Cls()  --清屏
TalkEx("小人不敢，小人不敢。", 38, 1)  --对话
Cls()  --清屏
TalkEx("这石壁上的蝌蚪古文，在下与木兄弟所识还不到一成，不知石兄弟肯赐予指教么？", 39, 0)  --对话
Cls()  --清屏
TalkEx("我跟两位说了便是，我看这条蝌蚪，“中注穴”中便有跳动，再看这条蝌蚪，“太赫穴”便大跳一下…………", 38, 1)  --对话
Cls()  --清屏
TalkEx("原来……原来……石帮主看的是一条条……那个蝌蚪，不是看一个个字……那么石帮主如何能通解全篇“太玄经”？", 40, 0)  --对话
Cls()  --清屏
TalkEx("小人自幼没读过书，当真一字不识，惭愧的紧。", 38, 1)  --对话
Cls()  --清屏
TalkEx("你不识字？", 40, 0)  --对话
Cls()  --清屏
TalkEx("不识字，我……回去之后，定要去学识字，否则人人都识字，我却不识得，给人笑话，多不好意思。", 38, 1)  --对话
Cls()  --清屏
TalkEx("你既不识字，那么这些壁上许许多多的注释，却是谁解给你听的？", 39, 0)  --对话
Cls()  --清屏
TalkEx("没人解给我听，我……只是瞧着图形，胡思乱想，忽然之间，图上的云头或小剑什么的，就和身体内的热气连在一起了。", 38, 1)  --对话
Cls()  --清屏
TalkEx("你不识字，却能解通图谱，这……如何能够？", 40, 0)  --对话
Cls()  --清屏
TalkEx("难道冥冥之中真有天意？还是这位石兄弟真有天纵英才。", 39, 0)  --对话
Cls()  --清屏
TalkEx("…………我懂了，我懂了。大哥，原来如此。", 40, 0)  --对话
Cls()  --清屏
TalkEx("啊！是了，是了，石兄弟，幸亏你不识字，才得解破这个大疑团。唉！原来这许许多多注释文字，每一句都在导人误入歧途。可是参研图谱之人，又有那个肯不去钻研注解。", 39, 0)  --对话
Cls()  --清屏
TalkEx("原来这篇“太玄经”也不是真的蝌蚪文，只不过……只不过是一些经脉穴道的线路方位而已。唉，三十年的光阴，三十年的光阴！", 39, 0)  --对话
Cls()  --清屏
TalkEx("白首太玄经！兄弟，你的头发也真是雪白了。", 40, 0)  --对话
Cls()  --清屏
TalkEx("此岛名为侠客岛，是因为我们兄弟二人在此间还发现了另一部奇书，叫《侠客行》。我二人发下誓愿，谁能解得了这壁上图谱，便奖此书曾与谁。如今图谱已解，这本书就赠与石帮主吧。", 39, 0)  --对话
Cls()  --清屏
TalkEx("我不识字，这本书要来也没有用。这位大哥好像正在找这本书吧，那我就把这本书送给大哥好了。", 38, 0)  --对话
Cls()  --清屏
instruct_2(154, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("多谢石兄弟，多谢二位岛主。", 0, 1)  --对话
Cls()  --清屏
--[[
TalkEx("兄弟，你我心愿已了，我们也该歇息了。这腊八粥之约以后也不必了。我们这就去告诉各位掌门不用再钻研此图解了。公子，你们也可赶紧离去。", 39, 0)  --对话
Cls()  --清屏
TalkEx("前辈，告辞了。", 0, 1)  --对话
Cls()  --清屏]]
if JY.Person[0]["性别"] == 0 then
	TalkEx("大哥，这太玄神功奥妙无穷，我想在岛上再钻研一段时间。", 38, 0)  --对话
else
	TalkEx("女侠，这太玄神功奥妙无穷，我想在岛上再钻研一段时间。", 38, 0)  --对话
end
Cls()  --清屏
TalkEx("好的，石兄弟，那你多保重。", 0, 1)  --对话
instruct_21(38)
Cls()  --清屏
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,419,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,419,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,419,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,418,0,0,5136,5136,5136,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,417,0,0,5132,5132,5132,-2,-2,-2)  --修改场景事件
addevent(-2,19,1,4255,1,5152)
Cls()  --清屏
instruct_13()  --场景变亮
do return end
