instruct_41(59,280,1)  --增加人物携带物品
instruct_41(59,282,1)  --增加人物携带物品

--畅想杨过
if JY.Base["畅想"] == 58 then
	instruct_30(38,46,46,46)
	instruct_30(46,46,46,40)
	stands()
	
	say("……倘若在这茅屋中仍是探问不到龙儿的消息，那可如何是好？",0,0)

	instruct_30(46,40,50,40)
	instruct_30(50,40,50,33)
	stands()
	
	say("Ｌ＜语音微颤＞Ｗ４杨某冒昧拜谒，请予赐……赐见。",0,0)
	
	dark()
	light()
	
	say("杨过但见室右有榻，是幼时练功的寒玉床；室中凌空拉着一条长绳，是练轻功时睡卧所用；窗前小小一几，是读数写字之处。",0,2)
	say("室左立着一个粗糙木橱，拉开橱门，只见橱中放着几件树皮结成的儿童衣衫，正是从前在古墓时小龙女为自己所缝制的模样。",0,2)
	say("自进室中，抚摸床几，早已泪珠盈眶，这时再也忍耐不住，眼泪扑簌簌的滚下衣衫。",0,2)
	
	dark()
	
	addevent(113, 18, 1, nil, nil, 3034*2)
	light()
	
	say("过儿，什么事不痛快了？",59,0)
	
	say("只见身前盈盈站着一个白衫女子，雪肤依然，花貌如昨，正是十六年来他日思夜想、魂牵梦萦的小龙女。",0,2)
	
	say("龙儿，你容貌一点也没有变，我却老了。",0,5)
	
	say("不是老了，而是我的过儿长大了。",59,0)
	
	say("龙儿，也真难为你在这里挨了一十六年。",0,5)
	
	say("倘若我不是从小在古墓中长大，这一十六年定然挨不下来。",59,0)
	
	say("两人并肩坐在石上互诉别来情事。杨过不住口的问这问那。小龙女慢慢将这一十六年中的变故说了出来。",0,2)
	
	say("龙儿，咱俩便在这谷底终老呢，还是设法回去那花花世界？",0,5)
		
	say("咱们想法子上去瞧瞧罢，倘若上面不好，可再回来，或许回古墓去住。只是……只是，要上去却难得紧呢。",59,0)
	
	dark()
	null(-2,-2)
	null(-2,18)
	null(22,36)
	null(22,37)
	addevent(113, 8, 0, 4196, 3, 0)
	addevent(22, 41, 0, 4168, 3, 0)	--绝情谷事件
	light()
	
	--小龙女入队
	if instruct_20() == false then
		instruct_10(59)
		Cls()  --清屏
		do return end  --无条件结束事件
	end
	instruct_3(70, 20,1,0,153,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
	do return end
else
	instruct_30(38,46,46,46)
	instruct_30(46,46,46,43)
	stands()
	--主角
	say("杨兄！龙姑娘！你们没事！",0,5)

	--杨过
	say(JY.Person[0]["外号"].."，你怎么也下来了？",58,0)

	--主角
	say("是这样的……",0,5)

	--杨过
	say("如此说来，郭二姑娘还在上面等着了。",58,0)

	--主角
	say("是的，她很担心你们。",0,5)

	--小龙女
	say("既然如此，过儿，我们就随"..JY.Person[0]["外号"].."一起上去看看吧。",59,0)

	dark()
	null(-2,-2)
	null(-2,10)
	null(-2,11)
	null(22,36)
	null(22,37)
	null(22,40)
	instruct_3(113, 6,0,0,0,0,4168,-2,-2,-2,-2,-2,-2)  --修改场景事件
	light()


	--杨过小龙女入队
	if More_than_2_vacant_slot() then
		instruct_10(58)
		instruct_10(59)
		Cls()  --清屏
		do return end  --无条件结束事件
	end
	instruct_3(70, 19,1,0,151,0,0,6188,6188,6188,-2,-2,-2)  --修改场景事件
	instruct_3(70, 20,1,0,153,0,0,6068,6068,6068,-2,-2,-2)  --修改场景事件
	do return end
end
do return end