if instruct_16(58) == false then  --是否在队伍
	Cls()  --清屏
	say("此段剧情需要杨过在队才可触发。",0,2)
	Cls()  --清屏
	instruct_30(JY.Base["人X1"],JY.Base["人Y1"],JY.Base["人X1"],35)
	do return end  --无条件结束事件
end

dark()

instruct_19(31,34)
stands()

light()

instruct_25(31,34,31,27)

--金轮法王
say("小郭襄你听着，不仅仅是襄阳，整个大宋，很快都将是我大蒙古国的疆土！",62,0)

--金轮法王
say("快叫你父投降，我从一数到十，你父亲不降，我便下令举火了！",62,0)

--郭襄
say("你爱数便数，别说从一数到十，你且数到一千、一万试试。",327,4,"郭襄")

--金轮法王
say("你道我当真不敢烧死你吗？",62,0)

--郭襄
say("我只觉得你挺可怜的。",327,4,"郭襄")

--金轮法王
say("我可怜什么？",62,0)

--郭襄
say("你打不过我大哥哥杨过，打不过杨大嫂小龙女，只有本事把我绑在这里。我襄阳城中，便是一个帐前小卒，也不至于似你这般卑鄙无耻。",327,4,"郭襄")

--金轮法王
say("哼，我打不过杨过？杨过这小子倘若在此，管教他尝尝我第十层‘龙象般若功’的厉害，定要他吃饱了苦头，跪地求饶才罢！",62,0)

--郭襄
say("你明知我大哥哥不在这儿，自可胡吹大气。你有胆子去找他较量一下么？",327,4,"郭襄")

--金轮法王
say("就可惜不知这小子躲到了何处，否则我不找上门去，打得他满地找牙、磕头求饶才怪！",62,0)

--郭襄  （蓝字 分两行显示，每行两句）
say("Ｄ和尚和尚爱吹牛，自夸天下无敌手。Ｈ看见杨过东边来，脚底抹油朝西走。",327,4,"郭襄")

--金轮法王
say("Ｌ＜怒极反笑＞Ｗ杨过，你听着！我从一数到十，‘十’字出口，倘若你再不出来，这小女娃便要烧成焦炭！",62,0)

--金轮法王 （蓝字 缓出）
say("Ｄ４一………二………三………四………",62,0)

instruct_25(31,27,31,34)

instruct_30(31,34,31,30)

--主角
say("金轮法王，你欺辱弱女，算什么英雄好汉！",0,5)

addevent(-2, 13, 1, nil, nil, 4005*2)
addevent(-2, 14, 1, nil, nil, 4653*2)

--畅想杨过
if JY.Base["畅想"] == 58 then
	--金轮法王
	say("哈哈，杨过，小龙女，你们终于来了！",62,0)
else
	--金轮法王
	say("哈哈，"..JY.Person[0]["姓名"].."，杨过，你们终于来了！",62,0)
end

--杨过
say("小妹子莫慌，我来救你！",58,4)

--杨过血量翻倍
JY.Person[58]["血量翻倍"] = JY.Person[592]["血量翻倍"]

--杨过单挑金轮
if instruct_6(275,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end
null(-2,13)

--杨过血量翻倍还原
JY.Person[58]["血量翻倍"] = 1

for i = 15, 22 do
	null(-2,i)
end
stands()

light()

instruct_2(81,1)	--龙象

say("眼见蒙古大汗的九旌大纛渐渐逼近城垣，城内的守军似乎军心已乱，无力反击。",0,2)

--郭襄
say("大哥哥，怎么是好，怎么是好？",327,4,"郭襄")

--杨过
say("Ｌ＜如今情势危急，唯有擒贼先擒王＞Ｗ",58,4)

say("杨过奔马而前，便如摧枯拉朽般破坚直入，一口气冲到了大汗的马前。",0,2)

say("蒙古大汗见势头不好，一提马缰，纵骑急驰。",0,2)

say("杨过提气急追，哪知大汗的坐骑“飞云骓”非同小可，一时之间距离竟越拉越远。",0,2)

say("杨过心念一动，拾起两旁枚石子，运功掷了出去，正是“弹指神通”的绝技。",0,2)

dark()

null(-2,14)

--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.MyPic = 5029*2
end

addevent(-2, 46, 1, nil, nil, 4670*2)

light()

addevent(-2, 46, 1, nil, nil, 4671*2)

light()

say("飞石正中蒙哥后心。这一掷劲力何等刚猛，蒙哥筋折骨断，倒撞下马，登时毙命。",0,2)

dark()

null(-2,0)

light()

say("不好，大汗落马了！快撤退！",0,2)

say("城内守军乘势杀出，蒙古军军心已乱，自相践踏，死者不计其数，一路上抛旗投枪，溃不成军，纷纷向北奔逃。",0,2)

dark()

for i = 23, 45 do
	null(-2,i)
end

null(-2,46)

--畅想杨过
if JY.Base["畅想"] == 58 then
	JY.MyPic = GetMyPic()
end

light()

--得到物品【神雕侠侣】X 1
instruct_2(153,1)

--主角
say("今日解了襄阳之围，我也收获了神雕的天书，可谓一举两得。",0,5)

instruct_37(5)  --增加品德

do return end