instruct_40(0)  --主角面向右
stands()

--主角
say("那边有人，过去看看。",0,5)

instruct_30(30,53,30,45); 
instruct_30(30,45,26,45); 

say("李道友，这情花之毒的解药配置方法，天下除我之外再无第二人知晓。",321,0,"公孙止") 	
instruct_0();
say("只要你依了我，这绝情谷里面的东西，便什么都是你的了。",321,0,"公孙止") 	
instruct_0();
say("李莫愁心地狠毒，用情却是极专，她一生恶孽，便是因情之一字而来，听公孙止言语越来越不庄重，心下恼火。",0,2)
instruct_0();
say("公孙谷主，你上回逼迫人家师妹跟你成亲不成，现在又来哄骗师姐？",0,5)

addevent(22, 45, 1, nil, nil, 4355*2)

say("又是你这"..JY.Person[0]["外号2"].."多管闲事！受死吧！",321,0,"公孙止")

--主角单挑公孙止
if instruct_6(276,4,0,0) ==false then
    instruct_15(0);   --  15(F):战斗失败，死亡
    instruct_0();   --  0(0)::空语句(清屏)
    do return; end
end

null(-2,45)
stands()
light()

instruct_2(243,1)

--主角
say("李姑娘，你一生恶孽，皆是因情之一字而来，如今身中情花之毒，也算是因果报应了。",0,5)

say("哼！你待怎样？",161,0) 

say("当年那个美貌温柔的好女子，如今却成了人人痛恨的赤炼魔头。你可曾有后悔过？",0,5)

say("要杀就杀，别废话那么多。",161,0) 

say("杀你干嘛？我正在寻找十四天书，其中一本《神雕侠侣》正好在你师侄杨过手上，听闻李姑娘为了贵派的“Ｇ玉女心经Ｗ”，也与杨过小龙女有些许过节。",0,5)

say("既然大家目的一致，不如合作。若李姑娘同意了，在下可以帮你设法夺取那绝情丹。",0,5)

say("若是不同意呢？",161,0) 

say("姑娘已经身中剧毒，眼下选择的余地恐怕不多吧？",0,5)

say("哼！就信你一次……不过绝情丹所在位置极其隐秘，你就算把这绝情谷掀个底朝天也未必能找得到。",161,0) 

say("办法总是会有的，那边有人来了，我们先回避一下。",0,5)

dark()

null(-2,44)
addevent(22, 49, 1, nil, nil, 4203*2)
instruct_19(18,46)
instruct_40(1)  --主角面向下
addevent(22, 46, 1, nil, nil, 4248*2)
addevent(22, 47, 1, nil, nil, 4349*2)

light()

instruct_25(18,46,29,46); 

--小龙女
say("过儿，如果他们不给绝情丹，我们就硬抢。",59,0)

say("龙儿……",58,4)

dark()
null(-2,46)
null(-2,47)
light()

instruct_25(29,46,18,46); 

say("天助我也，杨过和小龙女也要抢绝情丹，我们先悄悄跟过去，再伺机出手。",0,5)

dark()
null(-2,-2)
null(-2,49)
addevent(22, 21, 1, nil, nil, 4248*2)
addevent(22, 22, 1, nil, nil, 4349*2)
addevent(22, 0, 0, 4172, 3, 0)
light()

if instruct_20() == false then  --判断队伍是否已满
	instruct_10(161)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 161, 0)  --对话
Cls()  --清屏
instruct_3(70, 99,1,0,4185,0,0,4204*2,4204*2,4204*2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
do return end  --无条件结束事件