instruct_30(30,32,30,31); 
instruct_30(30,31,27,31); 
instruct_30(27,31,27,20); 
instruct_30(27,20,28,20); 
stands()

instruct_25(28,20,29,12); 

--小龙女
say("裘老前辈，过儿命在顷刻，烦请前辈赐下绝情丹。",59,4)

--裘千尺
say("如此说来，杨过你答应娶我女儿了？",332,0,"裘千尺")

--杨过
say("杨过今生今世只会娶姑姑一人，承蒙公孙姑娘错爱，杨过无以为报。",58,4)

--裘千尺
say("姓杨的，你当老婆子说的话是放屁吗？",332,0,"裘千尺")

--公孙绿萼
say("娘，你就把绝情丹交给杨大哥吧……否则……否则……",333,4,"公孙绿萼")

--公孙绿萼
say("Ｌ＜将匕首架在脖子上＞Ｗ娘，你再不答应，女儿当场死给你看！",333,4,"公孙绿萼")

--杨过
say("公孙姑娘，万万不可！",58,0)

--裘千尺
say("也罢，这就是绝情丹，你拿给他吧。",332,0,"裘千尺")

dark()
null(-2,6)
addevent(-2, 23, 1, nil, nil, 4366*2)
light()

--公孙绿萼
say("Ｌ＜送药之际，匕首被枣核钉打落＞Ｗ娘！",333,4,"公孙绿萼")

--裘千尺
say("你会明白娘的一片苦心的。",332,0,"裘千尺")

say("好机会，我们上。",0,5)

dark()

instruct_19(31,19)
instruct_40(0)  --主角面向右

addevent(22, 21, 1, nil, nil, 3094*2)
addevent(22, 22, 1, nil, nil, 3034*2)

light()

say("在座的各位都不要怕，把绝情丹交出来，我保证各位平安无事。",0,5)

say("又是你！",58,4)

--战斗，群殴杨龙
if instruct_6(75,4,0,0) == false then    --  6(6):战斗[75]是则跳转到:Label1
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
end
light()

DrawStrBoxWaitKey("你得到了『绝情丹』", C_GOLD, 36,nil, C_RED)

say("愁妹，你快服下这绝情丹。",0,5)

say("谁是愁妹，别胡说八道。",161,0)

say("师姐，你……",59,0)

say("龙儿，算了，一颗绝情丹也救不了你我二人性命，给他们又何妨？",58,4)

say("哼，你倒是爽快，既然如此，把那天书也一并交出来吧！",0,5)

--杨过 （红字 缓出）
say("Ｒ３啊…………啊…………",58,4)

dark()
null(-2,21)
null(-2,22)
null(-2,23)
addevent(-2, 1, 1, 4173, 1, 4360*2)
addevent(-2, 6, 1, 4173, 1, 4366*2)
addevent(-2, 38, 1, 4174, 1, -2)
instruct_19(13,52)
light()

instruct_27(-1,6014,6024)  --显示人物动画

--主角 （狮子吼 红字）
say("这狮子吼震得耳朵好疼……没想到杨过内功已练得如此霸道深厚……",0,5)

--[提示]在绝情谷里找找看还有什么线索。
say("Ｄ〔剧情提示〕Ｗ在绝情谷里找找看还有什么线索",0,2)

--你的道德指数下降了5点
instruct_37(-5)

null(-2,-2)

do return end