instruct_30(38,46,46,46)
instruct_30(46,46,46,43)
stands()

--郭襄
say("大哥哥，太好了，你终于和你的夫人重聚了！呜呜……我真为你开心……",327,0,"郭襄")

--主角
say("杨过，我就知道你没死！",0,5)

--杨过
say("多年来，你一直在找寻杨某的下落，可是为了那本《神雕侠侣》？",58,0)

--主角
say("说实话，我也不想，但是人在江湖，身岂由己？我有必须拿到天书的理由。",0,5)

--杨过
say("呵呵，那你恐怕要失望了，这《神雕侠侣》一书，并不在我身上。",58,0)

--主角
say("什么？你没有书？那你为什么不早说？",0,5)

--杨过
say("当年在重阳宫，你听信了金轮法王的一面之词，就对我和龙儿刀剑相向。当时龙儿身受重伤，我心中悲愤，哪有心情跟你解释那么多？",58,0)

--主角
say("你这个人真是……",0,5)

--杨过
say("不过多年来走南闯北，我也听闻了一些关于天书的消息。据我所知，这本书应该是在当今Ｏ蒙古大汗Ｗ蒙哥手中。",58,0)

--主角
say("什么？蒙古大汗？",0,5)

--杨过
say("我言尽于此。",58,0)

--郭襄
say("大哥哥，你要走了么……",327,0,"郭襄")

--杨过
say("对了，还有一件事。",58,0)

--主角
say("洗耳恭听。",0,5)

--杨过
say(JY.Person[0]["姓名"].."，这些年来，你虽一直与杨某为敌，但杨某相信你亦是行事磊落之辈。",58,0)

--杨过
say("这小姑娘乃是我一位忘年之交的外孙女，如今我和龙儿即将隐居，希望你能代为照顾。",58,0)

--主角
say("Ｌ＜哦？免费的萌妹子＞Ｗ区区小事，在下一定办到。",0,5)

--杨过
say("小妹子，以后你要照顾好自己……你的情义，杨过今生无以为报。",58,0)

--郭襄
say("大哥哥……",327,0,"郭襄")

--小龙女
say("小妹妹，再见。",59,0)

--郭襄
say("大哥哥，杨大嫂，你们多保重……",327,0,"郭襄")

dark()
null(-2,10)
null(-2,11)
--峨眉金顶事件
addevent(117, 3, 0, 4212, 3)
light()

--主角
say("襄儿，我们也走吧。",0,5)

if instruct_20() == false then  --判断队伍是否已满
	dark()
	null(-2,-2)
	null(-2,9)
	null(22,36)
	null(22,37)

	for i = 13, 22 do
		null(115,i)
	end

	for i = 41, 45 do
		addevent(115, i, 0, 4182, 3, 0)
	end

	instruct_39(115)  --打开场景

	light()
	instruct_10(626)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 327,0,"郭襄")
Cls()  --清屏
dark()
null(-2,-2)
null(-2,9)
null(22,36)
null(22,37)

for i = 13, 22 do
	null(115,i)
end

for i = 41, 45 do
	addevent(115, i, 0, 4182, 3, 0)
end

instruct_39(115)  --打开场景

light()
instruct_3(70, 100,1,0,4186,0,0,4653*2,4653*2,4653*2,-2,-2,-2)  --修改场景事件
Cls()  --清屏

--主角
say("听闻那蒙古大汗此次御驾亲征，率大军攻打襄阳城。既然天书在他手中，那我也只能去碰碰运气了。",0,5)

do return end