dark()
stands()
addevent(-2, 101, 1, nil, nil, 5098)
addevent(-2, 102, 1, nil, nil, 8250)
instruct_3(-2, 61, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
light()

say("好美的小村啊。",0,5)
  
instruct_30(35,31,22,31)
stands()

say("二位前辈，不知道你们有没有见到过一位白衣女子？",0,5)

say("年轻人，你在找人吗？", 255, 0,"南贤"); --对话

say("这世间那么多白衣女子，谁知道你说的是哪一位啊？", 256, 0,"北丑");  --对话

say("唉……",0,5)

say("年轻人，别灰心，我看你一路风尘，一定很累了吧？你先在这里休息几天，养足精神再去找人不迟。", 255, 0,"南贤"); --对话

say("既然南贤老头都发话了，你也不用客气，把这里当成你自己的家就好。", 256, 0,"北丑");  --对话

say("那就多谢二位前辈了。",0,5)
  
dark()

instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)

instruct_0()
instruct_3(-2, 2, 1, 0, 690, 0, 0, 6086, 6086, 6086, -2, -2, -2)
instruct_0()
instruct_3(-2, 4, 1, 0, 698, 0, 0, 8250, 8250, 8250, -2, -2, -2)
instruct_3(-2, 3, 1, 0, 694, 0, 0, 5098, 5098, 5098, -2, -2, -2)
addevent(70, 87, 1, 4100, 1, 9168)
null(-2,101)
null(-2,102)
null(-2,-2)
--打开场景
instruct_39(19)
instruct_39(101)
instruct_39(36)
instruct_39(28)
instruct_39(93)
instruct_39(105)
instruct_0()
instruct_19(9, 30)
instruct_40(1)
  
light()

instruct_2(234, 1)
instruct_0()
instruct_2(182, 1)
instruct_0()
instruct_2(195, 1)
instruct_0()