TalkEx("年轻人，你来啦。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("前辈，有什么指示吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("作为贤者，我有很重要的事情要对你说。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("我就知道，你总会再给我一些提示的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("或许你还没有察觉，其实你身上肩负了与众不同的使命。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("那是什么？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我暂时还不能透露太多，你先去寻找十四天书吧。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("十四天书吗？好的，我记下了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("临走之前，我还有一句话重要的话要提醒你。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("前辈请讲。", 0, 1)  --对话
Cls()  --清屏
TalkEx("在江湖上行走，最重要的就是使自己保持在正道之上……", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("知道了。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,693,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
