--杨过万兽山庄剧情
--史伯威
dark()

instruct_19(12,46)
stands()

light()

say("神雕侠，你就是神雕侠吧？",335,0,"史伯威")

--主角
say("正是在下，不知史庄主找在下有何事？",0,5)

--史伯威
say("前年岁尾，我三弟在凉州打抱不平，和人动手，对方突然使用诡计，我三弟一个不慎，身受重伤……",335,0,"史伯威")

--郭襄
say("这位史三叔武功好得很啊，是谁这等厉害？竟能伤得了他？",327,4,"郭襄")

--史仲猛
say("打伤我三弟的，是个蒙古王子，名叫霍都，听说是蒙古第一护国大师金轮法王的弟子。",338,0,"史仲猛")

--主角
say("原来是他，怪不得有此功夫。",0,5)

--郭襄
say("神雕侠，请你帮帮史三叔吧。",327,4,"郭襄")

--史仲猛
say("神雕大侠，舍弟命在旦夕，还望大侠垂怜。",338,0,"史仲猛")

--杨过
say("不敢。杨某自当尽力一试。",0,5)

say("Ｄ杨过深吸一口气，开始为史叔刚运功疗伤。",0,2)
dark()

light()
say("Ｄ一个时辰之后……",0,2)

--史叔刚
say("神雕大侠，各位兄弟，我觉得好多了，不过想要痊愈，恐怕还是要拿九尾灵狐之血。",339,4,"史叔刚")

--杨过
say("九尾灵狐？",0,5)

--史叔刚
say("是的，手下的人说曾经在黑龙潭一带见到过它的踪影。",339,4,"史叔刚")

--杨过
say("既然如此，在下这便去黑龙潭一趟。",0,5)

--史伯威
say("神雕大侠，我兄弟的性命是你老人家救的，你此后有何差遣，咱们兄弟水里水里去，火里火里去，无不遵从。",335,0,"史伯威")

dark()
instruct_19(7,43)
null(112, 1)
null(112, 2)
null(112, 8)
light()

--郭襄
say("神雕侠，你能不能带我去啊？",327,0,"郭襄")

--杨过
say("你姓什么？叫什么名字？尊师是谁？为什么跟着我？",58,4)

--郭襄
say("你尊姓大名？你先跟我说，我才跟你说。",327,0,"郭襄")

--杨过
say("你这姑娘好生奇怪，既不肯说，那也罢了。这便告辞。",58,4)

--郭襄
say("神雕侠，你功夫这么好，你教我几手好不好？",327,0,"郭襄")

--杨过
say("Ｌ＜还是别招惹这小姑娘了，我且吓她一吓＞Ｗ你好大胆，为什么不怕我？我要害你了。",58,4)

--郭襄
say("Ｌ＜先是一惊，随即格格一笑＞Ｗ我才不怕呢。你如真的要害我，还会先说出来么？神雕大侠义薄云天，岂能害我一个小小女子？",327,0,"郭襄")

--杨过
say("你素不识我，怎知我不会害你？",58,4)

--郭襄
say("我虽不识你，昨晚在风陵渡却听到许多人说你的事迹。我心中说：‘这样一位英雄人物，定要见见。’因此便跟着一位大叔来见你了。",327,0,"郭襄")

--杨过
say("我算是什么英雄？你见了之后，定然觉得见面不如闻名。",58,4)

--郭襄
say("不，不！你若不算英雄。有谁还能算是英雄？Ｌ＜她这话一出口，随即觉得有些不妥，可把自己父亲也说得不如他了＞Ｗ",327,0,"郭襄")

--郭襄
say("当然，除了你之外，世上也还有几位大英雄大豪杰，但你也是其中之一。",327,0,"郭襄")

--杨过
say("Ｌ＜你这样一个十几岁的小娃儿，能知道几个当世的人物？＞Ｗｗ那你便说说，你知道哪几位大英雄大豪杰？",58,4)

--郭襄
say("我说出来，倘若说得对，你便带我一起去行侠仗义好不好？",327,0,"郭襄")

--杨过
say("好，你倒说几位听听。",58,4)

--郭襄
say("我说啦。有一位英雄，镇守襄阳，奋不顾身，力抗蒙古，保境安民。这算不算是大英雄？",327,0,"郭襄")

--杨过
say("对！郭靖郭大侠，算得是大英雄。",58,4)

--郭襄
say("还有一位女英雄，辅佐夫君，抗敌守城，智计无双，料事如神。这算不算是大英雄？",327,0,"郭襄")

--杨过
say("你说的是郭夫人黄帮主？嗯，确是一位了不起的女英雄。",58,4)

--郭襄
say("还有一位老英雄，五行奇术，鬼神莫测，弹指神通，罕有其匹。这算不算是大英雄？",327,0,"郭襄")

--杨过
say("这是桃花岛主黄药师，武林前辈，我素来敬仰的。",58,4)

--郭襄
say("又有一位，率领丐帮，锄奸杀敌，为国为民，辛苦劳碌，他算不算是大英雄？",327,0,"郭襄")

--杨过
say("你说的是鲁有脚鲁帮主？此人武功并不怎么，也说不上有甚么大作为，但瞧在‘锄奸杀敌，为国为民’八个字上，算他是一号人物。",58,4)

--郭襄
say("Ｌ＜你自己这样的了不起，眼界自是极高，我再说下去，只怕你要说不对了。何况，除了爸爸、妈妈、外公、鲁老伯，我想不出还有谁了。＞Ｗ",327,0,"郭襄")

--杨过
say("Ｌ＜听她所说的人物，鉴貌辨色，已然猜出了几分她的来历。想再试她一试＞Ｗｗ你只要再说一个，说得对，我便考虑带你同去。",58,4)

--郭襄
say("好，又有一位：解困济急，锄强扶弱，众口称扬，神雕大侠！这位倘若不算是大英雄，那你便是撒赖。",327,0,"郭襄")

--杨过
say("小姑娘说话有趣得紧。",58,4)

--郭襄
say("那你便带我到黑龙潭么？",327,0,"郭襄")

--杨过
say("你既说我是大英雄，大英雄岂能失信于小姑娘？咱们走罢。",58,4)

dark()

--黑龙潭事件
instruct_17(21,1,30,24,0)
instruct_17(21,1,30,23,773*2)
instruct_17(21,1,29,23,772*2)
addevent(21, 10, 1, 4157, 1, -2)
for i = 19, 22 do
	null(112, i)
end
light()

--郭襄入队
say("郭襄随队行动。",0,2)

do return end
