if JY.Person[0]["性别"] == 0 then
	say("少侠好。",356,0,"阿九")
else
	say("女侠好。",356,0,"阿九")
end
Cls()  --清屏
say("姑娘，近日大功坊似乎有事情发生？", 0, 1)  --对话
Cls()  --清屏
say("是的，听说金龙帮的帮主焦公礼几年前杀害了仙都派闵子华的哥哥，所以闵子华邀请武林好手，去找焦公礼报仇。", 356,0,"阿九") --对话
Cls()  --清屏
say("几年前杀的？闵子华怎么知道是焦公礼下的手？", 0, 1)  --对话
Cls()  --清屏
say("据说是太白三英告诉他的。", 356,0,"阿九")  --对话
Cls()  --清屏
say("太白三英？我刚才进来的时候看见那三个家伙了，鬼鬼祟祟的……", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	say("嗯，我也觉得他们有些奇怪。少侠，不如我们去调查一下如何？", 356,0,"阿九")		--对话
else
	say("嗯，我也觉得他们有些奇怪。女侠，不如我们去调查一下如何？", 356,0,"阿九")		--对话
end
Cls()  --清屏
if DrawStrBoxYesNo(-1, -1, "要去调查一下吗？", C_WHITE, CC.DefaultFont) then  --是/否
	instruct_37(2)  --增加品德
	say("调查一下也好，可不能冤枉了好人。", 0, 1)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,1,0,349,325,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 5,1,0,324,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件
	Cls()  --清屏
end
instruct_37(-2)  --增加品德
say("管那么多干嘛！反正大家都认为是焦公礼的错，咱们就去凑凑热闹，就算灭了金龙帮，也是为朋友帮忙！Ｌ＜金龙帮是地头蛇，可能还会有不少收获……＞", 0, 1)  --对话
Cls()  --清屏
say("也好，那我们先休息一晚，明天去金龙帮。", 356,0,"阿九")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(59, 2,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 15,1,0,0,0,0,5434,5434,5434,-2,-2,-2)  --修改场景事件
instruct_3(59, 13,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 12,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 11,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 10,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 9,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 8,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 7,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 6,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 5,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 4,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 3,1,0,0,0,0,5430,5430,5430,-2,-2,-2)  --修改场景事件
instruct_3(59, 29,0,0,0,0,351,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
stands()
instruct_40(3)  --设置主角方向
instruct_13()  --场景变亮
say("糟糕，起来晚了，他们大概都已经去了金龙帮了吧，我也过去瞧瞧热闹。", 0, 1)  --对话
Cls()  --清屏
do return end