--倚天邪周芷若事件
Cls()  --清屏
instruct_25(JY.Base["人X1"], 33, JY.Base["人X1"], 29)

say("你是本门最年轻的弟子，论资望，说武功，哪一桩都轮不到你来做本派掌门。", 191, 4,"丁敏君")  --对话

say("丁师姊说的是，小妹是本门最年轻的弟子，不论资历、武功、才干、品德，哪一项都够不上做本派掌门。师父命小妹当此大任，小妹原曾一再苦苦推辞，但先师厉言重责，要小妹发下毒誓，不得有负师父的嘱咐。", 357, 0,"周芷若")  --对话

say("Ｌ＜冷笑道＞Ｗ哼，那日咱们在高塔之上，不是都曾亲耳听到苦头陀和鹤笔翁大声叫嚷么？周师妹的父母是谁，师父为何对她另眼相看，这还明白不过么？", 191, 4,"丁敏君")  --对话

say("丁师姊，你若不服小妹接任掌门，尽可明白言讲。你胡言乱语，败坏师父毕生清誉，该当何罪？", 357, 0,"周芷若")  --对话

say("你想任本派掌门，尚未得同门公认，自己身分未明，便想作威作福，分派我的不是，甚么败坏师父清誉，甚么该当何罪。你想来治我的罪，是不是？", 191, 4,"丁敏君")  --对话

say("师父的遗志乃是要本派光大发扬。依小妹之见，咱们还是请周师妹交出掌门铁指环，另推一位德才兼备、资望武功足为同门表率的师姊出任本派掌门。", 191, 4,"丁敏君")  --对话

say("丁敏君说了这几句话后，同门中便有六七人出言附和。", 0, 2)  --对话

instruct_25(JY.Base["人X1"], 29, JY.Base["人X1"], 33)

say("Ｌ＜看来是峨眉派残存的弟子在争夺掌门之位，这位周姑娘似乎落于下风了，我不如帮她一把，日后说不定会有好处＞", 0, 1)  --对话

instruct_30(JY.Base["人X1"], 33, JY.Base["人X1"], 29)

stands()

say("我看这位周姑娘人很好啊，她不配做掌门，难道你反配么？", 0, 1)  --对话

say("你是什么人？", 191, 4,"丁敏君")  --对话

say("你不认识我没关系，但想必你应该认识这把剑吧。Ｄ＜说罢抽出了腰间的佩剑，剑身寒芒吞吐，电闪星飞，正是倚天剑＞", 0, 1)  --对话

say("这……是……倚天剑！怎么会在你手里？", 191, 4,"丁敏君")  --对话

if JY.Person[0]["性别"] == 0 then
	say("小弟知道这倚天剑是峨眉掌门之物，今日特来送还给周掌门。", 0, 1)  --对话
	
	say("Ｌ＜这人尚不知是敌是友，不过眼下若不接受他帮助，凭我一己之力恐怕难以服众＞", 357, 0,"周芷若")  --对话
else
	say("小妹知道这倚天剑是峨眉掌门之物，今日特来送还给周掌门。", 0, 1)  --对话
	
	say("Ｌ＜这人尚不知是敌是友，不过眼下若不接受她帮助，凭我一己之力恐怕难以服众＞", 357, 0,"周芷若")  --对话
end

say("Ｄ＜接过倚天剑＞Ｗ周芷若谢过"..JY.Person[0]["外号"].."赠剑之恩。", 357, 0,"周芷若")  --对话

say("丁师姊，小妹有没有能力接任这掌门之位，咱们多说也无益，师姊若是不服，就请手下见真章吧。", 357, 0,"周芷若")  --对话

JY.Person[631]["血量翻倍"] = JY.Person[592]["血量翻倍"]

if WarMain(279, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end

JY.Person[631]["血量翻倍"] = 1

null(-2,29)

instruct_3(33, 2,1,0,4207,0,0,4685*2,4685*2,4685*2,-2,-2,-2)  --修改场景事件

light()

say("众人眼见周芷若武艺精湛，又有倚天剑在手，本来支持丁敏君的也不再言语。", 0, 2)  --对话

say("师父既命周师妹继任掌门，必有深意。咱们同受师父栽培的大恩，自当遵奉她老人家遗志，同心辅佐周师妹，以光本派武德。", 191, 4,"静玄")  --对话

for i = 3, 10 do
	instruct_3(33, i,1,0,4208,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
end

null(-2,0)
null(-2,1)

do return end
