say("恭喜周掌门夺得掌门之位，在下还有一事相求。", 0, 1)  --对话

say(JY.Person[0]["外号"].."是要找十四天书吧，我已经知道了，如果有用的着芷若的地方请尽管说。", 357, 0,"周芷若")  --对话

Cls()  --清屏
if instruct_9() then  --是否要求加入
	instruct_3(28, 36,1,0,0,0,0,2286,2286,2286,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		Cls()  --清屏
		dark()
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		light()
		instruct_10(631)  --加入队伍
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去小村吧。", 357, 0,"周芷若")  --对话
	Cls()  --清屏
	dark()
	instruct_3(70, 17,1,0,4210,0,0,4685*2,4685*2,4685*2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	light()
	do return end  --无条件结束事件

end
Cls()  --清屏
do return end