dark()

instruct_19(33,33)

stands()

instruct_40(1)  --主角面向下

light()


say("此去光明顶，还有多少埋伏，快说？",6,0)

say("灭绝将要把一名明教教众手臂砍下之时……",0,2)

say("住手！",9,0)

say("阿牛哥你疯啦，我们是阶下囚啊！",372,0,"殷离")

say("他们这些人手无寸铁，师太对他们残忍兇狠，实在有失一代宗师的风范。",9,0)

say("邪魔歪道人人得而诛之，哪有残忍不残忍的？",6,0)

say("他们这些人轻生重义，都是铁铮铮的好汉。",9,0)

say("魔教徒吸血杀人，害死我徒弟。",6,0)

say("那青翼幅王只杀一人，你们所杀之人已经多过他十倍。",9,0)

say("好！你要是能接住我三掌，我就放过他们。",6,0)

say("张无忌接前两掌之后，运功调息马上恢复……",0,2)

dark()

light()

say("师太，我调息好了，愿舍命再挨你一掌。",9,0)

say("Ｌ＜这小子这么盘膝一坐，立刻神采奕奕，内力之深厚当真邪门儿＞Ｗ是你不要命，小子看掌！",6,0)

say("无忌兄弟，我来帮你接这掌！",0,1)

--战斗，群殴灭绝
WarMain(292, 0)

light()

say("多谢师太，手下留情。",0,1)

say("Ｌ＜见对方人多＞Ｗ哼，今日就饶你们一命。",6,0)

dark()

null(-2,40)

light()

say("多日前无忌兄弟从山涯上坠落，不知之后发生何事？",0,1)

say("我从山涯上坠落之后，幸好卡在树上，才大难不死，可是我脚却断掉了，幸亏遇到蛛儿照顾我。",9,0)

say("那怎会被灭绝抓走呢？",0,1)

say("一言难尽，因蛛儿得罪峨嵋派的弟子，况且她又是白眉鹰王的孙女，所以我们才被灭绝抓走做为人质。",9,0)

say("我此时有要事赶去光明顶，我怕蛛儿一人闯荡江湖有危险，少侠是否可带着蛛儿同行？",9,0)

say("好啊，我正缺帮手。",0,1)

dark()

for i = 41,46 do
	null(-2,i)
end

--开启光明顶
instruct_17(11,1,29,47,0)

light()

--殷离入队

if instruct_20() == false then  --判断队伍是否已满
	instruct_10(646)
else
	say("你的队伍已满，我就直接去小村吧。", 372,0,"殷离")
	
	instruct_3(70, 106,1,0,4251,0,0,2669*2,2669*2,2669*2,-2,-2,-2)  --修改场景事件
end
do return end