stands()

instruct_25(49,12,49,16)

say("你这样说：“小女子周芷若对天盟誓，日后我若对魔教教主张无忌这淫徒心存爱慕，倘若和他结成夫妇，我亲身父母死在地下，尸骨不得安稳；我师父灭绝师太必成厉鬼，令我一生日夜不安，我若和他生下儿女，男子代代为奴，女子世世为娼。”",6,0)

say("周芷若大吃一惊，她天性柔和温顺，从没想到所发的誓言之中竟能会如此毒辣，不但诅咒死去的父母，诅咒恩师，也诅咒到没出世的儿女，但见师父两眼神光闪烁，狠狠盯在自己脸上，不由得目眩头晕，便依着师父所说，照样念了一遍。",0,2)

say("Ｇ＜脸色一沉＞Ｗ芷若，我不是故意逼你，这全是为了你好。你一个年纪轻轻的女孩子，以后师父不能再照看你，倘若你重蹈你纪师姊的覆辙，师父身在九泉之下，也不得安心。何况师父要你负起兴复本派的重任，更是半点大意不得。",6,0)

say("弟子……明白。", 357, 0,"周芷若")

say("Ｇ＜除下左手食指上的铁指环＞Ｗ峨嵋派女弟子周芷若跪下听谕。",6,0)

say("峨嵋派第三代掌门女尼灭绝，谨以本门掌门人之位，传于第四代女弟子周芷若。",6,0)

instruct_25(49,16,49,12)

say("喂，你这老尼姑，竟然逼人家姑娘发如此狠毒的誓？我看明教的张教主人很好啊，宅心仁厚，跟这位周姑娘又是青梅竹马。",0,1)

say("无耻小贼，你是跟那张无忌一伙的，今日既然落在你们手中，要杀要剐也随你！",6,0)

say("拜托，我可不是来杀你的，我是来救你们出去的，趁现在快走吧，明教的人在外面接应。",0,1)

say("想要我受魔教的恩惠，下辈子吧！",6,0)

instruct_27(9,5468,5496)  --显示人物动画
Cls()  --清屏
instruct_3(-2, 9,-2,-2,1063,-1,-1,5238,5238,5238,-2,-2,-2)  --修改场景事件

say("师父！", 357, 0,"周芷若")

say("哎……师太，你这又是何苦呢。周姑娘，此地不宜久留，你快走吧。",0,1)

say("……", 357, 0,"周芷若")

dark()

null(-2,-2)
null(-2,8)
null(-2,9)

JY.Person[6]["品德"] = JY.Person[6]["品德"] + 1

light()

do return end