say("如果我不是什么郡主，只是平民百姓该有多好。",343,0,"赵敏")

say("每个人都有每个人的使命，由不得自己。",0,1)

say("如果我要你陪我去取屠龙刀，你愿意吗？",343,0,"赵敏")

say("Ｌ＜听闻屠龙刀在谢逊手中，而我正要去找他，或许赵敏有他的消息＞Ｗ在下愿陪赵姑娘一行。",0,1)

say("好，我们去灵蛇岛。",343,0,"赵敏")

instruct_3(73, 2,0,0,0,0,281,0,0,0,-2,-2,-2)  --圣火三使

if instruct_20() == false then  --判断队伍是否已满
	dark()

	null(-2,-2)

	light()

	instruct_10(609)
else
	say("你的队伍已满，我就直接去小村吧。", 343,0,"赵敏")
	dark()

	null(-2,-2)
	
	instruct_3(70, 105,1,0,4252,0,0,2673*2,2673*2,2673*2,-2,-2,-2)  --修改场景事件

	light()
end
do return end