TalkEx("贝海石愿效犬马之劳，今后愿听"..JY.Person[0]["外号"].."差遣。", 85, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(104, 48,1,0,986,0,0,7028,7028,7028,-2,-2,-2)  --修改场景事件
TalkEx("贝大夫，跟我一起走吧。", 0, 1)  --对话
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	TalkEx("好吧。", 85, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_10(85)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 85, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 47,1,0,185,0,0,7028,7028,7028,-2,-2,-2)  --修改场景事件
Cls()  --清屏
Cls()  --清屏
do return end
