--OEVENTLUA[428] = function()	--中邪线侠客岛事件
	--if GetS(86,20,20,5) == 2 then
		instruct_26(61,19,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
		instruct_26(61,18,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
		instruct_1(1644,39,0);   --  1(1):[龙岛主]说: 太玄神功已被石兄弟破解，*此处没有来的必要了，"..JY.Person[0]["外号"].."*请回吧。
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(1645,0,1);   --  1(1):[AAA]说: 什么是太玄神功我不知道。*我来此只是想问一下，这里*有没有十四天书的下落。
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(1646,40,0);   --  1(1):[木岛主]说: 有！
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(1647,0,1);   --  1(1):[AAA]说: 哦？
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(1648,39,0);   --  1(1):[龙岛主]说: 《侠客行》一书，就在侠客*岛！
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_1(1649,0,1);   --  1(1):[AAA]说: 那，能不能把这本书送给我*？
		instruct_0();   --  0(0)::空语句(清屏)
		say("这本书给你也不是不可能...",40,0);
		say( "你要是能打赢我们三人，这本书就给你。",39,0);
		say("为了天书，拼了命也得试试。",0,1);

		if instruct_6(170,3,0,0) ==false then    --  6(6):战斗[170]是则跳转到:Label0
			instruct_15(0);   --  15(F):战斗失败，死亡
			do return; end
		end    --:Label0

		--instruct_3(-2,19,1,0,8303,0,0,5152,5152,5152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [19]
		instruct_3(-2,2,1,0,417,0,0,5132,5132,5132,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [2]
		instruct_3(-2,3,1,0,418,0,0,5136,5136,5136,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [3]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_13();   --  13(D):重新显示场景
		say("连侠客岛上的武功都不是"..JY.Person[0]["外号"].."的对手，看来这本书应该由"..JY.Person[0]["外号"].."来保管。",39,0);
		say("废话少说，快把书拿来。",0,1);
		instruct_2(154,1);   --  2(2):得到物品[侠客行][1]
		instruct_0();   --  0(0)::空语句(清屏)		
		instruct_2(80,1);   --  2(2):得到物品[太玄经][1]
		instruct_0();   --  0(0)::空语句(清屏)
		instruct_2(271,1);   --沧溟刀法
		instruct_0();   --  0(0)::空语句(清屏)
--end