--function oldevent_448()
    --instruct_3(-2,-2,1,0,0,0,0,7092,7092,7092,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_17(-2,1,51,25,0);   --  17(11):修改场景贴图:当前场景层0坐标29-19
    instruct_17(-2,1,51,24,0);   --  17(11):修改场景贴图:当前场景层0坐标2A-19
    instruct_17(-2,1,51,26,0);   --  17(11):修改场景贴图:当前场景层0坐标2B-19
    instruct_17(-2,1,50,25,0);   --  17(11):修改场景贴图:当前场景层0坐标29-19
    instruct_17(-2,1,50,24,0);   --  17(11):修改场景贴图:当前场景层0坐标2A-19
    instruct_17(-2,1,50,26,0);   --  17(11):修改场景贴图:当前场景层0坐标2B-19
	instruct_17(-2,1,49,25,0);   --  17(11):修改场景贴图:当前场景层0坐标29-19
    instruct_17(-2,1,49,24,0);   --  17(11):修改场景贴图:当前场景层0坐标2A-19
    instruct_17(-2,1,49,26,0);   --  17(11):修改场景贴图:当前场景层0坐标2B-19
    instruct_0();   --  0(0)::空语句(清屏)
	
	instruct_3(-2,1,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,2,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,3,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,4,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,5,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,6,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,7,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,8,0,0,0,0,0,0,0,0,-2,-2,-2);
	instruct_3(-2,9,0,0,0,0,0,0,0,0,-2,-2,-2);
    instruct_13();   --  13(D):重新显示场景
--end

