if instruct_16(30) == false then  --是否在队伍
	TalkEx("我爹爹不要我了……", 56, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
TalkEx("我爹爹不要我了……", 56, 0)  --对话
Cls()  --清屏
TalkEx("他为什么不要你呢？", 55, 1)  --对话
Cls()  --清屏
TalkEx("他在家里关了一个人，好可怜，我就给那个人送饭吃，结果爹爹就骂我，坏爹爹，坏爹爹。", 56, 0)  --对话
Cls()  --清屏
TalkEx("哦，原来你爹爹是坏人啊。", 55, 1)  --对话
Cls()  --清屏
TalkEx("不许你这样说我爹！", 56, 0)  --对话
Cls()  --清屏
TalkEx("那你刚才自己又说……", 55, 1)  --对话
Cls()  --清屏
TalkEx("我自己可以说，别人不能说。坏爹爹，也不来找我，我没有钱，没饭吃，都成了叫化子啦，呜呜呜……", 56, 0)  --对话
Cls()  --清屏
TalkEx("你好可怜，你需要钱吗？我这里有，都给你吧。", 55, 1)  --对话
Cls()  --清屏
TalkEx("喂，郭兄，这可是你全部的钱啊，给一个素不相识的小叫化……", 0, 1)  --对话
Cls()  --清屏
TalkEx("没关系啊，你看她多可怜啊……", 55, 1)  --对话
Cls()  --清屏
TalkEx("你，你，呜呜呜……", 56, 0)  --对话
Cls()  --清屏
TalkEx("姑娘，你怎么又哭了？", 55, 1)  --对话
Cls()  --清屏
TalkEx("头一次有人对我这么好，呜呜呜……", 56, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_19(20, 31)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
instruct_3(-2, 15,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哈哈，黄姑娘，我们又见面了，我是真心诚意喜欢你，你又何必拒人于千里之外呢？", 61, 0)  --对话
Cls()  --清屏
TalkEx("可我偏偏看你十分讨厌！", 56, 0)  --对话
Cls()  --清屏
TalkEx("家叔与令尊齐名武林，我与黄姑娘又是一见钟情，不如我们从此结为夫妻，相约白首，岂不美哉？", 61, 0)  --对话
Cls()  --清屏
TalkEx("哼，欧阳锋就会弄蛇使毒，有什么真本事？也配与我爹爹齐名？真没羞。所以才教出你这么个没羞没臊的小毒物。你要再纠缠我，我可对你不客气了！", 56, 0)  --对话
Cls()  --清屏
TalkEx("你不要欺负这位姑娘。", 55, 1)  --对话
Cls()  --清屏
TalkEx("哪里来的野小子，也敢在本公子面前放肆。你听清楚了，我叔叔乃是江湖上赫赫有名的西毒欧阳锋，我就是白驼山少主，欧阳克，你们两个识相的就给我滚远点！", 61, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜哇，西毒欧阳锋，好厉害，武林中数一数二的人物啊！＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("我不管你是吸什么毒的，总之你不能欺负这位姑娘。", 55, 1)  --对话
Cls()  --清屏
TalkEx("臭小子，找打是不是？", 61, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这欧阳克武功不俗，他叔叔更加不得了，我是否应该与他为敌呢？＞", 0, 1)  --对话
Cls()  --清屏
if instruct_5() then  --是否与之过招
	instruct_37(2)  --增加品德
	TalkEx("路见不平，拔刀相助，我最喜欢英雄救美，郭兄，我们上！", 0, 1)  --对话
	Cls()  --清屏
	if WarMain(69, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("好小子，给我记住！", 61, 0)  --对话
	Cls()  --清屏
	TalkEx("那你就记好了，我叫郭靖。", 55, 1)  --对话
	Cls()  --清屏
	TalkEx("哼！黄姑娘，咱们就此别过，改日我定叫我叔父到桃花岛提亲，你可要等着我啊。", 61, 0)  --对话
	Cls()  --清屏
	TalkEx("呸！不要脸！", 56, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("他已经跑了，姑娘没事吧。", 55, 1)  --对话
	Cls()  --清屏
	TalkEx("谁说没事，我饿啦……", 56, 0)  --对话
	Cls()  --清屏
	TalkEx("那我请你吧，你想吃点什么？", 55, 1)  --对话
	Cls()  --清屏
	TalkEx("这里穷乡僻壤，没什么好吃的，走，我们去大馆子。", 56, 0)  --对话
	Cls()  --清屏
	TalkEx("好啊，你说哪里就是哪里。", 55, 1)  --对话
	Cls()  --清屏
	TalkEx("郭兄……", 0, 1)  --对话
	Cls()  --清屏
	TalkEx(JY.Person[0]["外号"].."，我要请这位姑娘吃饭，先走了。后会有期。", 55, 1)  --对话
	Cls()  --清屏
	TalkEx("走，我们好好吃一顿，然后我领你去见一位前辈。", 56, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_21(30)  --离开队伍
	instruct_3(23, 0,1,0,463,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(23, 7,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
	instruct_3(23, 6,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
	instruct_3(23, 10,0,0,0,0,462,0,0,0,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_2(255, 1)  --兰花拂穴手
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("那西毒欧阳锋可不是好惹的，郭大哥，我们还是别管这闲事了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("这可不行，这位姑娘要吃亏了。他武功再高强，我也不怕。", 55, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("哼，知道厉害了吧。哪里来的混小子，在这强出头！", 61, 0)  --对话
Cls()  --清屏
TalkEx("你打不过他的，我们快跑。我知道一位高人住的地方，你跟我来。", 56, 0)  --对话
Cls()  --清屏
TalkEx("哼，什么高人，还能高得过我叔叔吗？我看你往哪跑。", 61, 0)  --对话
Cls()  --清屏
instruct_2(256, 1)  --透骨打穴
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(23, 7,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(23, 6,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(23, 10,0,0,0,0,501,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(23, 8,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
instruct_3(41, 1,1,0,513,0,0,7106,7106,7106,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("唉，郭靖跟着那个姑娘一起跑了。我总算没得罪西毒欧阳锋，说不定日后能得到什么好处。", 0, 1)  --对话
Cls()  --清屏
instruct_21(30)  --离开队伍
instruct_37(-2)  --增加品德
do return end
