instruct_14()  --场景变黑
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(47,36,28,33)  --人物移动
instruct_40(2)  --设置主角方向
Cls()  --清屏
TalkEx("靖儿，那边又来了人，你可认识？", 69, 0)  --对话
Cls()  --清屏
TalkEx("啊，他是我的朋友，是我们一起打跑欧阳克的。", 55, 0)  --对话
Cls()  --清屏
TalkEx("郭兄，黄姑娘，别来无恙？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我很好啊。我来给你介绍，这位是九指神丐洪七公洪老前辈。", 55, 0)  --对话
Cls()  --清屏
TalkEx("哇，北丐洪七公！晚辈参见洪老前辈。", 0, 1)  --对话
Cls()  --清屏
TalkEx("免啦免啦，老家化子一个，有什么好参见的。", 69, 0)  --对话
Cls()  --清屏
TalkEx("郭兄得遇洪老前辈，一定受益匪浅吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("是啊，洪老前辈教了我一招掌法，很厉害的。", 55, 0)  --对话
Cls()  --清屏
TalkEx("难道是降龙十八掌？", 0, 1)  --对话
Cls()  --清屏
TalkEx("就是啊，你怎么知道的？你也快来求求洪老前辈，让他也教教你吧。", 55, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("嘿嘿，老家化子的武功可不是随便传给谁的。更何况他没你那么好福气，有个古灵精怪又会做菜的女娃娃帮你。", 69, 0)  --对话
else
	TalkEx("嘿嘿，老家化子的武功可不是随便传给谁的。更何况她没你那么好福气，有个古灵精怪又会做菜的女娃娃帮你。", 69, 0)  --对话
end
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("七公啊，我做了那么多好吃的给你，你却只教了靖哥哥一招，太少了吧。这位"..JY.Person[0]["外号"].."也算是我们的朋友，七公就点拨点拨他吧。七公武学渊博，随便抖搂两招就够我们学的了。", 56, 0)  --对话
else
	TalkEx("七公啊，我做了那么多好吃的给你，你却只教了靖哥哥一招，太少了吧。这位"..JY.Person[0]["外号"].."也算是我们的朋友，七公就点拨点拨她吧。七公武学渊博，随便抖搂两招就够我们学的了。", 56, 0)  --对话
end
Cls()  --清屏
TalkEx("哈哈，女娃娃就是坏！好吧，老叫化就教你一套逍遥游吧，这是我年轻的时候用的，走的是轻灵的路子，看清楚了！", 69, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
instruct_2(111, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("七公、"..JY.Person[0]["外号"].."，我要带靖哥哥回桃花岛见我爹，咱们就此分手吧。有时间上桃花岛做客啊。", 56, 0)  --对话
Cls()  --清屏
TalkEx("七公，弟子走了，你老人家要保重身体啊。", 55, 0)  --对话
Cls()  --清屏
TalkEx("老叫化硬朗着呢，用不着你操心。至于去桃花岛嘛，为了你们两个，老叫化肯定是要去一趟的，哈哈。", 69, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥，黄姑娘，咱们就此别过。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(75, 39,0,0,0,0,466,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
