instruct_37(1)  --增加品德
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_25(39,27,14,27)  --场景移动
instruct_25(14,27,14,40)  --场景移动
TalkEx("克儿，克儿，你怎么啦？", 60, 0)  --对话
Cls()  --清屏
TalkEx("叔叔，我，我的腿……", 61, 0)  --对话
Cls()  --清屏
TalkEx("哼，克儿你等着，我这就去杀了洪老叫化和姓郭的，把黄老邪的丫头抓来给你做媳妇。", 60, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜哎呦，不好，洪老英雄好像已经身负重伤，我得救他们＞Ｗ，欧阳锋，住手，休伤洪帮主。", 0, 1)  --对话
Cls()  --清屏
--黄蓉洗武功
instruct_35(56, 0, 80, 700)
instruct_35(56, 1, 107, 50)
if WarMain(171, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
--欧阳锋洗逆运
JY.Person[60]["武功2"] = 104
JY.Person[60]["武功等级2"] = 999
JY.Person[60]["天赋内功"] = 104
if JY.Base["畅想"] == 60 then
	JY.Person[0]["武功2"] = 104
	JY.Person[0]["武功等级2"] = 999
	JY.Person[0]["天赋内功"] = 104
end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("啊，啊，疼死我了……", 61, 0)  --对话
Cls()  --清屏
TalkEx("克儿，你怎么啦。唉，洪老叫化，姓郭的，还有你这臭"..JY.Person[0]["外号2"].."，今日克儿伤势严重，就先放过你们，若是我的克儿有什么三长两短，我全都要你们陪葬。克儿，我先带你回白驼山，养好了伤再找他们算帐！", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(15, 33)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("欧阳锋，你哪里跑！", 0, 1)  --对话
Cls()  --清屏
TalkEx("算啦，不要追了，他惦记他侄儿的伤势，才会输给你们，否则你们哪里是他的对手。要是真把他逼极了，我们恐怕治他不住。", 69, 0)  --对话
Cls()  --清屏
TalkEx("对了洪帮主、郭大哥、黄姑娘，你们怎么会在这里，洪老英雄怎么受伤了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("那日离开桃花岛时，师父和靖哥哥、老顽童他们乘坐的那艘大船，船底木材却并非用铁钉钉结，而是以生胶绳索胶缠在一起，泊在港中之时固是一艘极为华丽的花船，但如驶入大海，给浪涛一打，必致沉没。 ", 56, 0)  --对话
Cls()  --清屏
TalkEx("啊？可是黄岛主为什么要做这样的一艘船呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("他本想将我妈妈的遗体放入船中，驾船出海，当波涌舟碎之际，按玉箫吹起《碧海潮生曲》，与我妈妈一齐葬身万丈洪涛之中，如此潇洒倜傥以终此一生。只是顾念我尚年幼，才迟迟没有出海。", 56, 0)  --对话
Cls()  --清屏
TalkEx("原来如此啊，真不愧是东邪！可是你们怎么又到了这里？", 0, 1)  --对话
Cls()  --清屏
TalkEx("那船在海上沉没以后，我们被欧阳锋救上他的船。欧阳锋逼着老顽童默写九阴真经，结果老顽童不肯，硬是跳了海。", 69, 0)  --对话
Cls()  --清屏
TalkEx("啊？那，那周老前辈岂不是……", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉，现在生死不知啊。欧阳锋又逼着我这傻徒弟给他写。", 69, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥，你把这真经写给他，不知他又要害多少人了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我给他写的是假的。", 55, 0)  --对话
Cls()  --清屏
TalkEx("假的？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我依照洪师父所传的诀窍，将经文倒乱一番，经中说\"手心向天\"，我改成\"脚底向天\"，\"脚踏实地\"改成为\"手撑实地\"，经中说是\"气凝丹田\"，我就改成\"气凝胸口\"。", 55, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，郭大哥，真有你的，这下老毒物可上了大当了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("老毒物得了真经之后，就要放火烧船，幸得蓉儿赶来，我们才死里逃生。", 69, 0)  --对话
Cls()  --清屏
TalkEx("师父太仁慈了，非要救欧阳叔侄，结果遭了欧阳锋的暗算，被打成重伤。", 56, 0)  --对话
Cls()  --清屏
TalkEx("这欧阳锋，好歹毒！", 0, 1)  --对话
Cls()  --清屏
TalkEx("我给毒蛇咬中，又中了西毒蛤蟆功的掌力。我拚着全身功力，才逼出了蛇毒，终究也没干净，就算延得数年老命，但毕生武功已毁于一旦。我现在只是个糟老头儿，再也没半点功夫了。", 69, 0)  --对话
Cls()  --清屏
TalkEx("洪帮主且放宽心，我一定想办法让您老恢复功力。现下当务之急，是尽快离开这里。郭大哥、黄姑娘，你们有何打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("听说金人要去皇宫盗取武穆遗书，此事关系国家安危，我要去阻止金人。另外，我还想回我的老家牛家村去看看。", 55, 0)  --对话
Cls()  --清屏
TalkEx("靖哥哥去哪，我就跟着去哪。", 56, 0)  --对话
Cls()  --清屏
TalkEx("那咱们先离开此岛，再作计较。我若有空，定去相助郭大哥。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 5,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(32, 2,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(32, 1,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
instruct_3(32, 0,0,0,0,0,468,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(23, 0,1,0,485,0,0,6126,6148,6126,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
