instruct_37(2)  --增加品德
instruct_14()  --场景变黑
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(34,20,30,21)  --场景移动
TalkEx("妹子，你在这里练功夫么？", 61, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜靖哥哥受了重伤，还需五天五夜方能痊愈。偏巧在这时候碰见这个姓欧阳的，真是倒霉，怎生撒个大谎，将他远远骗走＞", 56, 0)  --对话
Cls()  --清屏
TalkEx("妹子，出来罢，躲在这里气闷得紧。我知道那姓郭的小子已经深受重伤，妹子，你就依了我吧，咱俩做个长久夫妻。只要你答应我，我保证不加害这个姓郭的小子。", 61, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜不好，郭大哥和黄姑娘有难，我得帮帮他们＞Ｗ欧阳兄，好久不见啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊？又是你！", 61, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."你来得正好，快来结果了这个恶人。", 56, 0)  --对话
Cls()  --清屏
TalkEx("听见了吗？欧阳克，你作恶多端，今日我就要送你归西！", 0, 1)  --对话
Cls()  --清屏
if WarMain(178, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 1,1,0,0,0,0,5154,5154,5154,-2,-2,-2)  --修改场景事件
instruct_19(30, 21)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(2)  --增加品德
TalkEx("多亏"..JY.Person[0]["外号"].."及时赶到，否则今日定难逃脱。", 56, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥怎么了？好像伤得很严重！", 0, 1)  --对话
Cls()  --清屏
TalkEx("靖哥哥和我得知金人要偷武穆遗书，我们就连夜赶到皇宫保护，没想到西毒欧阳锋竟然帮着金人，以蛤蟆功掌力震伤靖哥哥。", 56, 0)  --对话
Cls()  --清屏
TalkEx("可恶的西毒欧阳锋，教我碰见一定好好教训他！", 0, 1)  --对话
Cls()  --清屏
TalkEx("谁这么大口气！", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,0,0,0,0,0,8218,8218,8218,-2,-2,-2)  --修改场景事件
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("啊，克儿，你怎么了？克儿！谁，是谁杀了克儿！是不是你！", 60, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜完了，没办法，事到如今，豁出去了！＞Ｗ就是我，怎么样！", 0, 1)  --对话
Cls()  --清屏
TalkEx("好"..JY.Person[0]["外号2"].."，有骨气！拿命来吧！", 60, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(172, 1) == false then  --战斗开始
	Cls()  --清屏

end
instruct_3(-2, 7,0,0,0,0,0,6154,6154,6154,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("嘿嘿，臭蛤蟆，在练什么功夫啊？", 64, 0)  --对话
Cls()  --清屏
TalkEx("周老爷子，别在一旁看热闹，快来帮帮我。", 0, 1)  --对话
Cls()  --清屏
TalkEx("放心，有我在，老毒物伤不了你。", 64, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(173, 1) == false then  --战斗开始
	Cls()  --清屏

end
instruct_3(-2, 8,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("蓉儿，是你吗？", 57, 0)  --对话
Cls()  --清屏
TalkEx("爹爹，快过来，老毒物欺负你女儿！", 56, 0)  --对话
Cls()  --清屏
TalkEx("锋兄，为何动手啊？", 57, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("欧阳克要欺负我，正好小兄弟赶到，杀了欧阳克，老毒物要为他侄子报仇，爹爹，你快帮帮这位小兄弟吧！", 56, 0)  --对话
else
	TalkEx("欧阳克要欺负我，正好妹子赶到，杀了欧阳克，老毒物要为他侄子报仇，爹爹，你快帮帮这位妹子吧！", 56, 0)  --对话
end
Cls()  --清屏
TalkEx("锋兄，你那侄子也可算是作恶多端死有余辜，你何必……", 57, 0)  --对话
Cls()  --清屏
TalkEx("废话少说，我今日定要为克儿报仇！", 60, 0)  --对话
Cls()  --清屏
instruct_47(60,30)  --增加攻击力
if WarMain(174, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("好"..JY.Person[0]["外号2"].."，算你命大，我就让你再多活几天！克儿，你放心，等叔叔练好了九阴真经，一定为你报仇！", 60, 0)  --对话
Cls()  --清屏
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
TalkEx("多谢周老前辈、黄岛主的救命之恩！", 0, 1)  --对话
Cls()  --清屏
TalkEx("你救了蓉儿，我救了你，咱们两不相欠，不必言谢。", 57, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("黄老邪，你这话就不对了。就算你不来，我一样可以把欧阳锋打跑。所以说你来根本就是多余，小兄弟也不是你救的。可是他救你女儿女婿却是实实在在的，所以你还是欠他的。", 64, 0)  --对话
else
	TalkEx("黄老邪，你这话就不对了。就算你不来，我一样可以把欧阳锋打跑。所以说你来根本就是多余，小妹子也不是你救的。可是她救你女儿女婿却是实实在在的，所以你还是欠她的。", 64, 0)  --对话
end
Cls()  --清屏
TalkEx("我黄药师一生从不欠别人的。这样吧，小友，我就把我的生平绝学传授与你吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("岛主救我性命，我已然感激不尽，若再接受岛主传艺，实在惶恐。", 0, 1)  --对话
Cls()  --清屏
TalkEx("小友不必过谦。我一身武艺，本想有个传人。怎奈我当初一怒之下，把我所有的徒弟都逐出门墙。如今得了个女婿，又是如此……", 57, 0)  --对话
Cls()  --清屏
TalkEx("爹——", 56, 0)  --对话
Cls()  --清屏
TalkEx("哼，说你的靖哥哥几句你就不高兴！小友，我看你天资聪颖，与我桃花岛又颇有缘分，趁着靖儿养伤这几日，我这弹指神通的功夫就传给你吧。", 57, 0)  --对话
Cls()  --清屏
TalkEx("多谢岛主厚爱，恭敬不如从命。", 0, 1)  --对话
Cls()  --清屏
if instruct_16(63) then  --是否在队伍
	TalkEx("徒儿，你也跟这位"..JY.Person[0]["外号"].."一起练吧。", 57, 0)  --对话
	Cls()  --清屏
	TalkEx("是。", 63, 1)  --对话
	Cls()  --清屏
	instruct_35(63,1,18,50)	--程英洗弹指
	instruct_35(63,2,12,50)	--程英洗落英
end
TalkEx("黄老邪，你以为你了不起，什么生平绝学弹指神通！我周伯通别的功夫都想学，就是不看你的古怪功夫。我去也！", 64, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,8238,8238,8238,-2,-2,-2)  --修改场景事件
instruct_19(23, 35)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("靖儿的伤已经痊愈了，我这弹指神通的功夫，小友也学得差不多啦，咱们就此别过。", 57, 0)  --对话
Cls()  --清屏
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
TalkEx("爹——唉，这么快就走，一点也不疼女儿！", 56, 0)  --对话
Cls()  --清屏
TalkEx("郭大哥，黄姑娘，你们有何打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我要继续寻访武穆遗书的下落。", 55, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，咱们就此别过！", 56, 0)  --对话
else
	TalkEx("妹子，咱们就此别过！", 56, 0)  --对话
end
Cls()  --清屏
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(48, 3,0,0,0,0,469,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(48, 2,0,0,0,0,469,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(48, 20,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(48, 21,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(48, 22,0,0,0,0,0,7988,7988,7988,-2,-2,-2)  --修改场景事件
instruct_3(48, 26,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
instruct_3(48, 25,0,0,0,0,0,6094,6094,6094,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_2(95, 1)  --得到或失去物品
Cls()  --清屏
do return end
