instruct_37(1)  --增加品德
instruct_14()  --场景变黑
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(28,47,28,45)  --人物移动
TalkEx("郭大哥、黄姑娘，你们怎么*了。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."快来，蓉儿被裘千仞打伤了。", 55, 0)  --对话
Cls()  --清屏
TalkEx("好，我来抵挡一阵，你们快*走！", 0, 1)  --对话
Cls()  --清屏
TalkEx("哪里来的小贼，不知天高地*厚，敢在此撒野！", 67, 0)  --对话
Cls()  --清屏
if WarMain(72, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,1,0,470,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(47, 13,0,0,0,0,483,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(47, 5,1,0,482,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(47, 8,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(47, 7,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(47, 2,1,0,478,479,0,-2,-2,-2,-2,-2,-2)  --渔人
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("看来郭大哥他们已经脱险了*，我得找找他们，应该在附*近治伤吧。", 0, 1)  --对话
Cls()  --清屏
do return end
