TalkEx("峰峦如聚，波涛如怒，山河*表里潼关路，望西都，意踯*躅。伤心秦汉经行处，宫阙*万间都做了土。兴，百姓苦*！亡，百姓苦！", 120, 0)  --对话
Cls()  --清屏
if instruct_60(-2,16,2800) == false then  --判断场景事件
	if instruct_5() then  --是否与之过招
		instruct_37(-1)  --增加品德
		if WarMain(180, 0) == false then  --战斗开始
			instruct_15()  --死亡
			Cls()  --清屏
			do return end  --无条件结束事件
			Cls()  --清屏

		end
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		instruct_3(-2, 10,1,0,491,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		instruct_13()  --场景变亮
		do return end  --无条件结束事件

	end
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("青风相待，白云相爱。梦不*到紫罗袍共黄金带。一茅斋*，野花开，管甚谁家兴废谁*成败？陋巷单瓢亦乐哉。贫*，气如山！达，志如山！", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈，好好，过去吧。", 120, 0)  --对话
Cls()  --清屏
instruct_37(1)  --增加品德
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,1,0,491,0,0,5404,5404,5404,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
