TalkEx("洪帮主，近来可好？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我现在只是个糟老头儿，再*也没半点功夫了。", 69, 0)  --对话
Cls()  --清屏
TalkEx("洪帮主不必担心，一灯大师*让晚辈给您带来了疗伤之法。", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么疗伤之法？", 69, 0)  --对话
Cls()  --清屏
TalkEx("据一灯大师讲，这是九阴真经中记载的疗伤圣法，您依照此法练功，很快就能复原。", 0, 1)  --对话
Cls()  --清屏
TalkEx("当真？待我练来。", 69, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
if JY.Person[0]["性别"] == 0 then
	TalkEx("这九阴真经真是一部奇书啊，我这么重的伤势也能复原。小兄弟，谢谢你啊。", 69, 0)  --对话
else
	TalkEx("这九阴真经真是一部奇书啊，我这么重的伤势也能复原。小姑娘，谢谢你啊。", 69, 0)  --对话
end
Cls()  --清屏
TalkEx("洪帮主何必客气。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我听说你正在寻找十四天书？", 69, 0)  --对话
Cls()  --清屏
TalkEx("是啊，洪老前辈可有线索？", 0, 1)  --对话
Cls()  --清屏
TalkEx("据我所知，《射雕英雄传》*一书，应该是在重阳真人手*上。", 69, 0)  --对话
Cls()  --清屏
TalkEx("可是重阳真人已经仙去了呀*？", 0, 1)  --对话
Cls()  --清屏
TalkEx("此书被全真教视为镇教至宝*，应该会传给下一代掌门。", 69, 0)  --对话
Cls()  --清屏
TalkEx("你老人家的意思是，此书现*在邱真人手上？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我也只是猜测。", 69, 0)  --对话
Cls()  --清屏
TalkEx("多谢洪前辈指点。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,487,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(19, 0,1,0,496,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
