instruct_37(5)  --增加品德
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
TalkEx("参见丘真人。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，你就是义救南帝北丐，剑败西毒铁掌的少年英雄吧。", 68, 0)  --对话
Cls()  --清屏
TalkEx("丘真人过奖。在下今日此来，向道长请教一件事。", 0, 1)  --对话
Cls()  --清屏
TalkEx("何事？但说无妨。", 68, 0)  --对话
Cls()  --清屏
TalkEx("《射雕英雄传》一书，道长可知道？", 0, 1)  --对话
Cls()  --清屏
TalkEx("此书乃全真教振教之宝，由历代掌门保管。不瞒"..JY.Person[0]["外号"].."，此书就在贫道身上。", 68, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 25,0,0,0,0,0,8218,8218,8218,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,8206,8206,8206,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哈哈，在你身上就好！", 60, 0)  --对话
Cls()  --清屏
TalkEx("锋兄，此行不虚啊。", 67, 0)  --对话
Cls()  --清屏
TalkEx("又是你们两个，看招！", 0, 1)  --对话
Cls()  --清屏
TalkEx("臭"..JY.Person[0]["外号2"].."，今日让你尝尝我的蛇阵的厉害！", 60, 0)  --对话
Cls()  --清屏
instruct_37(3)  --增加品德
if WarMain(176, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 27,1,0,498,0,0,7102,7102,7102,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(297,1)	--瞬息千里
Cls()  --清屏
TalkEx("着！", 129, 0)  --对话
Cls()  --清屏
TalkEx("啊--重、重阳真人，你没死？不好，快撤！", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("师，师父，您真的还活着？", 68, 0)  --对话
Cls()  --清屏
TalkEx("师父……", 123, 0)  --对话
Cls()  --清屏
TalkEx("师父……", 124, 0)  --对话
Cls()  --清屏
TalkEx("师父……", 125, 0)  --对话
Cls()  --清屏
TalkEx("师父，我们好想你……", 128, 0)  --对话
Cls()  --清屏
TalkEx("马钰，处机，处端，处玄，处一，大通，不二，你们都好吧。为师没有死，我诈死之后，摆脱尘世俗务，静心求道。", 129, 0)  --对话
Cls()  --清屏
TalkEx("晚辈参见重阳真人。", 0, 1)  --对话
Cls()  --清屏
TalkEx("呵呵，"..JY.Person[0]["外号"].."不必多礼。你的事情我早就知道了。这本《射雕英雄传》送给你也无不可，只是咱们都是武林中人，自有武林中人的行事规矩，你准备好了，可以随时来找我。", 129, 0)  --对话
Cls()  --清屏
instruct_3(-2, 0,1,0,497,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
