instruct_37(-1)  --增加品德
instruct_26(61,0,1,0,0)  --修改场景事件
instruct_26(61,8,1,0,0)  --修改场景事件
instruct_26(61,17,1,0,0)  --修改场景事件
instruct_26(61,16,1,0,0)  --修改场景事件
TalkEx("克儿、克儿，你怎么啦？", 60, 0)  --对话
Cls()  --清屏
TalkEx("我，啊，我的腿，叔叔，你杀了我吧，我好痛苦啊……", 61, 0)  --对话
Cls()  --清屏
TalkEx("欧阳前辈，令侄怎么了？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，你来的正好，那可恶的黄蓉，设下圈套害我侄儿，这么大的巨石，怎么办，怎么办……", 60, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这欧阳锋武功卓绝，我要是能帮他救了他侄儿，定可以得他传授一招半式，那可是受用不尽啊＞Ｗ欧阳前辈，你别着急，咱们一起来想想办法……", 0, 1)  --对话
Cls()  --清屏
--黄蓉洗武功
instruct_35(56, 0, 80, 700)
instruct_35(56, 1, 107, 50)
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("有了，咱们等涨潮之时，利用海水浮力，定可将巨石搬起。", 0, 1)  --对话
Cls()  --清屏
TalkEx("浮力？好像有道理，克儿，你再忍一忍，叔叔这就来救你……", 60, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("克儿，克儿，你终于得救了，你还好吧，我的克儿……", 60, 0)  --对话
Cls()  --清屏
TalkEx("叔叔，我……", 61, 0)  --对话
Cls()  --清屏
TalkEx("欧阳先生不必担心，令侄的性命已可保住，至于这腿伤，修养几个月也能康复。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是我侄儿的救命恩人，我欧阳锋向来不愿欠别人的，现在我就将我西域白驼山的绝学白驼雪山掌教给你吧。", 60, 0)  --对话
Cls()  --清屏
instruct_2(104, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("多谢欧阳先生。Ｌ＜为啥不传我蛤蟆功呢，看来他的看家本领都要传给他侄儿，早知如此，还不如不救欧阳克……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("我要带克儿回去养伤，还要找郭靖黄蓉算帐，哼！好在我已得到九阴真经，很快就会天下无敌啦，哈哈。", 60, 0)  --对话
Cls()  --清屏
--欧阳锋洗逆运
JY.Person[60]["武功2"] = 104
JY.Person[60]["武功等级2"] = 999
JY.Person[60]["天赋内功"] = 104
if JY.Base["畅想"] == 60 then
	JY.Person[0]["武功2"] = 104
	JY.Person[0]["武功等级2"] = 999
	JY.Person[0]["天赋内功"] = 104
end
instruct_14()  --场景变黑
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(32, 5,0,0,0,0,0,8002,8002,8002,-2,-2,-2)  --修改场景事件
instruct_3(32, 2,0,0,0,0,0,8004,8004,8004,-2,-2,-2)  --修改场景事件
instruct_3(32, 1,0,0,0,0,0,7972,7972,7972,-2,-2,-2)  --修改场景事件
instruct_3(32, 0,0,0,0,0,504,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("Ｌ＜他已得到九阴真经？真的假的呀……＞", 0, 1)  --对话
Cls()  --清屏
do return end
