--OEVENTLUA[507] = function()		--射雕邪杀一灯
    instruct_14();   --  14(E):场景变黑
    instruct_26(61,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,8,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,17,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_26(61,16,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_3(32,12,1,0,512,0,0,7104,7104,7104,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [12]
    instruct_3(41,1,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:场景[山洞]:场景事件编号 [1]
    instruct_13();   --  13(D):重新显示场景
    instruct_30(22,34,19,32);   --  30(1E):主角走动22-34--19-32
    instruct_40(2);   --  40(28):改变主角站立方向2
    say("阿弥陀佛。",65,0);   --  1(1):[一灯]说: 阿弥陀佛
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2090,0,1);   --  1(1):[???]说: 一灯大师，原来是这么慈祥和蔼的老和尚啊……
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2091,56,0);   --  1(1):[黄蓉]说: 大师，这小子不是好东西！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(2092,65,0);   --  1(1):[一灯]说: 不知施主此来，所为何事？
    instruct_0();   --  0(0)::空语句(清屏)

    instruct_47(60,90);   --  47(2F):欧阳锋增加攻击力90
	instruct_37(-10);   --  37(25):增加道德-10
	instruct_1(2093,0,1);   --  1(1):[???]说: 来取你性命！
	instruct_0();   --  0(0)::空语句(清屏)

	if instruct_6(68,3,0,0) ==false then    --  6(6):战斗[68]是则跳转到:Label1
		instruct_15(0);   --  15(F):战斗失败，死亡
		do return; end
	end    --:Label1
	instruct_3(-2,12,1,0,0,0,0,5440,5440,5440,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
	instruct_3(-2,11,1,0,0,0,0,5432,5432,5432,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
	instruct_3(-2,10,1,0,0,0,0,5428,5428,5428,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
	instruct_3(-2,9,1,0,0,0,0,5154,5154,5154,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [9]
	instruct_3(-2,6,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
	instruct_3(-2,7,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [7]
	instruct_3(-2,8,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [8]
	instruct_3(-2,15,0,0,0,0,0,6104,6104,6104,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	instruct_3(-2,14,0,0,0,0,0,8218,8218,8218,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();   --  13(D):重新显示场景
	instruct_2(58,1);	--邪线软猬甲
	instruct_0(); 
	instruct_2(96,1);	--一阳指
	instruct_0(); 
	say("居然给一灯他们跑了……",0,1);
	say("不用追了，以一灯那老和尚的内伤，恐怕也挨不了多久。",60,0);
	instruct_1(2098,67,0);   --  1(1):[裘千仞]说: 这小子还真行啊，哈哈，锋兄，这回华山之上你又少了一个劲敌啊。
	instruct_0();   --  0(0)::空语句(清屏)
	say("我的克儿死了，我还要找黄老邪报仇。小子，我现在就正式收你为徒，教你我的蛤蟆神功。",60,0); 
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_2(73,1);   --  2(2):得到物品[蛤蟆功法][1]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2100,67,0);   --  1(1):[裘千仞]说: 喂，小子，你可是在找《射雕英雄传》一书？
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2101,0,1);   --  1(1):[AAA]说: 是啊，裘帮主知道下落？
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2102,67,0);   --  1(1):[裘千仞]说: 此书就在重阳宫！
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_1(2103,60,0);   --  1(1):[欧阳锋]说: 小子，到重阳宫抢书可不容易，好好练练吧！
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_14();   --  14(E):场景变黑
	instruct_3(-2,14,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
	instruct_3(-2,15,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [15]
	--instruct_3(19,28,0,0,0,0,0,8230,8230,8230,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
	--instruct_3(19,29,0,0,0,0,0,6124,6124,6124,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
	--instruct_3(19,30,0,0,0,0,0,8238,8238,8238,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
	--instruct_3(19,26,0,0,0,0,0,6152,6152,6152,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
	--SetS(19,42,23,3,31)
	--SetS(19,41,31,3,32)
	--SetS(19,42,31,3,33)
	--instruct_3(19,25,0,0,0,0,0,8002,8002,8002,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [25]
	--instruct_3(19,31,0,0,0,0,0,8004,8004,8004,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [31]
	--instruct_3(19,32,0,0,0,0,510,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [32]
	--instruct_3(19,33,0,0,0,0,510,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [33]
	instruct_3(19,0,1,0,510,0,0,-2,-2,-2,-2,-2,-2);   --  3(3):修改事件定义:场景[重阳宫]:场景事件编号 [33]
	instruct_0();   --  0(0)::空语句(清屏)
	instruct_13();   --  13(D):重新显示场景
	do return; end
		