TalkEx("一灯大师、黄岛主、洪帮主*、各位道长，晚辈有礼了", 0, 1)  --对话
Cls()  --清屏
TalkEx("你来啦。我知道你要找《射*雕英雄传》一书，而此书就*在重阳宫中。", 65, 0)  --对话
Cls()  --清屏
TalkEx("啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("既然你已经改邪归正，此书*本当送你。", 69, 0)  --对话
Cls()  --清屏
TalkEx("不过在赠送之前，我们还要*考教考教你的武功。", 57, 0)  --对话
Cls()  --清屏
TalkEx("你准备好了吗？", 65, 0)  --对话
Cls()  --清屏
if instruct_5() then  --是否与之过招
	TalkEx("有架打，怎能少的了我！", 64, 0)  --对话
	Cls()  --清屏
	if WarMain(186, 1) == false then  --战斗开始
		Cls()  --清屏
		instruct_13()  --场景变亮
		TalkEx("看来"..JY.Person[0]["外号"].."还需努力一番才是", 65, 0)  --对话
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx(JY.Person[0]["外号"].."武功高强，佩服佩服。*望"..JY.Person[0]["外号"].."今后能走在正途。", 65, 0)  --对话
	Cls()  --清屏
	instruct_2(148, 1)  --得到或失去物品
	Cls()  --清屏
	instruct_26(61,0,1,0,0)  --修改场景事件
	instruct_26(61,8,1,0,0)  --修改场景事件
	instruct_26(61,17,1,0,0)  --修改场景事件
	instruct_26(61,16,1,0,0)  --修改场景事件
	instruct_3(-2, 0,1,0,499,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(23, 0,1,0,487,0,0,6122,6122,6122,-2,-2,-2)  --修改场景事件
	
	--华山绝顶
	addevent(111, 1, 0, 4140, 3, 0)

	addevent(111, 3, 1, nil, nil, 3552*2)	--欧阳锋
	addevent(111, 2, 1, nil, nil, 4000*2)	--洪七公
	
	--畅想杨过
	if JY.Base["畅想"] == 58 then
		instruct_3(32,12,1,0,512,0,0,7104,7104,7104,-2,-2,-2);   --  3(3):修改事件定义:场景[牛家村]:场景事件编号 [12]
	end
	do return end  --无条件结束事件

end
do return end
