--畅想杨过
if JY.Base["畅想"] == 58 then
	TalkEx("爸爸，你怎么在这？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("你是谁？", 60, 0)  --对话
	Cls()  --清屏
	TalkEx("我是你的儿子，杨过啊。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("Ｌ＜杨过……杨过……＞Ｗ好孩子，真的是你？", 60, 0)  --对话
	Cls()  --清屏
	TalkEx("爸爸，跟我们回去吧。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("不，不，爸爸还有些事情没想清楚。你过来，爸爸先教你一套厉害的武功。", 60, 0)  --对话
	Cls()  --清屏
	local r = JYMsgBox("请选择", "是否要将天赋内功洗为逆运经脉？", {"是","否"}, 2, 58)
	if r == 1 then
		JY.Person[0]["天赋内功"]=104
		JY.Person[0]["武功3"]=104
		JY.Person[0]["武功等级3"]=50
	end
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_2(82, 1)  --得到或失去物品
	Cls()  --清屏
	do return end
else
	TalkEx("Ｌ＜这不是西毒欧阳锋吗？怎么在这倒立……＞", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("乖儿子，快叫爸爸！", 60, 0)  --对话
	Cls()  --清屏
	TalkEx("Ｌ＜不是吧，占我便宜……＞", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("快叫爸爸，爸爸传授高深的武功给你！", 60, 0)  --对话
	Cls()  --清屏
	TalkEx("Ｌ＜高深的武功？＞", 0, 1)  --对话
	Cls()  --清屏
	if instruct_11() == false then  --是/否
		do return end  --无条件结束事件

	end
	instruct_37(-1)  --增加品德
	TalkEx("Ｌ＜你不是我的＞Ｗ爸爸！", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("哈哈哈，乖儿子，我现在就把九阴真经传给你！", 60, 0)  --对话
	Cls()  --清屏
	instruct_2(82, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("不对，不对，我脑子有点不清楚，我要一个人想想……", 60, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end
end