if instruct_16(78) == false then  --是否在队伍
	TalkEx(JY.Person[0]["外号2"].."，你又来干什么？", 130, 0)  --对话
	Cls()  --清屏
	TalkEx("我，没事，随便逛逛……", 0, 1)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件
end
TalkEx("臭蝙蝠，你还认得我吗？", 78, 0)  --对话
Cls()  --清屏
TalkEx("梅超风！你居然还敢找上门来，受死！", 130, 0)  --对话
Cls()  --清屏
if WarMain(189, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
end
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
--instruct_3(41, 1,1,0,516,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("贼汉子，我终于为你报仇了！", 78, 0)  --对话
Cls()  --清屏
instruct_47(78,50)  --增加攻击力
instruct_37(-5)  --增加品德
do return end
