instruct_37(-1)  --增加品德
TalkEx("前辈，我已经杀了江南七怪*！", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈哈，臭蝙蝠终于死了*，贼汉子，我终于替你报了*仇，哈哈哈哈哈哈……", 78, 0)  --对话
Cls()  --清屏
TalkEx("前辈一个人生活在这里恐怕*很不方便，不如搬到我那里*去吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你前辈前辈的叫了半天，我*很老么？", 78, 0)  --对话
Cls()  --清屏
TalkEx("哦，不不不，前辈，哦，不*，您，一点都不老。我就叫*您梅大姐吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈哈，好，我就和你一*起走吧。", 78, 0)  --对话
Cls()  --清屏
instruct_3(104, 77,1,0,979,0,0,7106,7106,7106,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(78)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 78, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 59,1,0,171,0,0,7106,7106,7106,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
