instruct_14()  --场景变黑
instruct_26(40,13,1,0,0)  --修改场景事件
instruct_26(40,16,1,0,0)  --修改场景事件
instruct_26(40,15,1,0,0)  --修改场景事件
instruct_26(40,14,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(49,36,41,36)  --场景移动
TalkEx("哎哟，你干嘛？", 90, 0)  --对话
Cls()  --清屏
TalkEx("哼！小姑娘，劝你还是老实点！说，刚才那个傻乎乎的公子哥跑哪去了？", 203, 0,"神龙教徒")  --对话
Cls()  --清屏
TalkEx("我怎么知道！我还想找他呢！哎呦，救命啊——", 90, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，你喊啊，这荒郊野外的，你喊破喉咙也没有人来就你！", 203, 0,"神龙教徒")  --对话
Cls()  --清屏
TalkEx("破喉咙，破喉咙——", 90, 0)  --对话
Cls()  --清屏
TalkEx("光天化日之下，几个大男人，欺负一个小姑娘，成何体统！", 0, 1)  --对话
Cls()  --清屏
TalkEx("关你屁事！快给老子滚蛋！少他妈找麻烦！", 203, 0,"神龙教徒")  --对话
Cls()  --清屏
TalkEx("麻烦？嘿嘿，我就偏爱找麻烦，你能把我怎么样？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，你找死！", 203, 0,"神龙教徒")  --对话
Cls()  --清屏
if WarMain(190, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 1,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_19(41, 37)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
TalkEx("谢谢你救了我。", 90, 0)  --对话
Cls()  --清屏
TalkEx("姑娘在这里做什么？怎么招惹到这些家伙？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我也不知道啊。那个无量剑派在比剑，我觉得好玩，来看看热闹。那知道神龙教来了，两边就打起来了。我的闪电貂不小心咬伤了他们几个人，他们就抓着我不放。", 90, 0)  --对话
Cls()  --清屏
TalkEx("闪电貂？", 0, 1)  --对话
Cls()  --清屏
TalkEx("是啊，我养的闪电貂，好可爱的。可是不知道跑到哪里去了。", 90, 0)  --对话
Cls()  --清屏
TalkEx("他们说的\"傻乎乎的公子哥\"是怎么回事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哎呀，你不说我都忘了，是段誉段大哥，刚才还在的，不知道跑到哪里去了。应该就在这附近的，这位大哥，我们一起去找他好不好？", 90, 0)  --对话
Cls()  --清屏
if instruct_9() then  --是否要求加入
	instruct_3(104, 67,1,0,991,0,0,7252,7252,7252,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		TalkEx("好啊，我们一起走吧。", 0, 1)  --对话
		Cls()  --清屏
		instruct_3(-2, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		instruct_10(90)  --加入队伍
		instruct_3(42, 11,1,0,519,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去小村吧。", 90, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(70, 53,1,0,195,0,0,7038,7038,7038,-2,-2,-2)  --修改场景事件
	instruct_3(42, 11,1,0,519,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("啊？像我这么可爱的女生要和你同行，居然拒绝？", 90, 0)  --对话
Cls()  --清屏
instruct_3(-2, 0,1,0,518,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
