TalkEx("他们说的\"傻乎乎的公子哥\"*是怎么回事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哎呀，你不说我都忘了，是*段誉段大哥，刚才还在的，*不知道跑到哪里去了。应该*就在这附近的，这位大哥，*我们一起去找他好不好？", 90, 0)  --对话
Cls()  --清屏
if instruct_9() then  --是否要求加入
	if instruct_20() == false then  --判断队伍是否已满
		TalkEx("好啊，我们一起走吧。", 0, 1)  --对话
		Cls()  --清屏
		instruct_3(-2, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
		Cls()  --清屏
		instruct_10(90)  --加入队伍
		Cls()  --清屏
		instruct_3(42, 11,1,0,519,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去*小村吧。", 90, 0)  --对话
	Cls()  --清屏
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(70, 53,1,0,195,0,0,7038,7038,7038,-2,-2,-2)  --修改场景事件
	instruct_3(42, 11,1,0,519,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("啊？像我这么可爱的女生要*和你同行，居然拒绝？", 90, 0)  --对话
Cls()  --清屏
Cls()  --清屏
do return end
