TalkEx("神仙姐姐……神仙姐姐……*我都听你的……", 53, 0)  --对话
Cls()  --清屏
TalkEx("喂！", 0, 1)  --对话
Cls()  --清屏
TalkEx("嘘，神仙姐姐面前，不要说*话这么大声，要斯文些……*咦？你是谁？", 53, 0)  --对话
Cls()  --清屏
TalkEx("你就是段誉吧，钟灵姑娘托*我来找你。", 0, 1)  --对话
Cls()  --清屏
TalkEx("对了，钟姑娘，我差点忘了*，她还好吧？", 53, 0)  --对话
Cls()  --清屏
instruct_35(53,0,85,50)  --段誉洗北冥
instruct_35(53,1,147,400)  --段誉洗凌波
if instruct_16(90) == false then  --是否在队伍
	TalkEx("请放心，钟姑娘现在很安全*。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("哦，那我就放心了。", 53, 0)  --对话
	Cls()  --清屏
	TalkEx("段公子，我们走吧。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("走？是啊，神仙姐姐，我得*走了，出来这么久，爹爹肯*定会派人四处找我的。", 53, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 3,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 2,0,0,0,0,0,6752,6752,6752,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	TalkEx("他的身法好快，完全看不清*楚，不知道是什么古怪步法*！", 0, 1)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("段大哥放心，我没事，这位*大哥救了我。", 90, 1)  --对话
Cls()  --清屏
TalkEx("哦，那我就放心了。", 53, 0)  --对话
Cls()  --清屏
TalkEx("段公子，我们走吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("走？是啊，神仙姐姐，我得*走了，出来这么久，爹爹肯*定会派人四处找我的。", 53, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,520,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,6752,6752,6752,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("他的身法好快，完全看不清*楚，不知道是什么古怪步法*！", 0, 1)  --对话
Cls()  --清屏
do return end
