TalkEx("好大一只蛤蟆！", 0, 1)  --对话
Cls()  --清屏
if WarMain(78, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(99, 0,0,0,0,0,0,6308,6308,6308,-2,-2,-2)  --修改场景事件
instruct_3(99, 1,0,0,0,0,0,7126,7126,7126,-2,-2,-2)  --修改场景事件
instruct_3(99, 2,0,0,0,0,0,7128,7128,7128,-2,-2,-2)  --修改场景事件
instruct_3(99, 3,0,0,0,0,0,5330,5330,5330,-2,-2,-2)  --修改场景事件
instruct_3(99, 4,0,0,0,0,0,7986,7986,7986,-2,-2,-2)  --修改场景事件
instruct_3(99, 7,0,0,0,0,521,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("真玄，差点成为这蛤蟆的晚*餐！", 0, 1)  --对话
Cls()  --清屏
instruct_2(26, 1)  --得到或失去物品
Cls()  --清屏
do return end
