instruct_14()  --场景变黑
instruct_26(40,13,1,0,0)  --修改场景事件
instruct_26(40,16,1,0,0)  --修改场景事件
instruct_26(40,15,1,0,0)  --修改场景事件
instruct_26(40,14,1,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(34,38,39,38)  --人物移动
TalkEx("你们是什么人？抓我干什么？", 53, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿嘿，这小子有用，带回去。", 98, 0)  --对话
Cls()  --清屏
TalkEx("救命啊，救命啊，你们这些恶人，放开我！", 53, 0)  --对话
Cls()  --清屏
TalkEx("咦？你怎么知道我们是恶人？", 44, 0)  --对话
Cls()  --清屏
TalkEx("老三，不要和他废话，把他带走！", 98, 0)  --对话
Cls()  --清屏
TalkEx("你们是什么人，快放开段公子。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，这"..JY.Person[0]["外号2"].."也一并抓了！", 98, 0)  --对话
Cls()  --清屏
--岳老三血量翻倍
JY.Person[44]["血量翻倍"] = JY.Person[592]["血量翻倍"]
		
if WarMain(191, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
--岳老三血量翻倍
JY.Person[44]["血量翻倍"] = 1

instruct_19(41, 36)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
instruct_2(179, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("还有两下子，我们走！", 98, 0)  --对话
Cls()  --清屏
TalkEx("老大，我还是不明白，他怎么知道我们是恶人的？", 44, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 1,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("段公子，你没事吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好，多谢"..JY.Person[0]["外号"].."相救。", 53, 0)  --对话
Cls()  --清屏
TalkEx("世子，总算找到你了。", 101, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 8,0,0,0,0,0,6052,6052,6052,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("世子，你还好吧？", 101, 0)  --对话
Cls()  --清屏
TalkEx("朱叔叔，你来啦。", 53, 0)  --对话
Cls()  --清屏
TalkEx("王爷很担心你。听说四大恶人已经来到大理。", 101, 0)  --对话
Cls()  --清屏
TalkEx("四大恶人？我刚才差点让他们抓住。多亏这位"..JY.Person[0]["外号"].."救了我。", 53, 0)  --对话
Cls()  --清屏
TalkEx("大理朱丹臣在此谢过"..JY.Person[0]["外号"].."。", 101, 0)  --对话
Cls()  --清屏
TalkEx("不必客气。我看那四大恶人恐怕不会就此善罢甘休，段公子还是找个安全的所在比较好。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."言之有理。世子，我们就去天龙寺吧。", 101, 0)  --对话
Cls()  --清屏
TalkEx("也好，我好久没见过枯荣大师了。这位"..JY.Person[0]["外号"].."，咱们就此别过，后会有期。", 53, 0)  --对话
Cls()  --清屏
TalkEx("后会有期。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(16, 20,0,0,0,0,523,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
