instruct_37(1)  --增加品德
instruct_26(40,13,1,0,0)  --修改场景事件
instruct_26(40,16,1,0,0)  --修改场景事件
instruct_26(40,15,1,0,0)  --修改场景事件
instruct_26(40,14,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_25(30,44,30,24)  --场景移动
Cls()  --清屏
TalkEx("吐蕃国晚辈鸠摩智，参见前辈大师。有常无常，双树枯荣，南北西东，非假非空。", 103, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜大轮明王博学精深，果然名不虚传，一见面就道破了我所参枯禅的来历＞Ｗ明王远来，老衲未克远迎。明王慈悲。", 102, 0)  --对话
Cls()  --清屏
TalkEx("天龙威名，小僧素所敬慕，今日得见庄严宝相，大是欢喜。", 103, 0)  --对话
Cls()  --清屏
TalkEx("不知明王此来，有何赐教？", 102, 0)  --对话
Cls()  --清屏
TalkEx("不敢。小僧生平有一至交，是大宋姑苏人氏，复姓慕容，单名一个\"博\"字。不意大英雄天不假年，慕容先生西归极乐。慕容先生当年论及天下剑法，深信大理天龙寺\"六脉神剑\"为天下诸剑中第一，恨未得见，引为平生最大憾事。小僧今日此来，便是想借贵寺《六脉神剑经》，焚于慕容先生坟前，以告慰其在天之灵。", 103, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_19(32, 26)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你这番僧好没道理，人家好好的剑谱，你居然要拿去烧了，岂有此理！", 0, 0)  --对话
Cls()  --清屏
TalkEx("这位施主可是天龙寺之人？", 103, 0)  --对话
Cls()  --清屏
TalkEx("不是！怎么样？我是段公子的朋友。听了你刚才那些话，想想我就来气，你到底有什么能耐，这么放肆！", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."是要考教小僧的武艺了？", 103, 0)  --对话
Cls()  --清屏
TalkEx("少废话！你要抢经，先过我这关！", 0, 1)  --对话
Cls()  --清屏
TalkEx("良机莫失，凝神观剑，自观自学，不违祖训。", 102, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜枯荣大师这句话是对我说的？让我自行学习六脉神剑？＞", 53, 0)  --对话
Cls()  --清屏
instruct_35(53,2,49,200)  --段誉洗六脉
if WarMain(100, 1) == false then  --战斗开始
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("Ｌ＜这番僧可真厉害！＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊，枯荣大师，你——", 103, 0)  --对话
Cls()  --清屏
TalkEx("阿弥陀佛——", 102, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜枯荣这老僧自知不敌，竟然将图谱烧了……他在烧图谱之前，已命那蓝衫少年默默记诵，还当我不知？哼，既然没了死图谱，我要活图谱也是一样！……＞", 103, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你干什么？", 53, 0)  --对话
Cls()  --清屏
TalkEx("这位小施主心中记得六脉神剑的图谱，原来的图谱已烧，小施主就是活图谱。在慕容先生坟前将他活活烧死，也是一样，哈哈哈，贫僧去也——", 103, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(52, 0,0,0,0,0,529,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(52, 17,0,0,0,0,0,6312,6312,6312,-2,-2,-2)  --修改场景事件
instruct_3(52, 14,0,0,0,0,0,4153*2,4153*2,4153*2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
