instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(48,21,48,16)  --人物移动
instruct_30(48,16,44,16)  --人物移动
if JY.Person[0]["性别"] == 0 then
	TalkEx("两位姑娘，小生这相有礼了。", 0, 1)  --对话
else
	TalkEx("两位姑娘，小妹这相有礼了。", 0, 1)  --对话
end
Cls()  --清屏
TalkEx("你是谁？来这里做什么？", 105, 0)  --对话
Cls()  --清屏
TalkEx("我是段公子的朋友。这个大和尚抓了段公子，说要来慕容老先生的坟前将他火化。", 0, 1)  --对话
Cls()  --清屏
TalkEx("啊--这，这可是真的？", 104, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，小姑娘不必害怕。我与慕容老先生乃是至交，曾许愿要将六脉神剑的图谱给他一观。如今真图谱已被毁掉，而这位段公子的心中却记得整个图谱，是以贫僧将其抓来，在慕容老先生坟前火化，以实践先前的诺言。", 103, 0)  --对话
Cls()  --清屏
TalkEx("大和尚胡说八道，如果这位段公子会六脉神剑，还能乖乖听你的话吗？", 105, 0)  --对话
Cls()  --清屏
TalkEx("那是因为贫僧点了他的穴道，姑娘如果不信，在下就解开他的穴道。段公子，请你施展一下六脉神剑的绝世神功，给两位姑娘看看吧。", 103, 0)  --对话
Cls()  --清屏
TalkEx("我根本就不会任何武功！", 53, 0)  --对话
Cls()  --清屏
TalkEx("二位别吵了，我家公子不在，我们两个做丫鬟的也不方便作主。请二位稍安勿躁，小女子愿抚琴一曲，以奉雅客。", 104, 0)  --对话
Cls()  --清屏
TalkEx("能在如此玲珑雅致的地方听姐姐抚琴，明日就算给这大和尚烧了，也算不枉此生了。", 53, 0)  --对话
Cls()  --清屏
TalkEx("你倒是嘴甜，你且来看一下，识得这琴么？", 105, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜哼，故弄玄虚，谅你们也逃不出我的手心＞", 103, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_17(-2,1,39,17,1708)  --设置场景的值
instruct_17(-2,1,45,17,1954)  --设置场景的值
instruct_17(-2,1,44,17,1708)  --设置场景的值
instruct_17(-2,1,43,17,1708)  --设置场景的值
instruct_17(-2,1,42,17,1708)  --设置场景的值
instruct_17(-2,1,41,17,1708)  --设置场景的值
instruct_17(-2,1,40,17,1708)  --设置场景的值
instruct_17(-2,1,45,14,1702)  --设置场景的值
instruct_17(-2,1,45,15,1702)  --设置场景的值
instruct_17(-2,1,45,16,1702)  --设置场景的值
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,6308,6308,6308,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("啊哟，不好！", 103, 0)  --对话
Cls()  --清屏
TalkEx("那番僧追不过来了。二位不妨在此小住一晚，明日我家公子就回来了。", 104, 0)  --对话
Cls()  --清屏
TalkEx("如此甚好。", 53, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(31, 15)  --设置人物XY坐标
instruct_40(3)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
do return end
