instruct_14()  --场景变黑
instruct_26(3,3,1,0,0)  --修改场景事件
instruct_26(3,2,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,5218,5218,5218,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,5220,5220,5220,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,5220,5220,5220,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,6770,6770,6770,-2,-2,-2)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,6774,6774,6774,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(35,26,26,26)  --场景移动
TalkEx("这里东西都是我的，是我的*，谁敢和我抢！", 138, 0)  --对话
Cls()  --清屏
if WarMain(91, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
