TalkEx("阁下是谁，到这燕子坞来所为何事？", 51, 0)  --对话
Cls()  --清屏
TalkEx("在下之名不足挂齿，本来我是来救段公子的，不过到得此地，却发现慕容公子可以为在下指点迷津。", 0, 1)  --对话
Cls()  --清屏
TalkEx("阁下有话就直说吧。", 51, 0)  --对话
Cls()  --清屏
TalkEx("江湖中盛传，姑苏慕容家中藏书丰富，天下武林奇书尽皆收录……", 0, 1)  --对话
Cls()  --清屏
TalkEx("原来是想看我慕容家丰富的武功秘笈……", 51, 0)  --对话
Cls()  --清屏
TalkEx("慕容公子误会了，在下要找的，不是什么武功秘笈，只是几本小说而已。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是说……", 51, 0)  --对话
Cls()  --清屏
TalkEx("十四天书！！", 0, 1)  --对话
Cls()  --清屏
TalkEx("对不起，燕子坞的藏书并没有阁下想要的。", 51, 0)  --对话
Cls()  --清屏
TalkEx("哦！是这样子啊……", 0, 1)  --对话
Cls()  --清屏
TalkEx("不过……", 51, 0)  --对话
Cls()  --清屏
TalkEx("不过什么……？", 0, 0)  --对话
Cls()  --清屏
TalkEx("不过其中一本书的下落，我是知道的……", 51, 0)  --对话
Cls()  --清屏
TalkEx("哪一本书？", 0, 1)  --对话
Cls()  --清屏
TalkEx("《天龙八部》。", 51, 0)  --对话
Cls()  --清屏
TalkEx("真的？在哪里？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我姑苏慕容家的成名绝技你可知道？", 51, 0)  --对话
Cls()  --清屏
TalkEx("以彼之道，还施彼身。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不错。所以你要知道《天龙八部》的下落，就要先帮我找一些东西。", 51, 0)  --对话
Cls()  --清屏
TalkEx("不知公子要找什么东西？", 0, 1)  --对话
Cls()  --清屏
TalkEx("大燕国的传国玉玺。", 51, 0)  --对话
Cls()  --清屏
TalkEx("你要玉玺？难倒你……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不错，我乃大燕慕容王孙。", 51, 0)  --对话
Cls()  --清屏
TalkEx("失敬，失敬。", 0, 1)  --对话
Cls()  --清屏
TalkEx("记得，你若想知道《天龙八部》的下落，就快去找大燕国的传国玉玺。", 51, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,543,545,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
