if instruct_4(196) == false then  --是否使用物品
	do return end  --无条件结束事件

end
instruct_32(196,-1)  --得到或失去物品
TalkEx("慕容公子，你要找的大燕国传国玉玺在这里。", 0, 1)  --对话
Cls()  --清屏
TalkEx("真的找到了！有了它，我大燕复国有望。", 51, 0)  --对话
Cls()  --清屏
TalkEx("那慕容公子可否履行诺言，告知在下《天龙八部》一书的下落。", 0, 1)  --对话
Cls()  --清屏
TalkEx("等会，有了传国玉玺并不能证明我慕容复的身份，那么别人就不会听我号召……大燕皇帝世系谱表呢？大燕皇帝世系谱表呢？", 51, 0)  --对话
Cls()  --清屏
TalkEx("慕容公子并未叫我找那什么大燕皇帝世系谱表啊！", 0, 1)  --对话
Cls()  --清屏
TalkEx("没有大燕皇帝世系谱表，别人怎会相信我慕容复是王孙的后代。你快去找大燕皇帝世系谱表，找到了我才跟你说《天龙八部》的下落。", 51, 0)  --对话
Cls()  --清屏
TalkEx("表哥，做人怎可言而无信，你说好要告诉这位公子的，怎可反悔。你不说，我可要告诉他了。", 76, 0)  --对话
Cls()  --清屏
TalkEx("你敢！", 51, 0)  --对话
Cls()  --清屏
TalkEx("…………", 76, 0)  --对话
Cls()  --清屏
TalkEx("好，我就再信你一次，去帮你找那什么世系谱表。希望到时慕容公子别再失信。", 0, 1)  --对话
Cls()  --清屏
TalkEx("记得，若你想知道《天龙八部》的下落，就快去找大燕皇帝世系谱表。", 51, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,546,547,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
