TalkEx("请问是乔帮主吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("很好，年纪轻轻，就破了我丐帮的打狗阵，现在的年轻人是越来越厉害了。", 50, 0)  --对话
Cls()  --清屏
TalkEx("那里，比起乔帮主，统领这么多英雄好汉，在下还差的远了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("一群叫化子，没什么。不知"..JY.Person[0]["外号"].."来我丐帮有什么要事吗？", 50, 0)  --对话
Cls()  --清屏
TalkEx("没什么特别的。小弟初涉江湖，当然要来丐帮拜访一下，否则怎么称的上是江湖中人。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不知江湖行的感觉如何？", 50, 0)  --对话
Cls()  --清屏
TalkEx("辛酸，甘甜皆有。有许多事情要去解决，但也学会了许多武功，随着日子一天天过去，觉得自己越发充实。不过江湖上，人心险恶，但我等又脱离不了这江湖，真是所谓”人在江湖，身不由己”。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈！哈！说的好，说的好，别提这些恼人的事了，咱们喝酒。", 50, 0)  --对话
Cls()  --清屏
TalkEx("好。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,0,0,554,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
