TalkEx("今日阳光明媚，*一群乞丐开会，*不是英雄好汉，*请退！", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
if instruct_5() == false then  --是否与之过招
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("我就来试试丐帮打狗大阵！", 0, 1)  --对话
Cls()  --清屏
if WarMain(82, 0) == false then  --战斗开始
	TalkEx("今日阳光明媚，*一群乞丐开会，*不是英雄好汉，*请退！", 207, 0,"丐帮弟子")  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("阁下武功了得，我们乔帮主*一定会很欣赏你的。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
do return end
