instruct_26(40,13,1,0,0)  --修改场景事件
instruct_26(40,16,1,0,0)  --修改场景事件
instruct_26(40,15,1,0,0)  --修改场景事件
instruct_26(40,14,1,0,0)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,6152,6152,6152,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,5132,5132,5132,-2,-2,-2)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,7130,7130,7130,-2,-2,-2)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,5136,5136,5136,-2,-2,-2)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,7990,7990,7990,-2,-2,-2)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,6310,6310,6310,-2,-2,-2)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,6086,6086,6086,-2,-2,-2)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,6086,6086,6086,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(39,30,16,28)  --场景移动
local r = JYMsgBox("请选择", "是否体验翔实剧情？", {"是","否"}, 2, 50)
if r == 1 then

TalkEx("这位是天台山智光大师、这两位是冲霄洞谭氏伉俪、这几位是姑苏慕容公子及其亲随，这位是……", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
TalkEx("我叫\"赵钱孙李，周吴郑王\"，我没名字，这个世界上，我只关心小娟一人。", 251, 0,"赵钱孙")  --对话
Cls()  --清屏
TalkEx("唉，师兄……", 252, 0,"谭婆")  --对话
Cls()  --清屏
TalkEx("你，哼！", 253, 0,"谭公")  --对话
Cls()  --清屏
TalkEx("各位同来我丐帮，不知所为何事？", 50, 0)  --对话
Cls()  --清屏
TalkEx("我们今天来，是为了武林同道和丐帮的兄弟们着想，来澄清一件大事。智光大师，就请你把雁门关外乱石谷前的大战，讲述给大家听罢。", 51, 0)  --对话
Cls()  --清屏
TalkEx("唉，杀孽太重，杀孽太重……", 250, 0,"智光大师")  --对话
Cls()  --清屏
TalkEx("此事关系武林安危，关乎我大宋命运以及丐帮的前途，还请智光大师不要推辞。", 51, 0)  --对话
Cls()  --清屏
TalkEx("好，老衲从前做错了事，也不必隐瞒，照实说来便是。那是三十年前，中原豪杰接到讯息，说契丹国有大批武士来偷袭少林，想将寺中秘藏数百年的武功图谱，一举夺去……", 250, 0,"智光大师")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("……最后我们把那个契丹男婴寄养在少室山下的农家。", 250, 0,"智光大师")  --对话
Cls()  --清屏
TalkEx("智光大师，那……那少室山下的农人，他，他，他姓什么？", 50, 0)  --对话
Cls()  --清屏
TalkEx("你既已猜到，我也不必隐瞒。那农人姓乔，名字叫做三槐。", 250, 0,"智光大师")  --对话
Cls()  --清屏
TalkEx("不，不！你胡说八道，捏造了这么一篇鬼话来诬陷我……", 50, 0)  --对话
Cls()  --清屏
TalkEx("汉人也不是什么都好，契丹人也不是猪狗不如。明明是契丹人，却硬要冒充汉人。嘿嘿，嘿嘿……", 251, 0,"赵钱孙")   --对话
Cls()  --清屏
TalkEx("谭氏伉俪，还有这位赵钱孙，当年都曾参加乱石谷血战，难道大家都在一起骗你不成？乔峰，这是汪帮主的亲笔遗书，你自己看吧！", 51, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
Cls()  --清屏
TalkEx("……这丐帮帮主，我是决计不当了……青山不改，绿水长流，众位好兄弟，咱们再见了。乔某是汉人也好，是契丹人也好，有生之年，决不伤一条汉人的性命！告辞了。", 50, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这乔帮主，真是英雄啊＞", 104, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这回逼走了乔峰，丐帮群龙无首，应该比较容易控制，日后复兴大燕，丐帮应是个有力的帮手。不过此时不宜太张扬＞Ｗ各位丐帮的长老、兄弟们，我们今日此来，是为了天下苍生，是为了千千万万大宋的黎民百姓。既然此事已真像大白，在下也当告辞。", 51, 0)  --对话
Cls()  --清屏
TalkEx("我们也走吧。", 253, 0,"谭公")  --对话
Cls()  --清屏
TalkEx("小娟……", 251, 0,"赵钱孙")  --对话
Cls()  --清屏
TalkEx("阿弥陀佛……", 250, 0,"智光大师")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,1,0,557,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,557,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_19(41, 30)  --设置人物XY坐标
instruct_3(100, 3,1,0,558,0,0,6226,6226,6226,-2,-2,-2)  --修改场景事件
instruct_3(66, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(66, 7,1,0,560,0,0,6524,6524,6524,-2,-2,-2)  --修改场景事件
instruct_3(66, 0,1,0,559,0,0,5432,5432,5432,-2,-2,-2)  --修改场景事件
instruct_3(66, 5,0,0,559,0,0,5436,5436,5436,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("乔帮主是契丹人？这是真的么？我再去找这几个证人问问看。", 0, 1)  --对话
Cls()  --清屏
do return end
elseif r == 2 then
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,1,0,557,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,557,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_19(41, 30)  --设置人物XY坐标
instruct_3(100, 3,1,0,561,0,0,6226,6226,6226,-2,-2,-2)  --修改场景事件
instruct_3(66, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(66, 7,1,0,560,0,0,6524,6524,6524,-2,-2,-2)  --修改场景事件
instruct_3(66, 0,1,0,562,0,0,5432,5432,5432,-2,-2,-2)  --修改场景事件
instruct_3(66, 5,0,0,562,0,0,5436,5436,5436,-2,-2,-2)  --修改场景事件
null(40,7)--洛阳路过事件
instruct_3(54, 0,1,0,568,569,0,6416,6416,6416,-2,-2,-2)  --修改场景事件
instruct_3(51, 25,1,0,570,0,0,6264,6264,6264,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
say("Ｄ〔剧情提示〕Ｗ与丐帮弟子对话开启少林大战",0,2)
instruct_37(5)
do return end
end