instruct_26(40,13,1,0,0)  --修改场景事件
instruct_26(40,16,1,0,0)  --修改场景事件
instruct_26(40,15,1,0,0)  --修改场景事件
instruct_26(40,14,1,0,0)  --修改场景事件
TalkEx("薛神医，你好。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！", 45, 0)  --对话
Cls()  --清屏
TalkEx("阿朱姑娘好。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，你来啦。", 104, 0)  --对话
else
	TalkEx("妹子，你来啦。", 104, 0)  --对话
end
Cls()  --清屏
TalkEx("阿朱姑娘，乔帮主他……", 0, 1)  --对话
Cls()  --清屏
TalkEx("你放心，乔大哥用最后的内力救了你，本来已经到了任人宰割的地步，谁料突然来了一个黑衣人，武功十分高强，救走了乔大哥。", 104, 0)  --对话
Cls()  --清屏
TalkEx("黑衣人……", 0, 1)  --对话
Cls()  --清屏
TalkEx("薛神医，谢谢你的回春妙手，如今我已痊愈，就此告辞。", 104, 0)  --对话
Cls()  --清屏
TalkEx("…………", 45, 0)  --对话
Cls()  --清屏
TalkEx("嗯……这个……阿朱姑娘，是否要去寻找乔大哥？", 0, 1)  --对话
Cls()  --清屏
TalkEx("嗯，这个自然。", 104, 0)  --对话
Cls()  --清屏
TalkEx("你见到乔大哥，能否替我问他一件事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么事？", 104, 0)  --对话
Cls()  --清屏
TalkEx("听说十四天书中的《天龙八部》在乔大哥身上……", 0, 1)  --对话
Cls()  --清屏
TalkEx("你……你是为了天书才帮乔大哥的？", 104, 0)  --对话
Cls()  --清屏
TalkEx("阿朱姑娘，你太小看在下了。在下是要夺取天书不假。可是在下向来仰慕乔帮主的为人。如果此书确在乔帮主身上，我会苦练武功，与乔帮主堂堂正正的比试一场，光明正大的获得此书！", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，乔大哥能有你这样一位兄弟，我真替他高兴。", 104, 0)  --对话
else
	TalkEx("妹子，乔大哥能有你这样一位朋友，我真替他高兴。", 104, 0)  --对话
end
Cls()  --清屏
TalkEx("阿朱姑娘过奖了。乔大哥能有你这样一位红颜知己，才真是令人羡慕啊。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("呵呵……小兄弟，我要去寻找乔大哥了，咱们就此别过。", 104, 0)  --对话
else
	TalkEx("呵呵……妹子，我要去寻找乔大哥了，咱们就此别过。", 104, 0)  --对话
end
Cls()  --清屏
TalkEx("好，后会有期。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,1,0,568,569,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(51, 25,1,0,570,0,0,6264,6264,6264,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
