if instruct_4(200) == false then  --是否使用物品
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("这……这是我逍遥派掌门之信物，怎会在阁下手中？", 45, 0)  --对话
Cls()  --清屏
TalkEx("你师祖已将逍遥派掌门传给我兄弟了……事情是这样的……你师父跟我们说，如果有需要医术高明的人加入的话，可以来这边找你。", 0, 1)  --对话
Cls()  --清屏
TalkEx("是，"..JY.Person[0]["外号"].."有什么需要，在下将全力配合。", 45, 0)  --对话
Cls()  --清屏
TalkEx("你的医术很高明，就加入我的队伍，日后也能帮我们治病疗伤。", 0, 1)  --对话
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	TalkEx("是。", 45, 0)  --对话
	Cls()  --清屏
	instruct_3(104, 58,1,0,959,0,0,6416,6416,6416,-2,-2,-2)  --修改场景事件
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_10(45)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 45, 0)  --对话
Cls()  --清屏
instruct_3(70, 12,1,0,131,0,0,6416,6416,6416,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
do return end
