TalkEx("王姑娘，段公子，你们还在这啊？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我……我在等我表哥……", 76, 0)  --对话
Cls()  --清屏
TalkEx("我要陪着王姑娘。", 53, 0)  --对话
Cls()  --清屏
TalkEx("王姑娘一心想着慕容公子，可是慕容公子的心里只有复兴大燕。段公子一心想着王姑娘，可是王姑娘的心里却只有慕容公子。唉……", 0, 1)  --对话
Cls()  --清屏
TalkEx("这……我表哥他……", 76, 0)  --对话
Cls()  --清屏
TalkEx("王姑娘，我会帮你劝慕容公子，让他回心转意的。", 53, 0)  --对话
Cls()  --清屏
TalkEx("段公子，你……你对我真好……这位"..JY.Person[0]["外号"].."说的对，我表哥心里只有复兴大燕，根本没有我。段公子，我以前一直待你不好，你……还愿意接受我吗？", 76, 0)  --对话
Cls()  --清屏
TalkEx("愿意愿意，只要能让你开心，我什么都愿意。", 53, 0)  --对话
Cls()  --清屏
TalkEx("我总听你说，有个石像和我一模一样，你能带我去看看吗？", 76, 0)  --对话
Cls()  --清屏
TalkEx("好啊好啊，我们这就走。少侠，多谢你了，后会有期。", 53, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 61,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 60,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(42, 6,1,0,573,0,0,6308,6308,6308,-2,-2,-2)  --修改场景事件
instruct_3(42, 7,1,0,573,0,0,6296,6296,6296,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
