instruct_37(2)  --增加品德
say("段公子好，王姑娘好。恭喜段公子终于虏获美人心。", 0, 1)  --对话
Cls()  --清屏
say("呵呵，这都多亏了"..JY.Person[0]["外号"].."的帮忙啊。", 53, 0)  --对话
Cls()  --清屏
say("哪里哪里，我不曾帮过任何的忙，都是段公子精诚所至，金石为开啊。但不知慕容公子……", 0, 1)  --对话
Cls()  --清屏
say("我表哥他……他心里只有那个虚无缥缈的皇帝梦……我现在才知道，真心待我的只有段公子一个人。", 76, 4)  --对话
Cls()  --清屏
say("语嫣……这位"..JY.Person[0]["外号"].."帮了我们这么多，我们也帮帮他吧。", 53, 0)  --对话
Cls()  --清屏
say("好啊，那我们就去小村吧。", 76, 4)  --对话
Cls()  --清屏
say(JY.Person[0]["外号"].."不妨看看这玉像，或许会有所参悟。", 53, 0)  --对话
Cls()  --清屏
--钟灵洗六脉
if inteam(90) then
	say("妹子，这是我们大理段氏的绝学，你也练一下吧。", 53, 0)
	say("谢谢大哥。", 90, 1)
	instruct_35(90,0,49,50)
	SetTianWai(90, 1, 49)
end
instruct_14()  --场景变黑
instruct_3(104, 59,1,0,965,0,0,6308,6308,6308,-2,-2,-2)  --修改场景事件
instruct_3(104, 51,1,0,977,0,0,6296,6296,6296,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 9,1,0,143,0,0,6310,6310,6310,-2,-2,-2)  --修改场景事件
instruct_3(70, 27,1,0,167,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
addevent(-2, 1, 1, 4114, 1, -2)	--凌波微步事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
