instruct_14()  --场景变黑
instruct_3(40, 16,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 15,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 14,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 13,1,0,655,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,557,0,0,6266,6266,6266,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,557,0,0,6268,6268,6268,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,6152,6152,6152,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,5132,5132,5132,-2,-2,-2)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,7130,7130,7130,-2,-2,-2)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,5136,5136,5136,-2,-2,-2)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,7990,7990,7990,-2,-2,-2)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,31552,31552,31552,-2,-2,-2)  --段誉
instruct_3(-2, 12,1,0,591,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,591,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(39,30,16,29)  --人物移动
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_32(216,-1)  --得到或失去物品
TalkEx("乔峰，你看这是什么？", 0, 4)  --对话
Cls()  --清屏
TalkEx("是什么？", 50, 0)  --对话
Cls()  --清屏
TalkEx("你看了便知道。", 0, 4)  --对话
Cls()  --清屏
TalkEx("这……这是真的吗？", 50, 0)  --对话
Cls()  --清屏
TalkEx("少林方丈亲笔写的，会是假的吗！", 0, 4)  --对话
Cls()  --清屏
TalkEx("我今日请来了智光大师、谭公、谭婆、赵钱孙等人，他们都可以作证。", 51, 0)  --对话
Cls()  --清屏
TalkEx("我……我……我不是汉人…………我是契丹人…………", 50, 0)  --对话
Cls()  --清屏
TalkEx("乔峰，你是契丹人，非我族类，其心必异，怎可担任这丐帮帮主一职，保管《天龙八部》一书呢！", 0, 1)  --对话
Cls()  --清屏
TalkEx("Ｌ＜深吸了一口气，两道冷电似的目光霍地在你脸上转了两转＞Ｗ你想怎样？", 50, 0)  --对话
Cls()  --清屏
TalkEx("辞去丐帮帮主之位，交出《天龙八部》一书。", 0, 4)  --对话
Cls()  --清屏
TalkEx("我明白了，你我素昧平生，却费尽心机来害乔某，想得此书才是你真正的目的吧？", 50, 0)  --对话
Cls()  --清屏
TalkEx("嘿嘿，丐帮帮主一位，乔某自会辞去。可惜阁下机关算尽，《天龙八部》一书却不在我手上。", 50, 0)  --对话
Cls()  --清屏
TalkEx("非也非也，我明明收到消息，《天龙八部》一书就在你的手上。今日天下英雄在此，抵赖又有何用？", 51, 4)  --对话
Cls()  --清屏
TalkEx("Ｌ＜冷笑道＞Ｗ江湖上人称『北乔峰，南慕容』，想我乔某大好男儿，竟与你这种人齐名～～", 50, 0)  --对话
Cls()  --清屏
TalkEx("乔某自会去查明事实真相，告辞！", 50, 0)  --对话
Cls()  --清屏
TalkEx("大哥，此间必有重大误会，等等小弟……", 53, 4)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
null(-2,14)
null(-2,44)
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("阁下来此，揭发乔峰的真实身份，让我丐帮不致误奉一契丹人为帮主，很是感激。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
TalkEx("没什么，这是中原武林的大事，小弟应该做的。", 0, 4)  --对话
Cls()  --清屏
TalkEx("但是，拜你所赐，我丐帮也将因此事贻笑武林。阁下先给个交代，再离开不迟。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
TalkEx("哦？难道你们想阻我离开？", 0, 4)  --对话
Cls()  --清屏
TalkEx("那只好得罪了。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
if WarMain(84, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_40(1)  --主角面向下
stands()
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哼，这些叫花子就是螳臂当车，不自量力。", 51, 0)  --对话
Cls()  --清屏
TalkEx("慕容公子，那乔峰虽已身败名裂，但《天龙八部》却依然没有着落。", 0, 4)  --对话
Cls()  --清屏
TalkEx("公子别急，听闻Ｒ聚贤庄Ｗ在武林之中颇有名望，公子不妨去哪里打听打听消息。", 76, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
    instruct_3(54,27,1,0,0,0,0,2530,2530,2530,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [27]
    instruct_3(54,28,1,0,0,0,0,2532,2532,2532,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [28]
    instruct_3(54,29,1,0,0,0,0,2534,2534,2534,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [29]
    instruct_3(54,30,1,0,0,0,0,2536,2536,2536,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [30]
    instruct_3(54,26,0,0,0,0,0,6292,6292,6292,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [26]
    instruct_3(54,23,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [23]
    instruct_3(54,22,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [22]
    instruct_3(54,21,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [21]
    instruct_3(54,20,0,0,0,0,0,6266,6266,6266,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [20]
    instruct_3(54,16,0,0,0,0,0,6042,6042,6042,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [16]
    instruct_3(54,17,0,0,0,0,0,5424,5424,5424,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [17]
    instruct_3(54,18,0,0,0,0,0,5182,5182,5182,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [18]
    instruct_3(54,19,0,0,0,0,0,5190,5190,5190,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [19]
    instruct_3(54,14,0,0,0,0,0,6416,6416,6416,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [14]
    instruct_3(54,15,0,0,0,0,0,6084,6084,6084,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [15]
    instruct_3(54,10,0,0,0,0,0,5888,5888,5888,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [10]
    instruct_3(54,11,0,0,0,0,0,5888,5888,5888,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [11]
    instruct_3(54,24,0,0,0,0,4109,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [24]
    instruct_3(54,25,0,0,0,0,4109,0,0,0,-2,-2,-2);   --  3(3):修改事件定义:场景[聚贤庄]:场景事件编号 [25]
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(-5)  --增加品德
do return end
