TalkEx("王姑娘好。", 0, 1)  --对话
Cls()  --清屏
TalkEx("公子好。", 76, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("王姑娘学识渊博，我想请王*姑娘助我一臂之力。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，我正想和表哥在一起。", 76, 0)  --对话
Cls()  --清屏
instruct_3(104, 51,1,0,977,0,0,6296,6296,6296,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_10(76)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 76, 0)  --对话
Cls()  --清屏
instruct_3(70, 27,1,0,167,0,0,6298,6298,6298,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
do return end
