instruct_14()  --场景变黑
instruct_3(-2, 25,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,6382,6382,6382,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,1,0,596,0,0,6376,6376,6376,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(39,30,17,30)  --人物移动
TalkEx("现在这位庄公子已经连胜十场，若再无人挑战，则……", 207,0 ,"丐帮弟子")  --对话
Cls()  --清屏
TalkEx("谁说无人挑战？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，你，你不就是……", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏

say("我是谁不重要，敢问庄公子此前可是丐帮弟子？",0,4)

TalkEx("额……不是。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏

say("不知庄公子可会打狗棒法？",0,4)

say("不会……",48,0)

say("那么庄公子可会降龙十八掌？",0,4)

say("也不会……你，你问这个干嘛？",48,0)

say("既然如此，我也要来参选丐帮帮主。",0,4)

say("你也想做帮主？先打赢我再说！",48,0)

--游坦之血量翻倍
JY.Person[48]["血量翻倍"] = JY.Person[592]["血量翻倍"]

if WarMain(88, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end

--游坦之血量翻倍
JY.Person[48]["血量翻倍"] = 1

instruct_3(-2, 14,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,1,0,597,0,0,6380,6380,6380,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("怎么样，这帮主之位舍我其谁？", 0, 4)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."武功盖世，丐帮上下就奉"..JY.Person[0]["外号"].."为丐帮下一任帮主了。", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏
say("对了，你们丐帮应该有什么Ｄ抓猫掌法，打狗棒法Ｗ之类的武功吧？",0,4)

TalkEx("帮主明鉴，打狗棒法口诀被洪老帮主带在身上，说是怕被贼人窃取。帮主想想，这丐帮镇帮之宝放在我们身上，他老人家能放心吗？", 207, 0,"丐帮弟子")  --对话
Cls()  --清屏

say("嘿嘿，照你这么说，难道我此行白费一番力气？",0,4)

TalkEx("帮主别急，这里有兄弟们辛苦攒下的一些讨饭钱，就献给帮主当见面礼吧。", 207, 0,"丐帮弟子")  --对话
Cls()

instruct_2(174,123)
Cls()

say("Ｌ＜……不愧是丐帮＞",0,4)

dark()

instruct_40(1)  --主角面向下

stands()

light()

TalkEx("启禀帮主，大轮明王鸠摩智有事求见。", 207, 0,"丐帮弟子")  --对话
Cls()

say("Ｌ＜他来干什么？＞ｗＷ有请。",0,4)

dark()

addevent(-2, 16, 1, nil, nil, 4280*2)

light()

say("贫僧听闻丐帮选出新任帮主，特来道贺。",103,0)

say("明王客气了。不知大师此次前来，有何见教？",0,4)

say("贫僧听人言到，帮主一直在打听《天龙八部》一书的下落，可有此事？",103,0)

say("不错，明王可知此书在何处？",0,4)

say("那《天龙八部》一书，现在少林寺藏经阁中。",103,0)

say("此话当真？",0,4)

say("出家人不打诳语。",103,0)

say("那少林派乃是中原武林各门派之首，此书既然已落入少林派手中，想要取之可是要大费周章了。",0,4)

say("贫僧有一计，可为帮主光明正大取得此书。",103,0)

say("明王请讲。",0,4)

say("帮主可以\"让中原武林同道齐结同心、共抗外侮\"为名，赴少林寺争夺Ｒ\"武林盟主\"Ｗ一位。",103,0)

say("帮主武功高强，击败少林玄慈方丈相信并非难事。只要获得武林盟主一位，让少林寺把天书交出来给武林盟主，岂不是顺理成章？",103,0)

say("明王此计甚妙，但不知明王为何要帮在下？",0,4)

say("那少林寺妄自尊大，自称天下武功出少林，更常以佛门正宗自居，贫僧一直看不过眼。",103,0)

say("帮主争夺武林盟主之际，倘若有其他少林和尚相助其方丈，贫僧亦会相助帮主。",103,0)

say("贫僧这里还有一绝技相赠，以表诚意。",103,0)

instruct_2(269,1)	--无相劫指

say("明王好意，在下恭敬不如从命了。",0,4)

say("帮主果然爽快之人。贫僧先走一步，告辞。",103,0)

dark()
null(-2,16)
instruct_3(-2, 12,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 37,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 36,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 35,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 34,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 33,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 31,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,595,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件

JY.Person[51]["品德"] = 41	--天邪最终战开启判定

instruct_13()  --场景变亮

instruct_37(-3)  --增加品德
do return end
