TalkEx("阿紫姑娘，跟我一起出去玩*吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("好啊好啊，整天呆在丐帮，*闷也闷死了。铁丑，咱们去*小村。", 47, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 74,1,0,961,0,0,6378,6378,6378,-2,-2,-2)  --修改场景事件
instruct_3(104, 66,1,0,960,0,0,6374,6374,6374,-2,-2,-2)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(70, 24,1,0,135,0,0,6380,6380,6380,-2,-2,-2)  --修改场景事件
instruct_3(70, 23,1,0,133,0,0,6374,6374,6374,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
