TalkEx("佛祖啊，我找不到回少林的*路了，请您指引我一条明路*吧。", 49, 0)  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("小和尚，不如我送你回少林*吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哇哇哇，佛祖显灵了……", 49, 0)  --对话
Cls()  --清屏
if instruct_28(0,75,999) == false then  --判断品德是否在范围之内
	TalkEx("施主眼中充满戾气，恐入魔*道，小僧知道，这一定是佛*祖对我的考验，阿弥陀佛，*小僧不能与你同行。", 49, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
if instruct_20() == false then  --判断队伍是否已满
	TalkEx("师傅说的没错，佛祖真是灵*验啊，阿弥陀佛。", 49, 0)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 15,1,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(-2, 2,1,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(28, 38,1,0,0,0,0,2286,2286,2286,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_10(49)  --加入队伍
	do return end  --无条件结束事件

end
TalkEx("阿弥陀佛，你队伍已满，我无法加入。", 49, 0)  --对话
Cls()  --清屏
TalkEx("那你就去小村等我吧", 0, 1)  --对话
Cls()  --清屏
TalkEx("阿弥陀佛，小僧不知道去小*村的路。", 49, 0)  --对话
Cls()  --清屏
do return end
