instruct_27(3,6342,6348)  --显示人物动画
Cls()  --清屏
TalkEx("逍遥派不肖弟子苏星河，拜见本派新任掌门。", 115, 0)  --对话
Cls()  --清屏
TalkEx("老前辈行此大礼，可折杀小僧了。", 49, 1)  --对话
Cls()  --清屏
TalkEx("师弟，你是我师父的关门弟子，又是本派掌门，我虽是师兄，却也要向你磕头！", 115, 0)  --对话
Cls()  --清屏
TalkEx("这个……这个……", 49, 1)  --对话
Cls()  --清屏
TalkEx("师弟，你真是福泽深厚。我和丁春秋想这宝石指环，想了几十年，始终都无法到手，你却在一个时辰之内，便受到师父的垂青。", 115, 0)  --对话
Cls()  --清屏
TalkEx("前辈拿去便是。这只指环，小僧半点用处也没有。", 49, 1)  --对话
Cls()  --清屏
TalkEx("师弟，你受师父临死时的重托，岂能推卸责任？师父将指环交给你，是叫你除灭丁春秋那厮，是不是？", 115, 0)  --对话
Cls()  --清屏
TalkEx("正是．但小僧功行浅薄，怎能当此重任？", 49, 1)  --对话
Cls()  --清屏
TalkEx("苏前辈，这是怎么回事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("事情是这样子的，本派乃逍遥派，师父收了我和丁春秋两个弟子。我师父有个规矩，因他所学甚杂，谁要做掌门，各种本事都要比试，不但比武，还得比琴棋书画．但丁春秋于各种杂学一窍不通，眼见掌门人无望，竟忽施暗算将师父打落深谷，又将我打得重伤。", 115, 0)  --对话
Cls()  --清屏
TalkEx("这人真是可恶。", 0, 1)  --对话
Cls()  --清屏
TalkEx("后来师父趁机诈死，又设下了这个棋局，想藉此找出悟性高的人，立他为掌门，并传他功力，将来好除去丁春秋这恶贼。今天，我们终于出现了能破解此珍珑的人，师父在传完他功力后也仙逝了。掌门师弟，我逍遥派的门户就靠你清理了。", 115, 0)  --对话
Cls()  --清屏
TalkEx("我是误打误撞的，并没有什么悟性。更何况我是少林弟子，怎能改投别派。", 49, 1)  --对话
Cls()  --清屏
TalkEx("贤弟，这位老前辈因为要传你毕生功力而逝去，你还忍心拒绝人家吗？况且，那丁春秋也是个无恶不作，罪无可赦的恶徒呀！", 0, 1)  --对话
Cls()  --清屏
TalkEx("…………", 49, 1)  --对话
Cls()  --清屏
TalkEx("好，我看就这样了。苏前辈，我们会去找那星宿老怪，杀了他替你师父报仇。", 0, 1)  --对话
Cls()  --清屏
TalkEx("老朽谢谢这位"..JY.Person[0]["外号"].."的帮忙。掌门师弟，此去路上一切要小心，丁春秋那老贼行事卑鄙……对了，我有一个徒弟医术高明，人称”阎王敌”的薛神医，你可以去找他帮忙。见到他时只要出示掌门信物的“七宝指环”即可。", 115, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 1,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,1,0,602,0,0,6522,6522,6522,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,1,0,601,0,0,6340,6340,6340,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_41(49,105,1)  --增加人物携带物品
instruct_41(49,75,1)  --增加人物携带物品
instruct_41(49,200,1)  --增加人物携带物品
instruct_45(49,20)  --增加轻功
instruct_46(49,3000)  --增加内力最大值
instruct_47(49,60)  --增加攻击力
instruct_48(49,200)  --增加生命最大值
instruct_35(49,0,8,300)  --设置人物武功
instruct_35(49,1,98,300)  --设置人物武功
awakening(49, 1)
Cls()  --清屏
instruct_13()  --场景变亮
instruct_34(49,10)  --增加资质
Cls()  --清屏
do return end
