TalkEx("贤弟，我们走了吧。", 0, 1)  --对话
Cls()  --清屏
instruct_3(104, 82,1,0,962,0,0,7234,7234,7234,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(28, 38,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(35, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_10(49)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去*小村吧。", 49, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 10,1,0,137,0,0,6604,6648,6604,-2,-2,-2)  --修改场景事件
instruct_3(70, 11,1,0,137,0,0,6650,6694,6650,-2,-2,-2)  --修改场景事件
instruct_3(35, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
