if instruct_4(200) == false then  --是否使用物品
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("丁春秋，你认得这七宝指环吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是谁，怎么会有这东西。", 46, 0)  --对话
Cls()  --清屏
TalkEx("见到掌门还不跪下。", 0,1)  --对话
Cls()  --清屏
TalkEx("这逍遥派掌门的信物是那偷来的？", 46, 0)  --对话
Cls()  --清屏
TalkEx("是你师父给的，他还要我们来替他清理门户，除去你这武林败类。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那老贼被我打落山崖，居然还没死，竟然还将这七宝指环给了你。也好，你亲自来送死，也免得我去找这七宝指环了。", 46, 0)  --对话
Cls()  --清屏
TalkEx("师父功力，震烁古今，你竟敢和我们作对，这叫萤火虫与日月争光！", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("螳臂挡车，自不量力，可笑啊！可笑！", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("我师父谈笑之间，便可将你们这一干妖魔小丑置之死地……", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("你们烦不烦，要打就快打，别在那大吹法螺。", 0, 1)  --对话
Cls()  --清屏
if WarMain(86, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 0,1,0,0,0,0,6600,6600,6600,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,1,0,611,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(53, 0,1,0,612,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("好不容易解决了这老怪。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."英雄无敌，小人忠诚归附，死心塌地，愿为主人效犬马之劳。", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("这天下盟主一席，非"..JY.Person[0]["外号"].."莫属。只须主人下令动手，小人赴汤蹈火，万死不辞。", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("丁春秋这灯烛之火，居然也敢和日月争光。", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."德配天地，威震当世，古今无比。", 206, 0,"星宿门人")  --对话
Cls()  --清屏
TalkEx("这些家伙转的真快，不愧是星宿派的弟子。不过听了虽有点肉麻，但也蛮舒服的。", 0, 1)  --对话
Cls()  --清屏
instruct_37(5)  --增加品德
Cls()  --清屏
do return end
