TalkEx("一呀摸，二呀摸，摸到姐姐的头发边……唉，我韦小宝什么时候能离开这里，一定要发大财，取一堆漂亮老婆，开个特大的妓院，哈哈……", 225, 0,"韦小宝")  --对话
Cls()  --清屏
if instruct_9() == false then  --是否要求加入
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(1,10,1,0,0)  --修改场景事件
instruct_26(1,7,1,0,0)  --修改场景事件
if JY.Person[0]["性别"] == 0 then
	TalkEx("出去玩？Ｌ＜这个家伙看着好像挺能打的，跟着他不会吃亏……我娘现在不在这……哈哈，就这么定了……＞Ｗ好啊，出去找漂亮老婆，好爽好爽。", 225, 0,"韦小宝")  --对话
else
	TalkEx("出去玩？Ｌ＜这个姑娘看着好像挺能打的，跟着她不会吃亏……我娘现在不在这……哈哈，就这么定了……＞Ｗ好啊，出去找漂亮老婆，好爽好爽。", 225, 0,"韦小宝")  --对话
end
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	dark()
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(3, 18,0,0,0,0,4123,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(3, 20,1,0,0,0,0,4314*2,4314*2,4314*2,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	light()
	instruct_10(601)	--韦小宝入队
	Cls()  --清屏
	do return end
end
TalkEx("可惜，你的队伍已经没有位置了。", 225, 0,"韦小宝")  --对话
--[[
instruct_3(71, 20,0,0,0,0,63,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(76, 12,0,0,0,0,89,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(76, 0,1,0,0,0,0,6292,6292,6292,-2,-2,-2)  --修改场景事件
instruct_3(76, 1,1,0,0,0,0,5956,5956,5956,-2,-2,-2)  --修改场景事件
instruct_3(76, 2,1,0,0,0,0,6306,6306,6306,-2,-2,-2)  --修改场景事件
instruct_3(76, 11,1,0,0,0,0,7030,7030,7030,-2,-2,-2)  --修改场景事件]]
do return end
