if instruct_18(200) == false then  --判断是否有物品
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_14()  --场景变黑
instruct_3(-2, 2,1,0,0,0,0,4295*2,4295*2,4295*2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,0,0,0,4294*2,4294*2,4294*2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(45,45,39,45)  --场景移动
TalkEx("哈哈哈，我的好师姐，我算准了你返老还童的日子，你躲不过去的，如今你的七经八脉都已被我震断，你的死期已到，哈哈哈……", 118, 0)  --对话
Cls()  --清屏
TalkEx("你这个臭贱人……", 117, 0)  --对话
Cls()  --清屏
TalkEx("那个小妹妹好像受伤了，赶快救人。", 0, 1)  --对话
Cls()  --清屏
if WarMain(202, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(41, 45)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("小妹妹，你没事吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx("臭"..JY.Person[0]["外号2"].."，什么没事，老婆子就要死啦！", 117, 0)  --对话
Cls()  --清屏
TalkEx("啊？这……这……", 0, 1)  --对话
Cls()  --清屏
TalkEx("不过那个贱人总算死在了我前头，老婆子还得谢谢你啊……咦？你手上拿的是什么？你怎么会有我们逍遥派的掌门指环？", 117, 0)  --对话
Cls()  --清屏
TalkEx("这个是无崖子前辈给我兄弟的，事情是这样的……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("师弟，师弟，你怎么在我之前走了……", 117, 0)  --对话
Cls()  --清屏
TalkEx("前辈原来是无崖子前辈的师姐啊，那刚才那个女人是……？", 0, 1)  --对话
Cls()  --清屏
TalkEx("那个贱人叫李秋水，是我师妹，敢和我争师弟，哼，终于死在我前头了。"..JY.Person[0]["外号2"].."，帮我个忙，把这个信号发到空中。", 117, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 5,0,0,0,0,0,6084,6084,6084,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,6084,6084,6084,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,6084,6084,6084,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,6084,6084,6084,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("姥姥，姥姥，你怎么了？", 240, 0,"灵鹫宫女")  --对话
Cls()  --清屏
TalkEx("姥姥要死了，你们是不是很开心啊？", 117, 0)  --对话
Cls()  --清屏
TalkEx("属下不敢。姥姥，是谁把你害成这样，我们去找他算帐！", 240, 0,"灵鹫宫女")  --对话
Cls()  --清屏
TalkEx("哼，你们倒好心！不用啦，这位"..JY.Person[0]["外号"].."已经杀了那个贱人。你们听着，这位"..JY.Person[0]["外号"].."以后就是灵鹫宫的新主人，快点拜见！", 117, 0)  --对话
Cls()  --清屏
TalkEx("参见新主人！", 240, 0,"灵鹫宫女")  --对话
Cls()  --清屏
TalkEx("啊？啊。好，好，（好别扭……）", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，以后灵鹫宫就是你的了。师弟，我要去找你了……", 117, 0)  --对话
Cls()  --清屏
TalkEx("姥姥……", 240, 0,"灵鹫宫女")  --对话
Cls()  --清屏
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
