TalkEx("年轻人，你来啦。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("死老头，就会这句，难道会说这句话就是贤者吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不，作为贤者，我还有更重要的事情要对你说。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("我就知道，你总会再给我一些提示的。", 0, 1)  --对话
Cls()  --清屏
TalkEx("在江湖上行走，最重要的就是使自己保持在正道之上。旁边这个镜子……", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("这个镜子能看道德值，对吧？我从小到大看这个镜子不知多少遍了，每次都是显示50，不知道是不是劣质产品……", 0, 1)  --对话
Cls()  --清屏
TalkEx("那是因为你还没有踏入江湖，当你真正踏入江湖的时候，这个镜子才会开始起作用。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("那就是现在开始起作用喽。好吧，没有别的事了吧，我走了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("临走之前，我还有一句话重要的话要提醒你。", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("好，最后一句，你说吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("在江湖上行走，最重要的就是使自己保持在正道之上……", 255, 0,"南贤")  --对话
Cls()  --清屏
TalkEx("死老头，你还有完没完啊……再见！！", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,693,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
