if instruct_50(144,145,146,147,148) then  --判断是否同时有五个物品
	if instruct_50(149,150,151,152,153) then  --判断是否同时有五个物品
		if instruct_50(154,155,156,157,157) then  --判断是否同时有五个物品
			TalkEx("年轻人，你终于找齐了十四*天书？很好，你做的很好。*这十四本书都是经典小说，*值得你永久珍藏。", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("你曾经和我说什么武林浩劫*啊，什么天命啊，什么大事*等着我啊，闹了半天这些书*仅仅是小说？？", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("年轻人应该多读点书，所以*我让你去找书……", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("死老头，你知不知道，我为*了找这几本烂书，差点送掉*小命啊！！！", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("子曾经曰过，天将降大任于*斯人也，必先苦其心志，劳*其筋骨……", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("你不要和我掉书包了，没看*见我很气愤吗？还有什么大*任，快说！！", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("你知道华山论剑吗？", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("知道啊，你让我去参加华山论剑？", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("现在华山论剑已经取消了……", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("你知道吗？*我现在很想揍你……", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("年轻人就是性子急。其实华*山论剑并没有真正取消，只*是改了名字，现在叫做\"奥*林匹克\"大会。", 255, 0,"南贤")  --对话
			Cls()  --清屏
			TalkEx("这是什么烂名字啊。", 0, 1)  --对话
			Cls()  --清屏
			instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 94,0,0,0,0,0,7220,7220,7220,-2,-2,-2)  --修改场景事件
			Cls()  --清屏
			TalkEx("你错了，这个名字很有意义*。", 256, 0,"北丑")  --对话
			Cls()  --清屏
			TalkEx("丑叔，不要突然冒出来吓人*！", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("\"奥\"，就是深奥，象征武学*的精深；\"林\"，就是森林，*象征武学的博大；\"匹\"，就*是匹敌，象公平的规则；\"*克\"，就是克人克己，这才*是武学的真谛。我当初取这*个名字，是很有意义的。", 256, 0,"北丑")  --对话
			Cls()  --清屏
			TalkEx("闹了半天这么蹩嘴的名字是*你起的！！", 0, 1)  --对话
			Cls()  --清屏
			TalkEx("我从前说过，有件大事等着*你，绝不是骗你。现在你经*过寻找十四天书的过程，已*经练就了一身非凡的武功，*现在就是参加\"奥林匹克\"大*会的时候了，你挑选一下伙*伴，准备好了就到华山的武*道大会场来吧。", 255, 0,"南贤")  --对话
			Cls()  --清屏
			instruct_39(25)  --打开场景
			Cls()  --清屏
			instruct_14()  --场景变黑
			instruct_17(83,1,39,37,0)  --设置场景的值
			instruct_3(-2, 94,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
			instruct_3(25, 24, 1, 0, 4116, 0, 0, 4133*2, 4133*2, 4133*2, 0, -2, -2) --无酒不欢：武道大会
			Cls()  --清屏
			instruct_13()  --场景变亮
			do return end  --无条件结束事件

		end
		Cls()  --清屏

	end
	Cls()  --清屏

end
TalkEx("在江湖上行走，最重要的就*是使自己保持在正道之上*……", 255, 0,"南贤")  --对话
Cls()  --清屏
do return end
