if instruct_4(174) == false then  --是否使用物品
	do return end  --无条件结束事件
	Cls()  --清屏

end
if instruct_31(5) == false then  --判断银两数量
	TalkEx("五两银子，一文不能少。", 256, 0,"北丑")  --对话
	Cls()  --清屏

end
instruct_32(174,-5)  --得到或失去物品
TalkEx("还你还你！不就五两银子嘛*，整天唠叨个没完！", 0, 1)  --对话
Cls()  --清屏
TalkEx("嗯，很好。鉴于你如此诚恳*的还钱态度，我就再送你一*件宝物。", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("宝物？什么宝物？……最好*是十四天书，这样我就不用*找了……", 0, 1)  --对话
Cls()  --清屏
TalkEx("拿着。", 256, 0,"北丑")  --对话
Cls()  --清屏
instruct_2(195, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("一把铲子？？*这算什么宝物啊……", 0, 1)  --对话
Cls()  --清屏
TalkEx("这不是一把普通的铲子，它*有着非凡的来历。你知道盘*古开天地的故事吧？", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("你不要告诉我盘古是用这把*铲子开天地的……", 0, 1)  --对话
Cls()  --清屏
TalkEx("其实，盘古开天地的故事与*这把铲子毫无关系……", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("那你说它干嘛！！！*快说正经的，这把铲子是哪*来的？", 0, 1)  --对话
Cls()  --清屏
TalkEx("其实这是小小猪留给你的。", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("你不是在耍我吧？他留给我*一把铲子干啥用？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我也不是十分清楚。好像小*小猪说让你到什么西部农村*去，教那些上不起武馆的穷*孩子练武。", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("有什么报酬？", 0, 1)  --对话
Cls()  --清屏
TalkEx("好像……什么也没有……", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("没报酬？谁愿意干呀！那些*孩子上不起武馆，这是整个*江湖的问题，我哪管得了。*不过这个铲子好像挺有用的*，我先收着了。你还有什么*要嘱咐的？", 0, 1)  --对话
Cls()  --清屏
TalkEx("还有一句重要的话——*你还欠我五两银子没还。", 256, 0,"北丑")  --对话
Cls()  --清屏
TalkEx("已经还完了！！！*你这是什么记性啊……", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，对不起，说习惯了。最*后一句应该是——一定要不*惜任何代价拿到十四天书。", 256, 0,"北丑") --对话
Cls()  --清屏
TalkEx("还是一句废话……", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,1,0,698,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
