if instruct_16(36) then  --是否在队伍
	TalkEx("余沧海，你还认得我吗？", 36, 1)  --对话
	Cls()  --清屏
	TalkEx("你，你，你是福威镖局的林*平之！", 24, 0)  --对话
	Cls()  --清屏
	TalkEx("不错，正是我！你为了辟邪*剑谱，害的我家破人亡，今*日，我就让你见识一下辟邪*剑法，你看清楚了！", 36, 1)  --对话
	Cls()  --清屏
	if WarMain(51, 0) == false then  --战斗开始
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件
		Cls()  --清屏

	end
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_37(-5)  --增加品德
	awakening(36, 1)	--林平之觉醒
	do return end  --无条件结束事件

end
TalkEx("嘿嘿嘿，我要想办法把青城*派发扬广大……", 24, 0)  --对话
Cls()  --清屏
do return end
