instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(22,26,24,17)  --场景移动
say("贾老二，你看旁边桌上那妞，身材要得，脸蛋更是要得。", 200, 0,"青城弟子")  --对话
Cls()  --清屏
instruct_25(24,17,18,16)  --场景移动
say("Ｄ＜这次青城派大举南来，有些古怪，师父叫我们来探探动静。小师妹，要沉住气，假装没听见＞", 35, 0)  --对话
Cls()  --清屏
say("Ｄ＜好，大师哥，我听你的＞", 79, 0)  --对话
Cls()  --清屏
instruct_25(18,16,24,17)  --场景移动
say("余兄弟，你要是喜欢，咱就想想办法，把这妞弄回去，嘿嘿嘿……", 200, 0,"青城弟子")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,5862,5862,5862,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
say("什么东西，两个不带眼的狗崽子，却到我们福州府来撒野！", 36, 0)  --对话
Cls()  --清屏
say("贾老二，你看这个小白脸眉清目秀，要上台去唱花旦，真勾引得人。", 200, 0,"青城弟子")  --对话
Cls()  --清屏
say("这位兔儿爷，我越瞧你越不像男人，准是个大姑娘乔装改扮的。你这脸蛋儿又红又白，给我香个面孔好不好？", 200, 0,"青城弟子")  --对话
Cls()  --清屏
say("我乃福威镖局的少镖头，你天大胆子，到太岁头上动土？", 36, 0)  --对话
Cls()  --清屏
say("福威镖局？从来没听见过！那是干什么的？", 200, 0,"青城弟子")  --对话
Cls()  --清屏
say("专打狗崽子的！", 36, 0)  --对话
Cls()  --清屏
say("说的好，我来帮你！", 0, 1)  --对话
Cls()  --清屏
instruct_25(24,17,18,16)  --场景移动
say("小师妹，你知不知道这青城派最厉害的招数叫什么？", 35, 0)  --对话
Cls()  --清屏
say("不知道，叫什么？", 79, 0)  --对话
Cls()  --清屏
say("叫\"屁股向后平沙落雁式\"我这就让他们演给你瞧瞧。", 35, 0)  --对话
Cls()  --清屏

--令狐冲，林平之，岳灵珊血量翻倍
JY.Person[35]["血量翻倍"] = JY.Person[592]["血量翻倍"]
JY.Person[36]["血量翻倍"] = JY.Person[592]["血量翻倍"]
JY.Person[79]["血量翻倍"] = JY.Person[592]["血量翻倍"]

JY.Person[35]["攻击力"] = JY.Person[35]["攻击力"] + 400
JY.Person[79]["攻击力"] = JY.Person[79]["攻击力"] + 400

if WarMain(203, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end

JY.Person[35]["攻击力"] = JY.Person[35]["攻击力"] - 400
JY.Person[79]["攻击力"] = JY.Person[79]["攻击力"] - 400

--林平之，岳灵珊血量还原
JY.Person[36]["血量翻倍"] = 1
JY.Person[79]["血量翻倍"] = 1

instruct_3(-2, 26,0,0,0,0,0,7624,7624,7624,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,7142,7142,7142,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,7144,7144,7144,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_19(21, 20)  --设置人物XY坐标
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
say("你，你这兔儿爷，你竟敢杀了我家少爷，咱们这梁子算结下了，你们等着瞧吧。", 200, 0,"青城弟子")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
say("看来对方来头不善，林兄弟还是小心为是。", 0, 1)  --对话
Cls()  --清屏
say("我想以我家福威镖局名头并无大事。", 36, 0)  --对话
Cls()  --清屏
say("这几个人都是四川青城派的，你杀了的似乎是青城派余观主的儿子，恐怕福威镖局会有麻烦啊。", 35, 0)  --对话
Cls()  --清屏
say("刚才见二位剑法不凡，不知是那一派门下，怎样称呼？", 0, 1)  --对话
Cls()  --清屏
say("在下华山令狐冲。", 35, 0)  --对话
Cls()  --清屏
say("在下华山岳灵珊。", 79, 0)  --对话
Cls()  --清屏
say("华山派是名门大派，今日一见果然名不虚传。", 0, 1)  --对话
Cls()  --清屏
say("过奖过奖。林兄弟，我看这青城派绝不会善罢甘休，你还是回福威镖局早做准备吧。我和师妹也要回华山禀明家师。", 35, 0)  --对话
Cls()  --清屏
say("也好，那咱们后会有期。", 36, 0)  --对话
Cls()  --清屏
say("后会有期。", 79, 0)  --对话
Cls()  --清屏
say("后会有期。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(56, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(56, 0,1,0,744,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
do return end
