instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,5862,5862,5862,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(23,49,21,39)  --场景移动
TalkEx("龟孙子，我看你往哪跑！", 200, 0,"青城弟子")  --对话
Cls()  --清屏
TalkEx("你，你们，你们到底要怎么样！我爹爹妈妈在哪里？", 36, 0)  --对话
Cls()  --清屏
TalkEx("哈哈，龟儿，龟婆，此时已经上阎王那儿报道了吧，哈哈哈，龟孙子，你还是快点把辟邪剑谱交出来吧。", 200, 0,"青城弟子")  --对话
Cls()  --清屏
TalkEx("＜难道青城派找福威镖局的麻烦，不单是为了报仇，还想抢林家的剑谱？＞你们不要欺人太甚！", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."快来救我。", 36, 0)  --对话
Cls()  --清屏
if WarMain(48, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_19(20, 41)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
instruct_3(-2, 25,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,7152,7152,7152,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("林兄弟，你没事吧。", 0, 0)  --对话
Cls()  --清屏
TalkEx("多谢"..JY.Person[0]["外号"].."及时出手相助。这帮青城派的狗贼，是想把我福威镖局赶尽杀绝啊。", 36, 0)  --对话
Cls()  --清屏
TalkEx("林兄弟，究竟发生了什么事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("唉，那日我杀了那个小狗崽子，不想青城派因此大举进攻我们福威镖局。我们眼看抵挡不住，爹爹妈妈就带着我一起逃难出来，没想到半路还是被这群狗贼发现了。我们一家三口寡不敌众，全都被擒。我好不容易逃了出来，不知道我爹爹妈妈现在怎么样了？", 36, 0)  --对话
Cls()  --清屏
TalkEx("爹～，那边那个就是福威镖局的少镖头林平之。", 79, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 21,0,0,0,0,0,5960,5960,5960,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,7142,7142,7142,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,7656,7656,7656,-2,-2,-2)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,5184,5184,5184,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,7150,7150,7150,-2,-2,-2)  --修改场景事件
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("爹～，他就是林平之，他就是为了帮我打抱不平才会失手杀了那个姓余的，这位"..JY.Person[0]["外号"].."当时也在场。", 79, 0)  --对话
Cls()  --清屏
TalkEx("原来是华山掌门，君子剑岳先生，久仰大名，晚辈有礼了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("岳掌门，岳掌门，你救救我爹爹，救救我妈妈……", 36, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."不必多礼。林少镖头，你的父母……，唉，冲儿，你来说吧……", 19, 0)  --对话
Cls()  --清屏
TalkEx("林兄弟，上次我们分手以后，我和小师妹马上赶回了华山，将你的事情禀明家师。家师料想到青城派会对你家人下毒手，于是率领我们这些弟子下山营救。没想到还是晚了一步……", 35, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("爹爹……妈妈……你们死的好惨啊……孩儿一定要替你们报仇，杀了这帮青城派的狗贼……", 36, 0)  --对话
Cls()  --清屏
TalkEx("林兄弟，你不要太难过了，你父母临终时，有遗言留给你，说福州向阳老宅……", 35, 0)  --对话
Cls()  --清屏
TalkEx("冲儿，林公子令尊的遗言，你单独告诉他便是了，旁人不必知晓。", 19, 0)  --对话
Cls()  --清屏
TalkEx("是，师父。", 35, 0)  --对话
Cls()  --清屏
TalkEx("岳掌门，你是好人，人人都称你为君子剑，我一见你，就说不出的钦佩敬慕，求师父收录门墙，弟子谨遵教诲，严守门规，决不敢有丝毫违背师命。", 36, 0)  --对话
Cls()  --清屏
TalkEx("爹～，你就收下他吧。虽说青城派是为了贪图林家的辟邪剑谱，但这件事毕竟是由于林兄弟为女儿打抱不平引起的。爹，你就收下他吧。", 79, 0)  --对话
Cls()  --清屏
TalkEx("好吧，既然如此，平之啊，你就跟着我们吧。", 19, 0)  --对话
Cls()  --清屏
TalkEx("多谢恩师收留。", 36, 0)  --对话
Cls()  --清屏
TalkEx("恭喜林兄弟得遇名师。", 0, 1)  --对话
Cls()  --清屏
TalkEx("对了，爹，这位"..JY.Person[0]["外号"].."当时也出手帮我来着，您老人家是不是也该有所表示呀？", 79, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."初涉江湖，能够见义勇为，很好，很好，这本剑谱记载着华山剑法的精要，就赠与"..JY.Person[0]["外号"].."吧。", 19, 0)  --对话
Cls()  --清屏
instruct_2(127, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("多谢岳掌门。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好了，此间事情已了，冲儿，姗儿，平之，我们回华山。", 19, 0)  --对话
Cls()  --清屏
TalkEx("是，师父。"..JY.Person[0]["外号"].."，再会了。", 36, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."有空不妨到我华山来玩啊。", 35, 0)  --对话
Cls()  --清屏
TalkEx("呵呵，好，我一定会去的。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(57, 3,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(57, 4,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
do return end
