TalkEx("小林子，你别练功了，陪我玩玩吧。", 79, 0)  --对话
Cls()  --清屏
TalkEx("师姐，你看我这一招用的对不对？", 36, 0)  --对话
Cls()  --清屏
TalkEx("这个小林子，就知道拼命练功，也不陪我玩。", 79, 0)  --对话
Cls()  --清屏
TalkEx("岳姑娘好。林兄弟他为报家仇，刻苦用功也是情理之中。岳姑娘可以找别的师兄弟玩啊，你大师兄令狐冲呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("跟别人玩没意思嘛！大师兄？他被爹爹罚到后面的思过崖去了，哦，说起来，我也有十多天没去看过他了，"..JY.Person[0]["外号"].."要是有空，就代我去看看他吧。", 79, 0)  --对话
Cls()  --清屏
instruct_3(81, 0,0,0,0,0,752,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,-2,-2,8026,0,0,-2,-2,-2,-2,-2,-2)  --修复无限触发后山事件的bug
do return end
