instruct_14()  --场景变黑
instruct_3(-2, 2,1,0,753,0,0,5896,5896,5896,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,1,0,754,0,0,7624,7624,7624,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_35(35,0,47,700)  --令狐冲洗九剑
instruct_47(35,50)  --增加攻击力
instruct_13()  --场景变亮
instruct_30(48,36,19,37)  --人物移动
instruct_40(2)  --设置主角方向
awakening(35, 1)	--令狐冲第一次觉醒
SetTianWai(35, 1, 47)	--令狐冲天外洗九剑
Cls()  --清屏
TalkEx("令狐兄，好久不见了，这位老前辈是？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不要问我的姓名，也不要和任何人提起你们见过我。", 140, 0)  --对话
Cls()  --清屏
TalkEx("既然如此，在下就不多问了。令狐兄，一向可好？", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好。上次下山犯了门规，被师父罚到此处面壁思过。正好巧遇老前辈，受益匪浅啊。只是好久不见小师妹了，有些想念。她好久没来了，是生病了吗？", 35, 0)  --对话
Cls()  --清屏
TalkEx("岳姑娘？令狐兄不必挂怀，岳姑娘很好，和林兄弟玩得很开心。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是说……？哦……唉……林师弟和他年纪相当……", 35, 0)  --对话
Cls()  --清屏
TalkEx("冲儿，我刚教你得剑法，和这位"..JY.Person[0]["外号"].."过招试试吧。", 140, 0)  --对话
Cls()  --清屏
TalkEx("是，太师叔！"..JY.Person[0]["外号"].."，你准备一下，咱们比试比试！", 35, 0)  --对话
Cls()  --清屏
do return end
