instruct_14()  --场景变黑
instruct_13()  --场景变亮
instruct_25(26,29,20,28)  --场景移动
TalkEx("成兄，你们\"剑宗\"早已离开本门，自认不再是华山弟子，何以今日又来生事？", 19, 0)  --对话
Cls()  --清屏
TalkEx("岳不群，气宗用卑鄙的手段战胜我们剑宗，你霸占华山派掌门之位，教弟子练气不练剑，以致我华山派声名日衰，我作为是华山弟子不能置之不理。再说左盟主身为五岳剑派的首领，他老人家也颁下令旗，要你让位，今日该得好好算一算这笔帐了。", 141, 0)  --对话
Cls()  --清屏
TalkEx("我想其中必有蹊跷。左盟主向来见事极明，决不会突然颁下令旗，要华山派更易。", 19, 0)  --对话
Cls()  --清屏
TalkEx("说来说去，你这掌门人之位是不肯让的了？那剑宗成不忧今日领教岳掌门的气功。", 141, 0)  --对话
Cls()  --清屏
TalkEx("师父，先让弟子和他斗斗，倘若弟子的气功没练得到家，再请师父来打发他不迟。", 35, 0)  --对话
Cls()  --清屏
TalkEx("好，是你狂妄自大，可不能怨我出手狠辣。", 141, 0)  --对话
Cls()  --清屏
if WarMain(205, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("成师傅，承让了。", 35, 0)  --对话
Cls()  --清屏
TalkEx("我，我，我竟然输在了一个二代弟子手里，……，哼，着！", 141, 0)  --对话
Cls()  --清屏
TalkEx("啊——！", 35, 0)  --对话
Cls()  --清屏
TalkEx("成兄，输了便是输了，你为何还要暗算我我徒儿！Ｌ＜令狐冲这小子用的是什么剑法，我都没见过，难道……？＞", 19, 0)  --对话
Cls()  --清屏
TalkEx("徒弟的剑法，恐怕比师父还要高些…………告辞了，我们走！", 141, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 30,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,6372,6372,6372,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("令狐冲要死啦，怎么办？", 143, 0)  --对话
Cls()  --清屏
TalkEx("他只是受了伤，你怎知他一定会死？", 144, 0)  --对话
Cls()  --清屏
TalkEx("我没说他一定会死，我说他可能要死了。", 143, 0)  --对话
Cls()  --清屏
TalkEx("哎呀，好像真的要死了，我们去救他吧。", 145, 0)  --对话
Cls()  --清屏
TalkEx("对，有我们桃谷六仙来救他，他就死不了。", 146, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("爹，这六个怪物是什么人？他们把大师兄带走啦……", 79, 0)  --对话
Cls()  --清屏
TalkEx("……大家赶紧去找找冲儿。Ｌ＜冲儿的剑法有些古怪，但应该不是辟邪剑谱，这辟邪剑谱恐怕……我得想想办法……＞", 19, 0)  --对话
Cls()  --清屏
TalkEx("是！", 195, 0,"陆大有")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 23,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("我也去找找令狐冲吧。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, 1,1,0,756,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(81, 5,0,0,0,0,0,6744,6744,6744,-2,-2,-2)  --修改场景事件
instruct_3(81, 6,0,0,0,0,0,6744,6744,6744,-2,-2,-2)  --修改场景事件
instruct_3(81, 7,0,0,0,0,0,6748,6748,6748,-2,-2,-2)  --修改场景事件
instruct_3(81, 8,0,0,0,0,0,6748,6748,6748,-2,-2,-2)  --修改场景事件
instruct_3(81, 9,0,0,0,0,0,6750,6750,6750,-2,-2,-2)  --修改场景事件
instruct_3(81, 10,0,0,0,0,0,6750,6750,6750,-2,-2,-2)  --修改场景事件
instruct_3(81, 11,1,0,758,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_3(81, 0,0,0,0,0,757,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_25(20,28,26,29)  --场景移动
do return end
