instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_37(1)  --增加品德
instruct_25(48,36,30,22)  --场景移动
Cls()  --清屏
TalkEx("我这股真气，从中渎而至风市、环跳，在他渊液之间来回，必能治好他的内伤。", 148, 0)  --对话
Cls()  --清屏
TalkEx("不对不对，应该以真气游走他足厥阴肝经诸经脉……", 147, 0)  --对话
Cls()  --清屏
TalkEx("还是我的法子好。这小子的内伤，是属于心包络，须得以真气通他肾络三焦。", 146, 0)  --对话
Cls()  --清屏
TalkEx("这般以真气在他渊液间来回，我看不大妥当，还是先治他的足少阴肾经为是。", 144, 0)  --对话
Cls()  --清屏
TalkEx("他胸口中掌，受了内伤，自然当以治他手太阳肺经为主。我用真气贯注他中府、尺泽、孔最、列缺、太渊、少商诸穴，最是对症。", 145, 0)  --对话
Cls()  --清屏
TalkEx("这小子头脑发昏，心智胡涂，须得治他阳明胃经。", 143, 0)  --对话
Cls()  --清屏
TalkEx("咱们便试一试，到底谁说得对。", 145, 0)  --对话
Cls()  --清屏
TalkEx("你们六个怪物，还不快住手！", 0, 1)  --对话
Cls()  --清屏
if WarMain(206, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_19(31, 23)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
instruct_46(35,-200)  --增加内力最大值
instruct_45(35,-50)  --增加轻功
instruct_48(35,-200)  --增加生命最大值
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("令狐兄，你感觉怎么样？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这六个家伙夹杂不清，稀里糊涂，本来是一片好心要为我治伤，可是各按各的治法，我现在体内真气乱窜，少侠快送我回华山。", 35, 0)  --对话
Cls()  --清屏
TalkEx("好，令狐兄，我送你回去。", 0, 1)  --对话
Cls()  --清屏
if instruct_20() == false then  --判断队伍是否已满
	instruct_10(35)  --加入队伍
	Cls()  --清屏
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(57, 0,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(57, 1,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	instruct_3(57, 15,1,0,759,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("可惜，你的队伍已满，我无法加入。", 35, 0)  --对话
Cls()  --清屏
do return end
