if instruct_16(35) == false then  --是否在队伍
	TalkEx("掌门已率领弟子上嵩山了。", 195, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
TalkEx("六猴，师父呢？", 35, 1)  --对话
Cls()  --清屏
TalkEx("师父说封不平等这几个剑宗*弃徒请到了五岳剑派的令旗*，咱们上嵩山去见左盟主，*和他评一评这个道理。", 195, 0,"陆大有") --对话
Cls()  --清屏
TalkEx("武林中说到评理，可并非单*是\"评\"一\"评\"就算了事*，一言不合，往往继之以动*武。", 35, 0)  --对话
Cls()  --清屏
TalkEx("师父说让你回来好好养伤，*这是师父留给你的紫霞秘笈*。我也要去帮师父的忙了。", 195, 0,"陆大有")   --对话
Cls()  --清屏
instruct_2(67, 1)  --得到或失去物品
Cls()  --清屏
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
TalkEx("师父武功虽高，未必是左盟*主的对手，何况嵩山派左盟*主的师弟共有十余人之多，*武林中号称‘嵩山十三太保*”咱们贸然上嵩山去生事，*岂非太也卤莽？", 35, 0)  --对话
Cls()  --清屏
TalkEx("那咱们就沿路找找他们吧，*看能不能帮上什么忙。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，师父他们人多，走的慢*，咱们应该能追上他们。", 35, 0)  --对话
Cls()  --清屏
instruct_3(103, 0,0,0,0,0,760,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(103, 2,0,0,0,0,760,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(103, 1,0,0,0,0,760,0,0,0,-2,-2,-2)  --修改场景事件
do return end
