if instruct_16(35) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,7162,7162,7162,-2,-2,-2)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,7018,7018,7018,-2,-2,-2)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,7154,7154,7154,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,5178,5178,5178,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,5208,5208,5208,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,7160,7160,7160,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,7160,7160,7160,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(28,46,30,23)  --场景移动
TalkEx("哈哈哈，华山派一干人等，*已尽数被我点了穴道。岳不*群，你还有什么说的？", 141, 0)  --对话
Cls()  --清屏
TalkEx("哼！", 19, 0)  --对话
Cls()  --清屏
TalkEx("岳先生，我们和你无冤无仇*，今晚冒昧得罪，只不过想*借那《辟邪剑谱》一观。你*千方百计的将福威镖局的林*家少年收入门下，自然是在*图谋这部剑谱了。老朽好言*相劝，你还是献了出来罢！", 142, 0)  --对话
Cls()  --清屏
TalkEx("岳某既然落入你手，要杀便*杀，辟邪剑谱跟本不在我身*上，你杀岳某容易，想要坏*我名誉，却是作梦！", 19, 0)  --对话
Cls()  --清屏
TalkEx("不好，快救我师父他们！", 35, 0)  --对话
Cls()  --清屏
if WarMain(207, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,7656,7656,7656,-2,-2,-2)  --修改场景事件
instruct_19(29, 23)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("岳掌门，您怎么样？", 0, 1)  --对话
Cls()  --清屏
TalkEx("师父，小师妹，你们都没事*吧？", 35, 1)  --对话
Cls()  --清屏
TalkEx("哼，令狐少侠好剑法啊！", 19, 0)  --对话
Cls()  --清屏
TalkEx("师父，我……", 35, 0)  --对话
Cls()  --清屏
TalkEx("师父，成不忧，封不平先后*败在大师兄手下，他们没脸*再来争夺华山掌门之位，咱*们还去嵩山么？", 195, 0,"陆大有")   --对话
Cls()  --清屏
TalkEx("师父，弟子外公金刀无敌王*元霸是洛阳人我父母双亡，*很想去拜见外公、外婆，禀*告详情。不如到弟子外祖家*盘桓数日。然后咱们再慢慢*游山玩水，到福建舍下去走走。", 36, 0)  --对话
Cls()  --清屏
TalkEx("金刀无敌威震中原，我一直*好生相敬，只是缘悭一面。*福建莆田是南少林所在之地*，自来便多武林高手。咱们*便到洛阳、福建走一遭。令*狐少侠，还肯屈尊跟我们一*起走吗？", 19, 0)  --对话
Cls()  --清屏
TalkEx("弟子当然跟随师父！"..JY.Person[0]["外号"].."，那我就跟师父去了，咱们就此别过。", 35, 0)  --对话
Cls()  --清屏
TalkEx("也好，岳掌门，那咱们后会*有期！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_21(35)  --离开队伍
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(40, 0,0,0,0,0,766,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(40, 24,0,0,0,0,0,7018,7018,7018,-2,-2,-2)  --修改场景事件
instruct_3(40, 26,0,0,0,0,0,7154,7154,7154,-2,-2,-2)  --修改场景事件
instruct_3(40, 27,0,0,0,0,0,7158,7158,7158,-2,-2,-2)  --修改场景事件
instruct_3(40, 25,1,0,767,0,0,7162,7162,7162,-2,-2,-2)  --修改场景事件
instruct_3(40, 23,1,0,767,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
