TalkEx(JY.Person[0]["外号"].."来我王府有何贵干啊？", 106, 0)  --对话
Cls()  --清屏
TalkEx("久仰王老爷子金刀无敌的大*名，今日特来拜见。", 0, 1)  --对话
Cls()  --清屏
TalkEx("呵呵呵，什么金刀无敌，江*湖上的朋友往老朽脸上贴金*啦，呵呵呵……", 106, 0)  --对话
Cls()  --清屏
if instruct_5() == false then  --是否与之过招
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("我觉得也是，什么金刀无敌*，纯粹胡吹大气。", 0, 1)  --对话
Cls()  --清屏
TalkEx("你——！小娃娃，你今日来*此，是来挑衅的吗？", 106, 0)  --对话
Cls()  --清屏
TalkEx("我就是想见识一下，什么样*的刀能叫做无敌金刀！", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈，小娃娃，原来是来考*教老朽的功夫来了，好，就*让你尝尝我金刀的厉害！", 106, 0)  --对话
Cls()  --清屏
if WarMain(209, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("这就是金刀啊，我看也没什*么了不起嘛，我替你保管好*了。", 0, 1)  --对话
Cls()  --清屏
instruct_2(47, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("…………", 106, 0)  --对话
instruct_3(-2, -2,1,0,763,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_37(-5)  --增加品德
do return end
