instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(37, 5,1,0,1053,0,0,6804,6804,6804,-2,-2,-2)  --修改场景事件
TalkEx("令狐兄病情如何？", 0, 1)  --对话
Cls()  --清屏
TalkEx("曲子已经学完。感觉身体略有好转。", 35, 0)  --对话
Cls()  --清屏
TalkEx("唉，虽然这首曲子对他的伤稍有裨益，但毕竟没有解决根本问题。现在能治你的病的可能只有杀人名医平一指了。你去找他吧，他定会全力施救。", 73, 0)  --对话
Cls()  --清屏
TalkEx("多谢姑娘。", 35, 0)  --对话
Cls()  --清屏
TalkEx("我这操琴之法传授与你，需每日勤加练习。咱们就此别过吧。", 73, 0)  --对话
Cls()  --清屏
instruct_41(35,180,1)  --增加人物携带物品
TalkEx("今日一别，不知何日得能再聆姑娘雅奏。令狐冲但教不死，定当再到洛阳，拜访姑娘和竹翁。", 35, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,8222,8222,8222,-2,-2,-2)  --修改场景事件
instruct_3(-2, 54,1,0,773,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,7150,7150,7150,-2,-2,-2)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,7166,7166,7166,-2,-2,-2)  --修改场景事件
instruct_3(-2, 49,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 53,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 52,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 51,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_19(46, 13)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
instruct_30(46,13,46,22)  --人物移动
TalkEx("冲儿，我听说只有杀人名医平一指能治你的伤，可是那平一指乃是邪魔外道，不可相交啊。", 19, 0)  --对话
Cls()  --清屏
TalkEx("既是如此，弟子不去找他治病便是了。", 35, 0)  --对话
Cls()  --清屏
TalkEx("还是救命重要。你身受重伤，也不方便与为师同行。这样吧，就由这位"..JY.Person[0]["外号"].."送你去找平一指。你伤好后，到福建来找我们。", 19, 0)  --对话
Cls()  --清屏
TalkEx("师父……是嫌弃弟子吗？", 35, 0)  --对话
Cls()  --清屏
TalkEx("岂敢岂敢，令狐少侠剑术非凡，岳某哪有这般好弟子！姗儿，平之，我们走！", 19, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 53,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 52,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 51,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,1,0,774,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(30, 0,1,0,777,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
