if instruct_16(35) == false then  --是否在队伍
	TalkEx("治一人，杀一人。这是为了*维护生态平衡。", 28, 0)  --对话
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
TalkEx("阁下想必就是令狐公子吧？", 28, 0)  --对话
Cls()  --清屏
TalkEx("正是在下。", 35, 1)  --对话
Cls()  --清屏
TalkEx("令狐公子，有人托我给你看*病，你伸手过来，老夫摸摸*你的脉象。", 28, 0)  --对话
Cls()  --清屏
TalkEx("且慢。平大夫，在下听说平*大夫素有杀人名医的称号。*治一人，必须杀一人！", 0, 0)  --对话
Cls()  --清屏
TalkEx("不错。但令狐少侠例外，因*为杀人这件事已经有人替他*办妥了。", 28, 0)  --对话
Cls()  --清屏
TalkEx("我倒想请问平大夫，治好一*人就要杀一人，那么治不好*又如何？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，这天底下就没有我平一*指治不好的病！", 28, 0)  --对话
Cls()  --清屏
TalkEx("平大夫此言未免过于托大，*万一治不好呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼，令狐公子，你伸手过来*，老夫摸摸你的脉象。。。", 28, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("这，这，这……你这伤势要*彻底治好，就算大罗金仙，*只怕也是难以办到，如能戒*酒、戒色、戒斗那么或许能*多活一二年。", 28, 0)  --对话
Cls()  --清屏
TalkEx("平大夫，人生在世，会当畅*情适意，连酒也不能喝，女*人不能想，人家欺到头上不*能还手，还做什么人？不如*及早死了，来得爽快。", 35, 1)  --对话
Cls()  --清屏
TalkEx("令狐公子，你的病我虽然治*不了，但也不见得就是毫无*办法。听说少林易筋经是无*上内功宝典，也许可将你体*内数种内力化解。", 28, 0)  --对话
Cls()  --清屏
TalkEx("平大夫，还记得刚才的话吗*？治不好，便如何？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你，你……治不好，要杀要*剐，系听尊便！", 28, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，没那么严重，在下*只想请平大夫加入我的队伍*，帮我一起寻找十四天书。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，我这就去小村！", 28, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 49,1,0,952,0,0,7228,7228,7228,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(93, 2,0,0,0,0,782,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(70, 29,1,0,115,0,0,5904,5904,5904,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("令狐大哥，咱们上少林去碰*碰运气，说不定就能治好你*的病。", 0, 1)  --对话
Cls()  --清屏
TalkEx("也好。", 35, 0)  --对话
Cls()  --清屏
do return end
