if instruct_16(35) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_14()  --场景变黑
instruct_3(-2, 5,1,0,0,0,0,7170,7170,7170,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("令狐大哥，你怎么了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("…………", 35, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 6,0,0,0,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("冲哥，冲哥，你怎么了？", 73, 0)  --对话
Cls()  --清屏
TalkEx("＜不是吧，冲哥？他俩那些*天不光是在学琴吧……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，冲哥他怎么会这样？", 73, 0)  --对话
Cls()  --清屏
TalkEx("我也不知道啊，我们按你说*的去找平一指，可是平大夫*也治不了，他说只有少林易*筋经或许可以化解令狐大哥*体内的真气。于是我们就到*少室山来了，刚走到这里，*令狐大哥支持不住，晕倒了*……", 0, 1)  --对话
Cls()  --清屏
TalkEx("多谢"..JY.Person[0]["外号"].."这些日子对冲哥的*照顾，我来送他上少林吧。", 73, 0)  --对话
Cls()  --清屏
TalkEx("可是你一个女子，上少林寺*恐怕不方便吧？", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."放心，我自有办法。为*了冲哥，我豁出去了。", 73, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_21(35)  --离开队伍
instruct_3(-2, 5,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 6,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 4,0,0,0,0,784,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("我还是继续找我的天书吧，*以后有空再到少林看望他们*。", 0, 1)  --对话
Cls()  --清屏
if instruct_60(37,10,2286) == false then  --判断场景事件
	instruct_3(37, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏

end
do return end
