instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
TalkEx("这不是令狐少侠么？怎么样？玄慈大师是否已经传授你易筋经了？", 0, 1)  --对话
Cls()  --清屏
TalkEx("没有，玄慈大师说易筋经只能传授给本门弟子，要在下改投少林门下。在下不肯，向方丈辞行后就出来了。", 35, 0)  --对话
Cls()  --清屏
TalkEx("那位姑娘呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("什么姑娘啊？", 35, 0)  --对话
Cls()  --清屏
TalkEx("就是教你学琴的那位姑娘啊。", 0, 0)  --对话
Cls()  --清屏
TalkEx("你是说盈盈啊，她怎么了？", 35, 0)  --对话
Cls()  --清屏
TalkEx("那日我们来到少室山下，你就晕倒了，是她送你上的少林寺啊。现在你下山了，她人呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我不知道啊，也许早就下山了吧。唉，真难为她了。", 35, 0)  --对话
Cls()  --清屏
TalkEx("咦？那边好像有什么声音？", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,7172,7172,7172,-2,-2,-2)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,6770,6770,6770,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,6770,6770,6770,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,6776,6776,6776,-2,-2,-2)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,6776,6776,6776,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,6776,6776,6776,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,6768,6768,6768,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,6766,6766,6766,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,6772,6772,6772,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(17,22,35,40)  --场景移动
TalkEx("向问天，看你这回往哪儿跑！", 200, 0,"青城弟子")  --对话
Cls()  --清屏
TalkEx("向右使，属下可要得罪了。", 202, 0,"日月教徒")  --对话
Cls()  --清屏
TalkEx("向问天这魔教妖人，人人得而诛之。", 199, 0)  --对话
Cls()  --清屏
TalkEx("邪魔外道，危害江湖，我辈中人除妖灭魔，责无旁贷！", 197, 0,"恒山弟子")  --对话
Cls()  --清屏
TalkEx("哈哈哈哈，有本事就尽管来吧！", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("这么多人打一个，好不要脸！", 35, 0)  --对话
Cls()  --清屏
TalkEx("那边两个小子，胡说八道什么？", 202, 0,"日月教徒")  --对话
Cls()  --清屏
TalkEx("八成是跟这姓向得一伙的，拿下他们再说！", 196, 0,"崆峒弟子")  --对话
Cls()  --清屏
TalkEx("我……我不是……＜倒霉倒霉，令狐兄的一句话，就趟上了这趟混水……＞", 0, 1)  --对话
Cls()  --清屏
if WarMain(210, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,1,0,785,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_19(36, 40)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("哈哈哈哈，想不到我向问天危难之际，还能有两位素不相识的朋友相助，好，好，哈哈哈……", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("我反正是个快死之人了，倒是连累了这位"..JY.Person[0]["外号"].."。", 35, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜该死的令狐冲，你还知道啊……＞Ｗ哪里哪里。他们那么多人打一个，不是英雄好汉的行径。就算令狐大哥不说话，我也是要出手的。", 0, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，我向问天能结识两位，真乃三生有幸。这位令狐兄弟，我看你似乎内力全无，不知道是怎么回事？", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("唉，我本来是受了重伤，那桃谷六仙又胡乱医治……", 35, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_13()  --场景变亮
TalkEx("……就这样，我就变得内力全无了……", 35, 0)  --对话
Cls()  --清屏
TalkEx("令狐兄弟的遭遇，当真是闻所未闻啊。不过，据我所知，有一个人能治好你的病。", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("哦？还望向大哥赐教。", 35, 0)  --对话
Cls()  --清屏
TalkEx("西湖梅庄之中，住着一位高人，他有一套奇异的武功，定可化解你体内的异种真气。", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("＜梅庄这地方我还一直没去过，既然有高人，说不定就有十四天书的消息。＞令狐大哥，那咱们就上梅庄吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不过，想见到这位高人着实不易。梅庄还有四位庄主，你们必须将他四人打败，才有可能见到这位高人。", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("哦，不就是打架嘛，这个简单。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我知道四位庄主分别对琴棋书画如痴如狂，只有用每个人喜好的东西来诱惑他们，他们才可能和你交手。我能帮你的就这么多，能不能见到这个人，就看你们的造化啦。", 234, 0,"向问天")  --对话
Cls()  --清屏
TalkEx("多谢向大哥指点迷津。", 35, 0)  --对话
Cls()  --清屏
TalkEx("咱们就此分手吧，有缘的话一定还会见面的。记住，在梅庄不要提起我的名字。", 234, 0,"向问天")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_17(55,1,30,47,0)  --设置场景的值
Cls()  --清屏
instruct_13()  --场景变亮
do return end
