if instruct_4(215) == false then  --是否使用物品
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("啊！这是北宋范宽的真迹“溪山行旅图”，你……你是从何处得来的？", 31, 0)  --对话
Cls()  --清屏
TalkEx("这个你不必管。我听江湖上传言，梅庄四庄主好酒，好画，好剑，人称三绝。那想必对我这幅画定是垂涎三尺了！", 0, 1)  --对话
Cls()  --清屏
TalkEx("你这"..JY.Person[0]["外号2"].."，到底有什么企图？", 31, 0)  --对话
Cls()  --清屏
TalkEx("\"企图\"没有，\"行旅图\"倒是有一幅。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，少贫嘴，我看你是找死！", 31, 0)  --对话
Cls()  --清屏
if WarMain(43, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx(JY.Person[0]["外号2"].."，你等着，待我去请我三哥。", 31, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 8,1,0,789,0,0,6048,6048,6048,-2,-2,-2)  --修改场景事件
instruct_17(-2,1,37,42,0)  --设置场景的值
Cls()  --清屏
instruct_13()  --场景变亮
do return end
