if instruct_4(212) == false then  --是否使用物品
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("\"广陵散\"！！！这\"广陵散\"绝响于人间已久，今日得睹古人名谱，实是不胜之喜。妙极！和平中正，却又清绝幽绝。高量雅致，深藏玄机，便这么神游琴韵，片刻之间已然心怀大畅。", 34, 0)  --对话
Cls()  --清屏
TalkEx("大庄主道号\"黄钟公\"，自是琴中高手。看大庄主读此琴谱时悠心自在，神情平和之状，果是不求声名利禄的世外高人，令小辈万分钦羡。此谱虽然难得，却也不是什么值钱的东西，我留在身上也没用，大庄主就拿去吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("常言道：无功不受禄，你我素无渊源，焉可受你这等厚礼？听我那三个兄弟说道，只须本庄有人武功胜过你，便可得那四样东西，那老朽可不能白占这个便宜。小兄弟，咱们便来比划几招如何？", 34, 0)  --对话
Cls()  --清屏
TalkEx("好，前辈请。", 0, 1)  --对话
Cls()  --清屏
if WarMain(46, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件

end
Cls()  --清屏
instruct_13()  --场景变亮
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟武艺精深，令老朽衷心折服，那\"广陵散\"老夫是无福消受了。", 34, 0)  --对话
else
	TalkEx("小姑娘武艺精深，令老朽衷心折服，那\"广陵散\"老夫是无福消受了。", 34, 0)  --对话
end
Cls()  --清屏
TalkEx("大哥，为了那四样书画，也顾不得那么多了，咱们四兄弟一起上吧。", 32, 0)  --对话
Cls()  --清屏
TalkEx("不可如此，咱们为了那些书画以老欺小已是不该，更岂可以多胜少。", 34, 0)  --对话
Cls()  --清屏
TalkEx("那咱们就请地牢那个老怪……", 33, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜终于说到正主了，嘿嘿……怎么在地牢里？……＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("二弟！住嘴！", 34, 0)  --对话
Cls()  --清屏
TalkEx("大哥，没问题的，有我们在旁边守着，那老怪物跑不掉的。", 33, 0)  --对话
Cls()  --清屏
TalkEx("二弟你还说！"..JY.Person[0]["外号"].."，敝庄中已无可胜你之人，你就请回吧。", 34, 0)  --对话
Cls()  --清屏
instruct_3(-2, 15,-2,0,795,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 14,-2,0,795,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,-2,0,795,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,-2,0,795,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,-2,0,796,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,-2,0,797,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,-2,0,798,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(-2, 0,0,0,0,0,801,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 2,0,0,0,0,801,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,801,0,0,0,-2,-2,-2)  --修改场景事件
do return end
