TalkEx("这位姑娘，请问这里是药王庄吗？Ｌ＜莫非她就是毒手药王？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("你到药王庄来所为何事？", 2, 0)  --对话
Cls()  --清屏
TalkEx("金面佛苗大侠中毒受伤，所用毒药，乃奸人自前辈处盗来，望前辈慈悲赐予解药。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哼！姜师兄又随意将毒药给予外人，江湖上的人又将这笔帐记在师父头上了。这次又是中了什么毒？", 2, 0)  --对话
Cls()  --清屏
TalkEx("原来毒手药王是你师父，害我前辈长前辈短的乱叫，你也不怕折寿吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我又没叫你叫，是你自己爱叫的。", 2, 0)  --对话
Cls()  --清屏
TalkEx("还请姑娘请药王前辈出来，在下想向他求取断肠草的解药。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我师父已经过世了。", 2, 0)  --对话
Cls()  --清屏
TalkEx("那这该如何是好？", 0, 1)  --对话
Cls()  --清屏
TalkEx("这断肠草的毒并不太难解。", 2, 0)  --对话
Cls()  --清屏
TalkEx("原来姑娘已得到药王先生的真传，还请姑娘惠赐解药。", 0, 1)  --对话
Cls()  --清屏
TalkEx("给你解药也是可以，只要你帮我办一件事。", 2, 0)  --对话
Cls()  --清屏
TalkEx("什么事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你功夫好不好？", 2, 0)  --对话
Cls()  --清屏
TalkEx("自然不差。", 0, 1)  --对话
Cls()  --清屏
TalkEx("口气倒是很大。好，那我要你帮我找回一样东西。", 2, 0)  --对话
Cls()  --清屏
TalkEx("什么东西？", 0, 1)  --对话
Cls()  --清屏
TalkEx("七心海棠。这东西自从被我姜师兄盗出去后，现在不知流落何方。若不赶快找回来的话，不知又有多少笔烂帐要记在我药王庄的头上。", 2, 0)  --对话
Cls()  --清屏
TalkEx("那我要到那里去找？", 0, 1)  --对话
Cls()  --清屏
TalkEx("我如果知道还要你去找吗？不过你可以多留意一些滥施毒药，迷药害人的家伙。", 2, 0)  --对话
Cls()  --清屏
TalkEx("尚不知姑娘芳名？", 0, 1)  --对话
Cls()  --清屏
TalkEx("程灵素。", 2, 0)  --对话
Cls()  --清屏
TalkEx("那，灵姑娘，告辞了。", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,-2,0,9,11,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(50, 0,0,0,0,0,10,0,0,0,-2,-2,-2)  --修改场景事件
do return end
