--新增遇到戚长发的事件
--OEVENTLUA[8004] = function()
	dark()
	instruct_3(-2,22,1,0,0,0,0,9230,9230,9230,0,0,0);			--戚长发贴图
	light()

	instruct_25(19,22,20,25);

	say("不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~", 249,0,"戚长发");		--[戚长发]：不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~
	say("师父，原来你没有死！", 37, 5);		--[狄云]：师父，原来你没有死！
	say("云儿，是你。赶紧把连城诀交出来，饶你们不死。", 249,0,"戚长发");		--[戚长发]：云儿，是你。赶紧把连城诀交出来，饶你们不死。
	say("师父，你怎么……", 37, 5);		--[狄云]：师父，你怎么
	say("这连城诀已经有主人了。", 0,1);		--[主角]：这连城诀已经有主人了
	say("找死！", 249,0,"戚长发");		--[戚长发]：找死！
	
	if WarMain(247) == false then
		instruct_15();			--战斗失败，死亡
		return;
	end
	light()
	
	say("不！！！*连城诀是我的，是我的！！*啊~~~~", 249,0,"戚长发");		--[戚长发]：不！！！*连城诀是我的，是我的！！啊~~~~
	
	instruct_14();
	instruct_3(-2,22,0,0,0,0,0,0,0,0,0,0,0);		--清除戚长发贴图
	instruct_19(19,22)
	instruct_13();
	
	instruct_30(19,22,19,32);
	
	say("我的师父……果然是……这样的人。", 37, 0);
	
	say("狄兄弟，你师父之前一直在演戏。", 0,4);
	
	say("他外号叫做‘铁索横江’，那是什么意思？什么事情做不出？", 0,4);
	
	say("我真是不能明白：一个人世上什么亲人都不要，不要师父、师兄弟、徒弟、连亲生女儿也不顾，就算拿到了连城诀和价值连城的宝藏，又有什么快活？", 37, 0);
	
	say("狄兄弟，你说的这个问题很深奥，这世上确实是有这种人。", 0,4);
	
	if JY.Person[0]["性别"] == 0 then
		say("大哥，我想去雪山散散心。", 37, 0);
	else
		say("女侠，我想去雪山散散心。", 37, 0);
	end
		
	say("好，我陪你去。", 0,4);
	
	instruct_3(-2,21,0,0,0,0,0,0,0,0,0,0,0);		--清除路过事件
	
	instruct_3(2,7,1,0,4108,0,0,4610*2,4610*2,4610*2,0,0,0);		--雪山水笙
	
	JY.Person[37]["品德"] = 50	--狄云又可以离队了
--end