--第一次见到，独孤求败
--OEVENTLUA[8013] = function()
	say("武学之道在于变而不在于招，剑学之道不在于剑而在于心，有心万物皆为剑。", 310,0,"独孤求败")
	say("生平求一敌手而不可得，诚寂寥难堪也。", 310,0,"独孤求败")
	
	--[[
	if instruct_5(2,0) then
		say("久仰独孤前辈大名，在下今日特来向前辈请教。", 0, 1);		--久仰独孤前辈大名，在下今日特来向前辈请教
		say("哈哈~~果然是后生可畏~~请~~", 310,0,"独孤求败");		--哈哈~~果然是后生可畏~~请~~"
		
		if WarMain(239) then
			say("好，痛快！吾此生无憾已！", 310,0,"独孤求败");		--好，痛快！吾此生无憾已
			instruct_3(-2,-2,-2,-2,8014,-2,-2,-2,-2,-2,-2,-2,-2);
			return;
		end
		say("武学造诣很好，只可惜太过冒进。先去江湖历练一番吧。", 310,0,"独孤求败");	
		instruct_3(-2,-2,-2,-2,8015,-2,-2,-2,-2,-2,-2,-2,-2);
	end]]