
local ss = {"我不知道","豪门","宗师","名医","神匠"};


local content = string.format("小子，看你那愁眉苦脸的样。"
															.."还%s呢"
															.."来来来，告诉你一个秘密"
															.."关于你的身世，其实我知道一些"
															.."南贤北丑两个老家伙估计也没跟你说啥"
															.."其实我和你祖辈一直都很有渊源"
															.."长话就不多说了，做为一个新的接班人"
															.."觉得自己的家世更像什么呢？"
															.."把你的感觉说出来", ZJTF[JY.Thing[201][WZ7]]);

local m = JYMsgBox("身世之迷",content, ss, limitX(JY.Base["难度"],1,#ss), 0)

if m == 1 then
	if JY.Person[0]["资质"] <= 50 then
		say("看你那呆头呆脑的样，估计也猜不到。算了，先拿四本小说过来再说吧", 0, 5, "龙的传人")
	else
		say("人看起来倒是机灵的，就是想法太少。算了，先拿二本小说过来再说吧", 0, 5, "龙的传人")
	end
	say("< 小说，是不是就是指天书。算了，这人看起来挺怪的，说不定确实知道点什么。>")
	
	instruct_3(-2, -2, -2, 2, 8020, 0, 0, -2, -2, -2, -2, -2, -2)
	
elseif m == 2 then
	
	say("哈哈，没错。你们家族世代经商，只可惜，唉。这些钱留给你的闯江湖用的，希望能打出你的名堂", 0, 5, "龙的传人")
	instruct_2(174, 2000limitX(CC.CircleNum,1,5) + 800JY.Base["难度"]);
	
	say("还有这个护身符，也拿去", 0, 5, "龙的传人")
	instruct_32(238, 1);
	DrawStrBoxWaitKey("提示：护身符默认绑定，无需装备", C_ORANGE, CC.DefaultFont)
	
	JY.Person[0]["无用"] = 238;
	
	say("好了，先去历练吧少年。等学到本事了再回来找我", 0, 5, "龙的传人")
	instruct_3(-2, -2, -2, 2, 8023, 0, 0, -2, -2, -2, -2, -2, -2)
elseif m == 3 then
	say("哈哈，没错。宗师讲究的是气场，以静制动，占据天时地利，方能立于不败之地。", 0, 5, "龙的传人")
	say("好像明白了一点")
	say("别吹牛了，这你都能明白？这玩意给你，反正对我也没啥用", 0, 5, "龙的传人")
	say("< 怎么好像在哪里见过 >这是俄罗斯方块吧")
	say("额，你说呢。这是阵法，笨蛋。", 0, 5, "龙的传人")
	instruct_14();
	instruct_13();
		
	QZXS("数月后....");
	say("可算是明白一点了。原来地形还可以分为吉、凶、大吉、大凶，分别对应绿色、红色、蓝色、紫色。下次打架可有得玩了")
	say("好了，先去历练吧少年。等学到本事了再回来找我", 0, 5, "龙的传人")
	instruct_3(-2, -2, -2, 2, 8024, 0, 0, -2, -2, -2, -2, -2, -2)
else
	say("其它还在设计中，敬请期待!!!!", 0, 5, "龙的传人")
	return;
end

--身世选项
SetS(53, 0, 2, 5, m);
