
local p = JY.Person[0];
local flag = false;
--[[
for i=0, 13 do
	instruct_32(CC.BookStart+i, 1);
end
]]

--身世选择不知道
if GetS(53, 0, 2, 5) == 1 then
	if p["资质"] <= 50 and JY.Base["天书数量"] >= 4 then
		say("很好，这几本小说我就先收下了！", 0, 5, "龙的传人");
		say("这......<好不容易得到的天书>");
		say("跟你开玩笑的了！看你这么宝贝，我向来不夺人所好。另外，关于你的身世，其实我也不知道", 0, 5, "龙的传人");
		say("前辈，你这不是坑我么");
		say("就是坑你！哈哈哈~~~看你这么实诚，我传授你一些技能吧，也算是补过了", 0, 5, "龙的传人");
		say("额，在下不敢当");
		say("这次是真的！日后一定对你大有帮助。别废话了，来吧", 0, 5, "龙的传人");
		
		instruct_14();
		instruct_13();
		
		QZXS("数月后....");
		say("人是笨了点，学武功还挺好的么", 0, 5, "龙的传人");
		say("承蒙前辈的授业之恩");
		say("好了，历练去吧少年。历练对你的武功有很大帮助", 0, 5, "龙的传人");
		flag = true;
	elseif p["资质"] > 50 and JY.Base["天书数量"] >= 2 then
		say("很好，这几本小说我就先收下了！", 0, 5, "龙的传人");
		say("前辈，这天书对我很重要");
		say("给你选择，要你这些破天书呢，还是要绝世武功，我可以教你哦！", 0, 5, "龙的传人");
		say("对不起，在下告辞了");
		say("还挺有个性的么，你的身世之迷不解开了吗，就我知道哦！", 0, 5, "龙的传人");
		say("南叔说了，等凑够天书，我的身世自然会解开");
		say("好了，不难为你了！其实你的身世我也不好当面说，毕竟天机不可泄露。看你武功这么平庸，往后的路不好走啊。来吧", 0, 5, "龙的传人");
		say("要做什么");
		say("废话，当然是教你武功了", 0, 5, "龙的传人");
		instruct_14();
		instruct_13();
		QZXS("数日后....");
		say("悟性高就是好，学武功很快，教武功呢不费劲。好了，就这样了，后面的还要看你自己的造化", 0, 5, "龙的传人");
		say("感谢前辈的教诲，我定当努力练功");
		say("好了，历练去吧少年。历练对你的武功有很大帮助", 0, 5, "龙的传人");
		flag = true;
	end
end

if flag then
	DrawStrBoxWaitKey("提示：隐藏的力量被觉醒", C_ORANGE, CC.DefaultFont)
	instruct_3(-2, -2, -2, 2, 8021, 0, 0, -2, -2, -2, -2, -2, -2)
	SetS(53, 0, 3, 5,1)
else
	say("你觉得是你萌还是我萌", 0, 5, "龙的传人")
	say("废话，肯定是我帅了!!!!");
	say("历练去吧少年，回头你一定会来找我的。另外在系统菜单->系统攻略，里面有一些历练说明，找个时间看看吧", 0, 5, "龙的传人")
end