TalkEx("您就是不喜欢阳光，甘愿呆在地下的那位前辈高人吧？晚辈这厢有礼了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("不喜欢阳光？哈哈哈，这是天大的笑话！你以为老子是自愿呆在在西湖牢底的吗？"..JY.Person[0]["外号2"].."，你是谁？怎么进来的？", 26, 0)  --对话
Cls()  --清屏
TalkEx("梅庄的四位庄主想要在下的几样东西，但是却没本事打赢在下，所以就让在下来这地洞里向老前辈讨教。", 0, 1)  --对话
Cls()  --清屏
TalkEx("几样东西？一定是琴棋书画之类的狗屁玩意，这四个家伙就喜欢附庸风雅。你能把他们打败，看来功夫还可以，有资格跟老子过几招。", 26, 0)  --对话
Cls()  --清屏
TalkEx("其实晚辈此次到梅庄来，并非是为了与前辈比武较量，是向问天向大哥说……", 0, 1)  --对话
Cls()  --清屏
TalkEx("向问天？是他叫你来的？Ｌ＜向问天一向对我忠心耿耿，他叫此人来，一定是要想办法救我出去的＞", 26, 0)  --对话
Cls()  --清屏
TalkEx("是的。这位令狐大哥受了重伤，内力全无，向大哥说老前辈有办法可以医治。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦？让我看看……嗯，你体内有数个异种真气乱窜……嗯，我的确有一种神功可治此伤……你叫什么名字？是哪个门派的？", 26, 0)  --对话
Cls()  --清屏
TalkEx("晚辈令狐冲，是华山门下。", 35, 1)  --对话
Cls()  --清屏
TalkEx("华山派的掌门还是岳不群吧？这个人是个道貌岸然的伪君子，不值一提。不过华山派有一位风清扬风老剑客，剑术精湛，我一向是很佩服的。", 26, 0)  --对话
Cls()  --清屏
TalkEx("晚辈有幸，曾得风老前辈传授剑术。", 35, 1)  --对话
Cls()  --清屏
TalkEx("你是风清扬得传人？哈哈，好，好，我这吸星大法本不愿传给岳不群的徒弟，既然你是风清扬的传人，老夫就没什么顾忌啦。", 26, 0)  --对话
Cls()  --清屏
instruct_2(65, 1)  --得到或失去物品
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，梅庄那四个老家伙还在外面看着呢，我们不管真假总要比试比试。进招吧！", 26, 0)  --对话
else
	TalkEx("小姑娘，梅庄那四个老家伙还在外面看着呢，我们不管真假总要比试比试。进招吧！", 26, 0)  --对话
end
Cls()  --清屏
if WarMain(211, 0) == false then  --战斗开始
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，你的功夫的确不错，再来试试老夫这套剑法……哈哈哈哈哈哈哈……", 26, 0)  --对话
else
	TalkEx("小姑娘，你的功夫的确不错，再来试试老夫这套剑法……哈哈哈哈哈哈哈……", 26, 0)  --对话
end
Cls()  --清屏
TalkEx("啊……", 0, 1)  --对话
Cls()  --清屏
instruct_27(-1,5974,5992)  --显示人物动画
instruct_14()  --场景变黑
instruct_32(212,-1)  --得到或失去物品
instruct_32(214,-1)  --得到或失去物品
instruct_32(213,-1)  --得到或失去物品
instruct_32(215,-1)  --得到或失去物品
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(55, 23,0,0,0,0,0,6074,6074,6074,-2,-2,-2)  --修改场景事件
instruct_3(55, 22,0,0,0,0,0,6062,6062,6062,-2,-2,-2)  --修改场景事件
instruct_3(55, 21,0,0,0,0,0,6050,6050,6050,-2,-2,-2)  --修改场景事件
instruct_3(55, 20,0,0,0,0,0,6066,6066,6066,-2,-2,-2)  --修改场景事件
instruct_3(55, 24,0,0,0,0,805,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(55, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_27(-1,6010,6024)  --显示人物动画
TalkEx("奇怪，刚才那位老前辈一声吼，我就晕过去了。他的功力真是深不可测啊。令狐大哥，你怎么样？", 0, 1)  --对话
Cls()  --清屏
TalkEx("还好，还好，不知道这个老前辈是谁，怎么不见了？", 35, 1)  --对话
Cls()  --清屏
TalkEx("他传给你的吸星大法，我看像是真的，你以后练练试试，也许你的伤就能治好。", 0, 1)  --对话
Cls()  --清屏
TalkEx("嗯，我想向大哥应该不会骗我们。", 35, 1)  --对话
Cls()  --清屏
TalkEx("不过向大哥叫我们来这里似乎另有目的，我也说不清楚，感觉怪怪的，我们先出去吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好的。", 35, 1)  --对话
Cls()  --清屏
instruct_35(35,1,88,700)  --令狐冲洗吸星
SetTianNei(35,88)	--令狐冲天内洗吸星
do return end
