instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
TalkEx("你这臭"..JY.Person[0]["外号2"].."，看你做了什么好事？", 33, 0)  --对话
Cls()  --清屏
TalkEx("我早该知道天底下那有这么好的事情，原来这一切都是你设计出来的诡计。", 34, 0)  --对话
Cls()  --清屏
TalkEx("你这"..JY.Person[0]["外号2"].."，竟然利用我们所好，实在太可恶了。", 32, 0)  --对话
Cls()  --清屏
TalkEx("你们在那你一言我一句的，唱双簧啊！", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，你真是太大胆了，竟敢把任老怪给放了，看我饶不饶你！", 31, 0)  --对话
Cls()  --清屏
TalkEx("大哥，别跟这"..JY.Person[0]["外号2"].."罗嗦了，此时再也顾不得什么以老欺小的狗屁道义了。先将这"..JY.Person[0]["外号2"].."捉上黑木崖，向东方教主请罪，否则咱们可就吃不完兜着走了。", 33, 0)  --对话
Cls()  --清屏
TalkEx("好，咱们一起上。", 34, 0)  --对话
Cls()  --清屏
TalkEx("谁怕谁！乌龟怕铁鎚！四个一起上最好，省得我麻烦。", 0, 1)  --对话
Cls()  --清屏
if WarMain(47, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx(JY.Person[0]["外号2"].."，你可知你放走的是谁？", 31, 0)  --对话
Cls()  --清屏
TalkEx("不就是一位不喜欢阳光，喜欢生活在地洞里的老前辈吗？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你是真不知还是假不知，你放走了任老怪，就是与东方教主和我日月神教为敌。", 32, 0)  --对话
Cls()  --清屏
TalkEx("我们是奉教主之命，在此看守任老怪的，你居然利用我们的弱点救他出去。", 33, 0)  --对话
Cls()  --清屏
TalkEx("你要知道，任老怪重出江湖，江湖上又将是一场血雨腥风。那个小子，你是华山派的吧，任我行重出江湖可能第一个要灭掉的就是你华山派！", 31, 0)  --对话
Cls()  --清屏
TalkEx("什么……？", 35, 1)  --对话
Cls()  --清屏
TalkEx("别说了，得赶紧回黑木崖向东方教主报告这件事。走！", 34, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("那个人，那个人就是任我行，日月神教的前任教主？？！！", 35, 1)  --对话
Cls()  --清屏
TalkEx("令狐大哥，你接下来有什么打算？", 0, 1)  --对话
Cls()  --清屏
TalkEx("你刚才也听到了，任我行重出江湖是一件大事，我要赶去福建，向我师父禀报。", 35, 1)  --对话
Cls()  --清屏
TalkEx("那好吧，令狐大哥，咱们就此别过，后会有期。", 0, 1)  --对话
Cls()  --清屏
instruct_3(56, 10,0,0,0,0,883,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(56, 12,0,0,0,0,883,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(56, 11,0,0,0,0,883,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(56, 7,0,0,0,0,0,5962,5962,5962,-2,-2,-2)  --修改场景事件
instruct_3(56, 8,0,0,0,0,0,7166,7166,7166,-2,-2,-2)  --修改场景事件
instruct_3(56, 9,0,0,0,0,0,7152,7152,7152,-2,-2,-2)  --修改场景事件
instruct_3(56, 6,0,0,0,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_21(35)  --离开队伍
do return end
