--OEVENTLUA[8203] = function()
	if instruct_18(84) then
		SetS(18,22,22,3,12)
		SetS(18,22,23,3,13)
		SetS(18,15,20,3,14)
		instruct_3(-2,12,0,0,0,0,8204,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [12]
		instruct_3(-2,13,0,0,0,0,8204,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [13]
		instruct_3(-2,14,0,0,0,0,0,7108,7108,7108,-2,-2,-2);   --  3(3):修改事件定义:当前场景:场景事件编号 [14]
		instruct_3(-2,10,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [10]
		instruct_3(-2,11,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [11]
	end
--end