TalkEx("哪里来的野"..JY.Person[0]["外号2"].."，敢硬闯我嵩山派！", 22, 0)  --对话
Cls()  --清屏
TalkEx("嵩山派身为五岳盟主，我以为武功必是极高的，没想到，唉，不过如此。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好"..JY.Person[0]["外号2"].."，你够狂，今日就让你尝尝嵩山剑法的厉害。", 22, 0)  --对话
Cls()  --清屏
if WarMain(38, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
instruct_2(128, 1)  --得到或失去物品
Cls()  --清屏
TalkEx(JY.Person[0]["外号2"].."，你功夫不错，我正在进行一项功在千秋的大事业，你加入我嵩山派吧。", 22, 0)  --对话
Cls()  --清屏
TalkEx("对不起，我没兴趣。＜你能有什么大事业，南贤老头都已经说了，我找寻十四天书才是最大的事业！＞", 0, 1)  --对话
Cls()  --清屏
instruct_3(-2, -2,-2,0,829,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
do return end
