--畅想杨过
if JY.Base["畅想"] == 58 then
	instruct_14()  --场景变黑
	instruct_13()  --场景变亮
	instruct_25(25,41,31,36)  --场景移动
	TalkEx("嘿嘿，一个死丫头，一个瘸铁匠，黄老邪果然尽捡些脓包回来做弟子，到世上丢人现眼。", 161, 0)  --对话
	Cls()  --清屏
	TalkEx("请你莫说我恩师坏话。", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	TalkEx("人家早不要你做弟子了，你还恩师长、恩师短的，也不怕人笑掉了牙齿。", 161, 0)  --对话
	Cls()  --清屏
	if instruct_16(78) then  --是否在队伍
		TalkEx("谁敢说我恩师？即使他不认我们做徒弟，我们也永远认他做恩师！", 78, 1)  --对话
		Cls()  --清屏

	end
	instruct_25(31,36,25,41)  --场景移动
	instruct_30(25,41,25,38)
	instruct_30(25,38,28,38)
	stands()
	
	say("李师伯？你有没有见到我姑姑？", 0, 5)  --对话
	
	addevent(-2, 3, 1, nil, nil, 4206*2)
	
	say("哟，这不是师妹的小情人么，怎么你跟她吵架了？", 161, 0)  --对话
	
	say("请你对我姑姑尊重点。", 0, 5)  --对话
	
	say("哼，还叫姑姑？你们做过什么苟且之事，自己心里清楚，还怕别人说吗？", 161, 0)  --对话
	
	say("住口！", 0, 5)  --对话
	
	JY.Person[161]["血量翻倍"] = JY.Person[592]["血量翻倍"]
	if WarMain(52, 0) == false then  --战斗开始
		Cls()  --清屏
		instruct_15()  --死亡
		Cls()  --清屏
		do return end  --无条件结束事件
		Cls()  --清屏

	end
	JY.Person[161]["血量翻倍"] = 1
	instruct_19(30, 37)  --设置人物XY坐标
	instruct_40(1)  --设置主角方向
	instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
	do return end
else
	if instruct_16(59) == false then  --是否在队伍
		Cls()  --清屏
		say("此段剧情需要小龙女在队才可触发。",0,2)
		Cls()  --清屏
		instruct_30(25, 41, 25, 42)
		do return end  --无条件结束事件

	end
end
instruct_14()  --场景变黑
instruct_13()  --场景变亮
instruct_25(25,41,31,36)  --场景移动

--李莫愁
say("你们两个竟敢坏我好事，放跑了姓杨的那小子。",161,0)

--小龙女
say("师姐，你见到了过儿？",59,4)

--李莫愁
say("哟，原来是我的好师妹～～师妹不是说要在古墓终此一生的么？怎么，为了小情人下山了？",161,0)

--程英
say("这位姑娘请放心，杨大哥已脱身而去。",63,4)

TalkEx("嘿嘿，一个死丫头，一个瘸铁匠，黄老邪果然尽捡些脓包回来做弟子，到世上丢人现眼。", 161, 0)  --对话
Cls()  --清屏
TalkEx("请你莫说我恩师坏话。", 236, 0,"冯默风")  --对话
Cls()  --清屏
TalkEx("人家早不要你做弟子了，你还恩师长、恩师短的，也不怕人笑掉了牙齿。", 161, 0)  --对话
Cls()  --清屏
if instruct_16(78) then  --是否在队伍
	TalkEx("谁敢说我恩师？即使他不认我们做徒弟，我们也永远认他做恩师！", 78, 1)  --对话
	Cls()  --清屏

end
say("哼，既然坏我好事，我就先杀了你们！",161,0)
Cls()  --清屏
say("且慢伤人！",0,4)
Cls()  --清屏
JY.Person[161]["血量翻倍"] = JY.Person[592]["血量翻倍"]
if WarMain(52, 0) == false then  --战斗开始
	Cls()  --清屏
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
JY.Person[161]["血量翻倍"] = 1
instruct_19(30, 37)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_3(-2, 2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
do return end
