--畅想杨过
if JY.Base["畅想"] == 58 then
	dark()
	instruct_19(31,38)
	instruct_40(0)  --主角面向右
	stands()
	light()

	--程英
	say("大哥，多谢你了。",63,0)
	
	--主角
	say("适才听那李莫愁之言，姑娘似乎是桃花岛主黄药师之徒？",0,5)

	--程英
	say("不错，在下程英，乃是恩师的关门弟子。",63,0)

	--主角
	say("不知道程姑娘有没有见过一位白衣女子？",0,5)

	--程英
	say("Ｌ＜看他的神态，这位白衣女子一定是他的心上人＞Ｗ没有，不过大哥既然对我有救命之恩，小妹愿意随你一起去找，多一个人总是多一份力。",63,0)

	--主角
	say("那就多谢程姑娘了。",0,5)
	
	--绝情谷事件
	instruct_26(22,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
	addevent(22, 6, 1, nil, nil, 3034*2)
	--addevent(22, 12, 1, nil, nil, 4248*2)
	addevent(22, 13, 1, nil, nil, 3554*2)

	Cls()  --清屏
	instruct_3(104, 60,1,0,971,0,0,7244,7244,7244,-2,-2,-2)  --修改场景事件
	if instruct_20() == false then  --判断队伍是否已满
		dark()
		instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
		Cls()  --清屏
		light()
		instruct_10(63)  --加入队伍
		Cls()  --清屏
		do return end  --无条件结束事件

	end
	TalkEx("你的队伍已满，我就直接去小村吧。", 63, 0)  --对话
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 30,1,0,155,0,0,6120,6120,6120,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end
else
	if instruct_16(59) == false then  --是否在队伍
		Cls()  --清屏
		say("此段剧情需要小龙女在队才可触发。",0,2)
		do return end  --无条件结束事件

	end
end

dark()
instruct_19(31,38)
instruct_40(0)  --主角面向右
stands()
addevent(-2, 3, 1, nil, nil, 4349*2)
light()

--主角
say("适才听那李莫愁之言，姑娘似乎是桃花岛主黄药师之徒？",0,4)

--程英
say("不错，在下程英，乃是恩师的关门弟子。",63,0)

--主角
say("程姑娘似乎见过杨过杨兄弟？不知道他现在何处？你们又为何被李莫愁追杀？",0,4)

--程英
say("杨大哥此前帮我表妹逃离李莫愁的魔掌，被李莫愁这魔头追杀，幸亏我和师兄及时赶到。",63,0)
say("李莫愁见赶不上杨大哥，便转过头来为难我们。",63,0)

--小龙女
say("过儿……他现在还好吗？",59,4)

--程英
say("这位姑娘是？",63,0)

--主角
say("这是杨过的师父龙姑娘，在下正和她找寻杨过。",0,4)

--程英
say("原来你就是杨大哥的师父，杨大哥经常说起你的事情，他说当今世上，最关心他的便是龙姑娘了。",63,0)

--小龙女
say("我是他的师父，也要做他的妻子。",59,4)

--程英
say("杨大哥他……他不是你的徒儿吗？",63,0)

--小龙女
say("是啊！我从前教过他武功，可是他现下武功跟我一般强了。他心里欢喜我，我也很欢喜他。",59,4)

--冯铁匠
say("龙姑娘，有句话我不知道当讲不当讲，师徒之间，尊卑有序，是不能结合的，若此事被天下人知道，恐怕很多人要一辈子瞧你不起。",236, 0,"冯默风")

--小龙女
say("别人瞧我不起，又有什么关系？",59,4)

--程英
say("可是……杨大哥呢？别人也要瞧他不起。",63,0)

--小龙女
say("他和我一辈子住在谁也瞧不见的地方，快快活活，理会旁人作甚？",59,4)

--冯铁匠
say("什么谁也瞧不见的地方？",236, 0,"冯默风")

--小龙女
say("那是一座好大的古墓，我向来就住在里面的。",59,4)

--程英
say("杨大哥生性好动，喜欢热闹，老是关在一座坟墓之中，难道不气闷么？",63,0)

--小龙女
say("有我陪着他，怎会气闷？",59,4)

--冯铁匠
say("我年纪虚长，是过来人，姑娘听我一言。初时自是不会气闷。但多过得几年，他就会想到外边的花花世界，他倘若老是不能出来，就会烦恼了。",236, 0,"冯默风")

--小龙女
say("Ｌ＜过儿从小在外边东飘西荡，他们这话说得也有道理。将来他终究会气闷，要出墓来，那时人人都瞧他不起，他做人有何乐趣？＞",59,4)
say("Ｌ＜我喜欢他、疼爱他，要了我的性命也行。可是这般反而害得他不快活，那他还是……还是不娶我的好。嗯……那天他不肯答应要我做他妻子，自必为此了＞",59,4)

say("小龙女沉思良久，决定离队",0,2)

--主角
say("龙姑娘，你要去哪里？",0,0)

--小龙女离队
dark()
null(-2,3)
instruct_21(59)
--绝情谷事件
instruct_26(22,0,1,0,0);   --  26(1A):增加场景事件编号的三个触发事件编号
addevent(22, 6, 1, nil, nil, 3034*2)
addevent(22, 12, 1, nil, nil, 4248*2)
addevent(22, 13, 1, nil, nil, 3554*2)
light()

--程英
say("是不是我说错话了？龙姑娘……",63,0)

--主角
say("世俗之见，其实有时也未必就对。算了，先不想这让人头疼的问题了。",0,4)
say("不知程姑娘可否与在下一游，帮忙寻找那十四天书？",0,4)

if JY.Person[0]["性别"] == 0 then
	TalkEx("嗯！好吧。反正我一人在此也是无聊，就随公子一游吧。", 63, 0)  --对话
else
	TalkEx("嗯！好吧。反正我一人在此也是无聊，就随姑娘一游吧。", 63, 0)  --对话
end
Cls()  --清屏
instruct_3(104, 60,1,0,971,0,0,7244,7244,7244,-2,-2,-2)  --修改场景事件
if instruct_20() == false then  --判断队伍是否已满
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	Cls()  --清屏
	instruct_10(63)  --加入队伍
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("你的队伍已满，我就直接去小村吧。", 63, 0)  --对话
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 30,1,0,155,0,0,6120,6120,6120,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
