if instruct_16(78) then  --是否在队伍
	TalkEx("师姐，真的是你？？", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	TalkEx("默风，是我啊。这些年……你过得好吗？", 78, 1)  --对话
	Cls()  --清屏
	TalkEx("自从被师父挑断脚筋，逐出桃花岛，我一直是颠沛流离，没过过一天安稳日子啊……", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	TalkEx("唉，都是我害了你……", 78, 1)  --对话
	Cls()  --清屏
	TalkEx("师姐，别这么说，从前得事情都已经过去了。如今能再次见到师姐，我真的很高兴。", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	TalkEx("默风，我看你一个人也很孤单，不如一起去小村吧。", 78, 1)  --对话
	Cls()  --清屏
	TalkEx("好，我听师姐的。", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 45,1,0,847,848,0,7022,7022,7022,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

end
TalkEx("感谢少侠的救命之恩。", 236, 0,"冯默风")  --对话
Cls()  --清屏
TalkEx("前辈太客气了。", 0, 1)  --对话
Cls()  --清屏
if instruct_43(101) == false then  --判断是否有物品
	TalkEx("真是怀念桃花岛啊……", 236, 0,"冯默风")  --对话
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
TalkEx("咦？你也曾经学过桃花岛的武功吗？", 236, 0,"冯默风")  --对话
Cls()  --清屏
TalkEx("是啊，晚辈有幸，得蒙黄岛主传授武功。", 0, 1)  --对话
Cls()  --清屏
TalkEx("这么说来，我们也算是师兄弟了。你有什么需要我帮忙的，尽管说。", 236, 0,"冯默风")  --对话
Cls()  --清屏
TalkEx("那能否请前辈到小村去，帮我打造一些兵器。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好，咱们这就走！", 236, 0,"冯默风")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 45,1,0,847,848,0,7022,7022,7022,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
