if instruct_4(195) == false then  --是否使用物品
	Cls()  --清屏
	do return end  --无条件结束事件

end
TalkEx("这……这把铲子……你，你就是来教我们娃练武的吧？", 203, 0, "村夫")  --对话
Cls()  --清屏
if instruct_11() == false then  --是/否
	TalkEx("对不起，我可没那闲工夫！", 0, 1)  --对话
	Cls()  --清屏
	instruct_37(-10)  --增加品德
	instruct_3(-2, -2,1,0,880,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(83, 39,0,0,0,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_37(1)  --增加品德
TalkEx("太好了……太好了……", 203, 0, "村夫")  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 9,1,0,0,0,0,6798,6798,6798,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_19(36, 26)  --设置人物XY坐标
instruct_40(2)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("孩子们，你们的老师终于来了，这可是个难得的机会，大家要认真学，好的老师会带你上天堂哦。", 203, 0, "村夫") --对话
Cls()  --清屏
Cls()  --清屏
instruct_27(-1,7184,7206)  --显示人物动画
instruct_27(-1,7184,7206)  --显示人物动画
instruct_27(-1,7184,7206)  --显示人物动画
instruct_14()  --场景变黑
instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 4,1,0,881,0,0,6798,6798,6798,-2,-2,-2)  --修改场景事件
instruct_19(23, 24)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("真是太感谢你了，这些娃子上不起武馆，一直都没有人教他们。今天你教了他们，说不定他们长大了都会成为名扬天下的大侠呢。唉，我们这里穷，没多少报酬，这是我积攒了半年才攒够的五两银子，你拿着吧。", 203, 0, "村夫")  --对话
Cls()  --清屏
TalkEx("Ｌ＜不是吧？半年才攒了五两银子？还不够我一次斗地主的呢……我该收吗？＞", 0, 1)  --对话
Cls()  --清屏
if instruct_11() == false then  --是/否
	Cls()  --清屏
	TalkEx("Ｌ＜这么点钱，还不如不要呢，干脆好人做到底吧＞Ｗ大叔，我怎么能收您底钱呢，这钱给孩子们买点书吧。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("好人啊，你真是好人啊，我为唱个曲吧。", 203, 0, "村夫")  --对话
	Cls()  --清屏
	TalkEx("好啊。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("青风相待，白云相爱。梦不到紫罗袍共黄金带。一茅斋，野花开，管甚谁家兴废谁成败？陋巷单瓢亦乐哉。贫，气如山！达，志如山！", 203, 0, "村夫")  --对话
	Cls()  --清屏
	TalkEx("这曲真好，我记下了。大叔，我还有事，先告辞了。", 0, 1)  --对话
	Cls()  --清屏
	instruct_3(47, 16,1,0,0,0,0,2800,2800,2800,-2,-2,-2)  --修改场景事件
	instruct_37(1)  --增加品德
	do return end  --无条件结束事件

end
Cls()  --清屏
TalkEx("Ｌ＜付出了就要有回报，虽然少点，但也比没有强啊＞Ｗ那我就不客气了。", 0, 1)  --对话
Cls()  --清屏
instruct_2(174, 5)  --得到或失去物品
Cls()  --清屏
do return end
