if instruct_16(35) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_14()  --场景变黑
instruct_3(-2, 29,0,0,0,0,0,5952,5952,5952,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(22,26,21,16)  --场景移动
TalkEx("咦？那不是衡山派的莫大师*伯吗？", 35, 0)  --对话
Cls()  --清屏
TalkEx("不错，我们过去看看。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 30,0,0,0,0,0,7158,7158,7158,-2,-2,-2)  --修改场景事件
instruct_19(22, 17)  --设置人物XY坐标
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("唉，有多少风流，便有多少*罪孽。", 20, 0)  --对话
Cls()  --清屏
TalkEx("晚辈令狐冲拜见莫师伯。", 35, 1)  --对话
Cls()  --清屏
TalkEx("令狐兄弟，魔教的任大小姐*对你情深一往，你可千万不*能辜负她啊。我劝你尽管去*少林将那位任大小姐救了出*来，娶她为妻便是。别人不*来喝你的喜酒，我莫大偏来*喝你三杯。", 20, 0)  --对话
Cls()  --清屏
TalkEx("去少林救任小姐？莫师伯，*到底少林派为什么要拘留任*小姐？", 35, 1)  --对话
Cls()  --清屏
TalkEx("你是当真不知，还是明知故*问？你的内伤后来怎地却好*了？是修习了少林派的‘易*筋经’神功，是不是？", 20, 0)  --对话
Cls()  --清屏
TalkEx("不是。少林派方丈玄慈大师*慈悲为怀，答允传授少林派*无上内功。只是小侄不愿改*投少林派，而这门少林神功*又不能传授派外之人，只好*辜负了方丈大师的一番美意*。", 35, 1)  --对话
Cls()  --清屏
TalkEx("少林派和你向来并无渊源，*决不能随便传人以本门的无*上神功。玄慈大师答应以‘*易筋经’相授，是因为那日*那日黑木崖任大小姐求见方*丈，说道只须方丈救了你的*性命，她便任由少林寺处置*，要杀要剐，绝不皱眉。这*位任大小姐虽然出身魔教，*但待你的至诚至情，她去到*少林，自无生还之望，但为*了救你，她……她是全不顾*己了。玄慈大师不愿就此杀*她，却也不能放她，因此将*她囚禁在少林寺后的山洞之*中。", 20, 0)  --对话
Cls()  --清屏
TalkEx("原来如此。盈盈对我情意深*重，我这就去去闯少林，能*救得出她来，那是最好，如*救不出来盈盈，我宁愿死在*少林。", 35, 1)  --对话
Cls()  --清屏
TalkEx("好，这才是有情有意的真丈*夫！", 20, 0)  --对话
Cls()  --清屏
TalkEx("令狐大哥，我陪你一起去。", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 15,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(28, 12,1,0,885,-2,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
