instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,6078,6078,6078,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,7216,7216,7216,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,7146,7146,7146,-2,-2,-2)  --修改场景事件
instruct_19(26, 23)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("盈盈，他们把你救出来了？*好。冲儿，你和盈盈的事情*我都知道了，也是机缘巧合*，你也学会了老夫的吸星大*法，所以你的内伤也好了起*来。今天老夫要回黑木崖找*东方不败算账去，你可愿意*助老夫一臂之力？", 26, 0)  --对话
Cls()  --清屏
TalkEx("冲哥，当初东方不败使奸计*害得我爹爹铁牢内呆了十几*年，不见天日，要是没有你*们现在我们父女还不能相见*。", 73, 0)  --对话
Cls()  --清屏
TalkEx("好！前辈不提我也要协助前*辈去黑木崖会会东方不败。"..JY.Person[0]["外号"].."，此次风险太大，甚*至有生命危险，咱们就此别*过，如果这次我们能顺利得*胜，我再去找你，咱们再一*起闯荡江湖。", 35, 0)  --对话
Cls()  --清屏
TalkEx("令狐大哥怎么能这么说话？*我不是贪生怕死之徒，如任*前辈不弃，咱们一起去，我*愿助你们一臂之力。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哈哈哈哈哈！直爽，你这个*朋友我任我行交定了，咱们*也不用客气，我和向左使现*在就去黑木崖摸摸情况，你*们三个娃娃尽快赶来。", 26, 0)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."，感谢你帮我救出盈*盈，这是风老前辈传给我的*剑法，你也学学吧。我和盈*盈先回小村，等你准*备好了，我们再一同前往黑*木崖。", 35, 0)  --对话
Cls()  --清屏
instruct_2(114, 1)  --得到或失去物品
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(104, 73,1,0,974,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
instruct_3(104, 65,1,0,954,0,0,7146,7146,7146,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(70, 15,1,0,121,0,0,5722,5748,5722,-2,-2,-2)  --修改场景事件
instruct_3(70, 35,1,0,161,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
instruct_21(35)  --离开队伍
Cls()  --清屏
instruct_13()  --场景变亮
do return end
