if instruct_16(601) == false then  --是否在队伍
	Cls()  --清屏
	do return end  --无条件结束事件
end
dark()
instruct_3(76, 0,1,0,0,0,0,6292,6292,6292,-2,-2,-2)  --修改场景事件
instruct_3(76, 1,1,0,0,0,0,5956,5956,5956,-2,-2,-2)  --修改场景事件
instruct_3(76, 2,1,0,0,0,0,6306,6306,6306,-2,-2,-2)  --修改场景事件
instruct_3(76, 11,1,0,0,0,0,7030,7030,7030,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
light()
instruct_25(29,43,29,32)  --场景移动
TalkEx("…………", 86, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜咦？这个妞好正点啊，我韦小宝发誓一定要娶他做老婆＞", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("韦兄，你瞎叨咕什么呢？好像有人受伤了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("冯锡范，你为何对我忽施暗算？", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("我奉命拿你！", 150, 0)  --对话
Cls()  --清屏
TalkEx("陈永华，你还把我放在眼里么？", 139, 0)  --对话
Cls()  --清屏
TalkEx("二公子何出此言？", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("嘿嘿，台湾就快成你姓陈的一个人的了。", 150, 0)  --对话
Cls()  --清屏
TalkEx("不，台湾绝不是姓陈的一个人的，也不是某些人的，台湾是所有台湾人的台湾，是所有中国人的台湾。", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("你目无主上，不敬重我，就是不敬重父王。我瞧你所作所为，早有不臣之心，哼，你在中原拚命培植自己势力，扩充天地会，哪里还把台湾郑家放在心上。你想自立为王，是不是？", 139, 0)  --对话
Cls()  --清屏
TalkEx("绝无此事！", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("你早得到此书，却不肯交给我，你心里还有父王没有？", 139, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜有书？＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("二公子不用跟他多废话，看我扁死他！", 150, 0)  --对话
Cls()  --清屏
TalkEx("扁我？我拼了这条命，也要倒扁，坚决倒扁！", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("不好，那是我师父，快救人。", 225, 1,"韦小宝")  --对话
Cls()  --清屏
if WarMain(136, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_19(27, 33)  --设置人物XY坐标
instruct_40(1)  --设置主角方向
instruct_17(-2,1,27,31,4323*2)  --设置场景的值
Cls()  --清屏
stands()
instruct_13()  --场景变亮
TalkEx("哼，你竟敢害我师父，活得不耐烦了，看我……", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("你别杀他！", 86, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜乖乖，我老婆怎么帮他说话，想让我当王八吗？＞", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("你别杀他，要杀就杀我吧。", 86, 0)  --对话
Cls()  --清屏
TalkEx("好啊，那我就先杀你。", 225, 1,"韦小宝") --对话
Cls()  --清屏
TalkEx("郑公子，永别了，我们来世再做夫妻。", 86, 0)  --对话
Cls()  --清屏
TalkEx("你们两个我只能放一个，你说我该放谁呢？姓郑的，你怎么不说话？", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("……求求你放了我，我……", 139, 0)  --对话
Cls()  --清屏
TalkEx("郑公子！不要向他求饶！", 86, 0)  --对话
Cls()  --清屏
TalkEx("求"..JY.Person[0]["外号"].."放了我……", 139, 0)  --对话
Cls()  --清屏
TalkEx("我要是放了你，就得杀这妞！", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("郑公子，你是做大事的人，还是让他杀了我吧……", 86, 0)  --对话
Cls()  --清屏
TalkEx("…………", 139, 0)  --对话
Cls()  --清屏
TalkEx("……唉，没想到我老婆这么喜欢这小白脸……算了，看在我老婆的份上，今天就放了你们……", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("谁是你老婆？我死也不会嫁给你！", 86, 0)  --对话
Cls()  --清屏
TalkEx("谢谢几位……", 139, 0)  --对话
Cls()  --清屏
TalkEx("滚吧！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 1,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_17(-2,1,27,31,4324*2)  --设置场景的值
instruct_13()  --场景变亮
TalkEx("师父，你没事吧。", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("小宝，你来的正好。我没事。多谢这位"..JY.Person[0]["外号"].."相助。你的事情我都听说了，虽然我没有十四天书，但这里有半部四十二章经，也许可以帮上你的忙。", 229, 0,"陈近南")  --对话
Cls()  --清屏
if instruct_43(228) == false then  --判断是否有物品
	instruct_2(228, 1)  --得到或失去物品
	Cls()  --清屏
	TalkEx("多谢总舵主。人言“平生不识陈近南，纵是英雄也枉然”，今日能得见总舵主一面，真乃三生有幸啊。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("江湖上朋友的谬赞，"..JY.Person[0]["外号"].."客气了。", 229, 0,"陈近南")  --对话
	Cls()  --清屏
	TalkEx("师父，我们好不容易见了面，就一起多住几日。", 225, 1,"韦小宝")  --对话
	Cls()  --清屏
	TalkEx("小宝，师父还有要事。反清复明的大业一日未成，为师是不会休息的。小宝，这位"..JY.Person[0]["外号"].."，咱们后会有期。", 229, 0,"陈近南")  --对话
	Cls()  --清屏
	TalkEx("总舵主慢走！", 0, 1)  --对话
	Cls()  --清屏
	instruct_14()  --场景变黑
	instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_17(-2,1,27,31,0)  --设置场景的值
	Cls()  --清屏
	instruct_13()  --场景变亮
	Cls()  --清屏
	do return end  --无条件结束事件

end
instruct_26(1,10,1,0,0)  --修改场景事件
instruct_26(1,7,1,0,0)  --修改场景事件
TalkEx("又是半部四十二章经？我看看……哈哈，正好可以合成一部完整的四十二章经。不过这本书到底有什么用呢？没什么用的话，拿在手里也是累赘，还不如烧了算了。", 0, 1)  --对话
Cls()  --清屏
instruct_2(229, 1)  --得到或失去物品
instruct_32(228,-1)  --得到或失去物品
TalkEx("多谢总舵主。人言“平生不识陈近南，纵是英雄也枉然”，今日能得见总舵主一面，真乃三生有幸啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx("江湖上朋友的谬赞，"..JY.Person[0]["外号"].."客气了。", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("师父，我们好不容易见了面，就一起多住几日。", 225, 1,"韦小宝")  --对话
Cls()  --清屏
TalkEx("小宝，师父还有要事。反清复明的大业一日未成，为师是不会休息的。小宝，这位"..JY.Person[0]["外号"].."，咱们后会有期。", 229, 0,"陈近南")  --对话
Cls()  --清屏
TalkEx("总舵主慢走！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 0,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_17(-2,1,27,31,0)  --设置场景的值
instruct_3(69, 11,1,0,90,0,0,8256,8256,8256,-2,-2,-2)  --修改场景事件
instruct_3(69, 10,1,0,91,0,0,7036,7036,7036,-2,-2,-2)  --修改场景事件
instruct_3(69, 12,1,0,92,0,0,7030,7030,7030,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("唉，遇见两个大美女，都被你放跑了，看来跟着你你甭想泡到妞了，我要自己去追！！", 225, 1,"韦小宝")  --对话
Cls()  --清屏
instruct_21(601)	--韦小宝离队
Cls()  --清屏
do return end
