TalkEx("小宝兄，你真强啊。这两个美眉终于被你搞定啦。", 0, 1)  --对话
Cls()  --清屏
TalkEx("那是，我自有妙计，哈哈……", 225, 0,"韦小宝")  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("能不能传授兄弟几手？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("这可不行，泡妞乃我看家本领，从不外传。不过"..JY.Person[0]["外号"].."要是需要帮忙……", 225, 0,"韦小宝")  --对话
	Cls()  --清屏
else
	TalkEx("能不能传授妹子几手？", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("这可不行，泡妞乃我看家本领，从不外传。不过"..JY.Person[0]["外号"].."要是需要帮忙……", 225, 0,"韦小宝")  --对话
	Cls()  --清屏
end
if instruct_9() then  --是否要求加入
	TalkEx("好啊，求之不得啊。", 0, 1)  --对话
	Cls()  --清屏
	if JY.Person[0]["性别"] == 0 then
		TalkEx("没有"..JY.Person[0]["外号"].."的帮忙，我也搞不到这两个如花似玉的美娇娘，哈哈，老婆们，咱也帮帮"..JY.Person[0]["外号"].."的忙，跟我去小村！", 225, 0,"韦小宝")  --对话
	else
		TalkEx("没有"..JY.Person[0]["外号"].."的帮忙，我也搞不到这两个如花似玉的美娇娘，哈哈，老婆们，咱也帮帮"..JY.Person[0]["外号"].."的忙，跟我去小村！", 225, 0,"韦小宝")  --对话
	end
	Cls()  --清屏
	instruct_3(104, 63,1,0,987,0,0,7250,7250,7250,-2,-2,-2)  --修改场景事件
	instruct_3(104, 55,1,0,988,0,0,7036,7036,7036,-2,-2,-2)  --修改场景事件
	instruct_14()  --场景变黑
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(70, 48,1,0,869,870,0,8256,8256,8256,-2,-2,-2)  --修改场景事件
	instruct_3(70, 49,1,0,187,0,0,7030,7030,7030,-2,-2,-2)  --修改场景事件
	instruct_3(70, 50,1,0,189,0,0,7036,7036,7036,-2,-2,-2)  --修改场景事件
	Cls()  --清屏
	instruct_13()  --场景变亮
	do return end  --无条件结束事件

else
	TalkEx("不必了，韦兄还是在此尽享艳福吧。", 0, 1)  --对话
	Cls()  --清屏
	do return end
end
