instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
stands()
null(-2,53)
null(-2,54)
instruct_13()  --场景变亮
local r = JYMsgBox("请选择", "是否观看并派剧情？", {"是","否"}, 2, 19)
if r == 1 then
	instruct_25(47,29,33,29)  --场景移动
	say("我五岳剑派同气连枝，百余年来携手结盟，早便如同一家。兄弟忝为五派盟主，亦已多历年所。只是近来武林中出了不少大事，兄弟与五岳剑派的前辈师兄们商量，均觉若非连成一派，统一号令，来日大难，只怕不易抵挡。", 22, 0)  --对话
	Cls()  --清屏
	say("不知左盟主和那一派的前辈师兄们商量过了？怎地我莫某人不知其事？", 20, 0)  --对话
	Cls()  --清屏
	say("兄弟适才说到，武林中出了不少大事，五派非合而为一不可。其中一件大事，便是咱们五派中人，自相残杀，不顾同盟义气。莫大先生，我嵩山派弟子费师弟，在衡山城外丧命。有人亲眼目睹，说是你莫大先生下的毒手，不知此事可真？", 22, 0)  --对话
	Cls()  --清屏
	say("并无其事！谅莫某这一点微末道行，怎杀得了那大嵩阳手？", 20, 0)  --对话
	Cls()  --清屏
	say("莫兄，这件事你也不用太过担心，等我五派合并之后，莫兄和我也是师兄弟了。死者已矣，活着的人又何必再逞凶杀，多造杀孽？莫兄，你说是不是呢？", 22, 0)  --对话
	Cls()  --清屏
	say("哼！", 20, 0)  --对话
	Cls()  --清屏
	say("南岳衡山派于并派之议，是无意见了。东岳泰山派天门道兄，贵派意思如何？", 22, 0)  --对话
	Cls()  --清屏
	say("泰山派自祖师爷东灵道长创派以来，已三百余年。贫道无德无能，不能发扬光大泰山一派，可是这三百多年的基业，说什么也不能自贫道手中断绝。并派之议，万万不能从命。", 23, 0)  --对话
	Cls()  --清屏
	say("道兄此言差矣。五派合并后我五岳派声势壮大，其下各个弟子，那一个不沾到光？道兄何必为这区区泰山派掌门一职的私心，而阻扰了全派的大业。", 22, 0)  --对话
	Cls()  --清屏
	say("我这掌门人，做不做有什么干系？只是泰山一派，恁说也不能在我手中给人并吞。", 23, 0)  --对话
	Cls()  --清屏
	say("道兄说了这么多，心中却就是为了放不下掌门人的名位。", 22, 0)  --对话
	Cls()  --清屏
	say("你真道我是如此私心？好，从此刻起，我这掌门人不做了……", 23, 0)  --对话
	Cls()  --清屏
	say("道兄是赞成此事了……", 22, 0)  --对话
	Cls()  --清屏
	say("你…………", 23, 0)  --对话
	Cls()  --清屏
	say("Ｌ＜这老道性子太急了，一被激就着了人家的道＞", 0, 1)  --对话
	Cls()  --清屏
	say("左盟主已然身为五岳剑派盟主，位望何等尊崇，何必定要并五派，由一人任掌门。", 21, 0)  --对话
	Cls()  --清屏
	say("师太此言差矣。左某只是提议五派合并。这掌门之位，当然还是要由我五派之人推举出来。", 22, 0)  --对话
	Cls()  --清屏
	--instruct_25(33,29,47,29)  --场景移动
	--instruct_30(47,29,35,29)  --人物移动
	say("Ｄ〔群众〕Ｗ比剑夺帅，比剑夺帅！谁的武功高，谁就做掌门！", 0, 2)  --对话
	Cls()  --清屏
	say("Ｄ〔群众〕Ｗ对！对！比剑夺师，比剑夺帅！", 0, 2)  --对话
	Cls()  --清屏
	say("Ｄ〔群众〕Ｗ左先生，下场去比剑啊。有什么顾忌，怕输么？", 0, 2)  --对话
	Cls()  --清屏
	say("一时嵩山绝顶之上，群雄叫嚷声越来越响，人数一多，人人跟着起哄，纵然平素极为老成持重之辈，也忍不住大叫大吵。", 0, 2)  --对话
	Cls()  --清屏
	say("各位英雄众口一辞，都愿五岳派掌门人一席，以比剑决定，我们自也不能拂逆了众位的美意。左兄，你说呢？", 19, 0)  --对话
	Cls()  --清屏
	say("Ｌ＜也只好如此了＞Ｗ好，不知哪一位先来？", 22, 0)  --对话
	Cls()  --清屏

	dark()
	addevent(-2, 64, 1, nil, nil, 4700*2)
	light()

	say("华山派岳灵珊求赐教。", 79, 0)  --对话
	Cls()  --清屏
	dark()
	light()
	say("岳灵珊连败泰山派玉音子，玉磬子，衡山派莫大先生。", 0, 2)  --对话

	say("Ｄ〔群众〕Ｗ华山派，在岳先生精心钻研之下，连泰山、衡山、恒山诸派剑法也都通晓，不但通晓，而且精绝，实令人赞叹不已。这五岳派掌门一席，若不是岳先生来担任，普天下更选不出第二位了。", 0, 2)  --对话

	say("真所谓“长江后浪推前浪”华山派岳先生为了今天，想必已筹划很久了吧。若左某也败了，我嵩山派自当奉岳先生为掌门。", 22, 0)  --对话

	dark()
	light()

	say("这……这……这……", 22, 0)  --对话

	say("Ｌ＜这岳不群使的是什么诡异武功？好像在哪见过……啊，是东方不败？＞", 0, 1)  --对话

	say("只见左冷禅只是自行舞剑，并不向岳不群进攻，情形似乎有些不对。", 0, 2)  --对话

	say("Ｄ〔群众〕Ｗ他……他眼睛瞎了！", 0, 2)  --对话

	say("我没有瞎，我没有瞎！那一个狗贼说我瞎了？", 22, 0)  --对话

	say("这时人人都看了出来，左冷禅确是双眼给岳不群刺瞎了，尽皆惊异无比。", 0, 2)  --对话

	say("左兄，你已成残废，我也不会来跟你一般见识。到了此刻，你还想跟我争这五岳派掌门吗？", 19, 0)  --对话

	say("左冷禅想到自己花了无数心血，筹划五派合并，料不到最后霸业为空，功败垂成，反中暗算，心中一酸，热血上涌，哇的一声，一口鲜血直喷出来。", 0, 2)  --对话

	say("师父，咱们一齐动手，将华山派上下斩为肉泥。", 198, 0,"嵩山弟子")  --对话

	say("大丈夫言而有信！既说是比剑夺帅，各凭本身武功争胜，岳先生武功远胜左某，大伙儿自当奉他为掌门，岂可更有异言？", 22, 0)  --对话

	say("在下与左师兄比武较艺，原盼点到为止。但左师兄武功太高，震去了在下手中长剑，危急之际，在下但求自保，下手失了分寸，以致左师兄双目受损，在下心中好生不安。咱们当寻访名医，为左师兄治疗。", 19, 0)  --对话

	say("Ｄ〔群众〕Ｗ刀剑不生眼睛，哪能保得绝无损伤。", 0, 2)  --对话

	say("Ｄ〔群众〕Ｗ阁下没有赶尽杀绝，足见仁义。", 0, 2)  --对话

	say("Ｄ〔群众〕Ｗ岳先生当五岳派掌门！", 0, 2)  --对话

	say("嗯，五岳派今日新创，百废待举，在下只能总领其事，各派的事务，还是由各派原任掌门主持。咱们五岳派今日合并，若不能和衷同济，那么五派合并云云，也只是虚名而已。在下无德无能，暂且执掌本门门户，种种兴革，还须和众位兄弟从长计议，在下不敢自专。现下天色已晚，各位都辛苦了，今天就到此为止，他日再到华山来共商大事。", 19, 0)  --对话

	say("Ｌ＜这岳不群好深的心机，说什么“君子剑”，我看倒是一个彻头彻尾的伪君子，他邀请各派上华山，也未必安了什么好心，我随后还是过去看看吧＞", 0, 1)  --对话
end
instruct_14()  --场景变黑
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(27, 53,0,0,0,0,0,2852*2,2852*2,2852*2,-2,-2,-2)  --修改场景事件
instruct_3(27, 54,0,0,4242,0,0,2853*2,2853*2,2853*2,-2,-2,-2)  --修改场景事件
instruct_3(58, 10,0,0,903,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(29, 1,0,0,905,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(31, 0,0,0,904,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
--instruct_3(57, 1,0,0,906,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
null(57,0)
null(57,1)
null(57,17)
null(57,32)
--instruct_3(57, 32,1,0,907,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
--instruct_3(81, 0,0,0,0,0,908,0,0,0,-2,-2,-2)  --修改场景事件
null(-2,64)
instruct_19(47,29)

addevent(57, 33, 0, 4245, 3)
addevent(57, 34, 0, 4245, 3)

--华山秘洞
instruct_17(81,1,13,33,1716*2)
instruct_17(81,1,13,32,1719*2)
instruct_17(81,1,13,31,1720*2)
instruct_17(81,1,13,30,1704*2)
instruct_17(81,1,14,32,0)

Cls()  --清屏
instruct_13()  --场景变亮
do return end
