if instruct_16(35) == false then  --是否在队伍
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_37(5)  --增加品德
instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,7156,7156,7156,-2,-2,-2)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,7142,7142,7142,-2,-2,-2)  --修改场景事件
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_25(48,36,21,22)  --场景移动
TalkEx("我的剑谱早已尽数交给你爹爹了，自己没私自留下一招半式，你又何必苦苦的跟着我？", 36, 0)  --对话
Cls()  --清屏
TalkEx("你老是疑心我爹爹图你的剑谱，当真好没来由。你如此损我爹爹，当我是什么人了？", 79, 0)  --对话
Cls()  --清屏
TalkEx("哼，令狐冲在福州抢到了剑谱，毕竟还是拿不去，却落入了你爹爹手中……", 36, 0)  --对话
Cls()  --清屏
TalkEx("不，不会的！爹爹说，剑谱给大师哥拿了去，我曾求他还给你，他说什么也不肯。", 79, 0)  --对话
Cls()  --清屏
TalkEx("现下说与你知，也不相干。那日在福州，那几人抢了剑谱，却被令狐冲杀死。剑谱自然是令狐冲得去了。可是当他身受重伤、昏迷不醒之际，我搜他身上，剑谱却已不知去向。剑谱既不在令狐冲身上，定是给你爹娘取了去。一回华山，我每晚都躲在你爹娘卧室之侧的悬崖上，要从他们的谈话之中，查知剑谱的所在。", 36, 0)  --对话
Cls()  --清屏
TalkEx("每天晚上？你真有毅力。", 79, 0)  --对话
Cls()  --清屏
TalkEx("为报大仇，不得不然。有一天晚上，你妈妈问你爹爹你为何要冤枉冲儿偷了我的辟邪剑谱？说那日令狐冲受伤昏迷，你妈妈替他止血治伤时，曾经看到过剑谱，第二次替他换药，那剑谱就不见了，其时令狐冲仍然昏迷未醒。那段时候除了你父母二人，并无别人进房。还说你爹爹苦心焦虑，为了保全本派。只是那辟邪剑法练之有损无益，劝你爹爹万万不要修炼。你爹爹说要听你娘的劝，找时间就设法把剑谱交给我，再慢慢想法替令狐冲洗刷清白。你娘说这剑谱于人有损，不可让我见到，让你爹爹毁去为是。你爹爹同意把剑谱毁去，然后立刻开窗把剑谱扔下天生崖，老天有眼，剑谱挂在树丫上，我捡了回来。正是我家祖传的辟邪剑谱。", 36, 0)  --对话
Cls()  --清屏
TalkEx("妈妈只道爹爹将剑谱掷入了天声峡中，其实爹爹早将剑法记熟，剑谱于他已然无用，却让你因此而学得了剑法，是不是？嗯，天意如此。冥冥之中，老天爷一切早有安排，要你由此而报你父母的仇了。那……那……那也很好，也好。", 79, 0)  --对话
Cls()  --清屏
TalkEx("你爹爹处心积虑，就是要得到这辟邪剑谱。从他派你和令狐冲去福州，到收我为徒，再把你许配于我，一起去福建，彻头彻尾都是你爹爹的阴谋，他把一切都推倒令狐冲身上，目的就是要得到我林家的辟邪剑谱。嘿嘿，君子剑，好一个君子剑！", 36, 0)  --对话
Cls()  --清屏
TalkEx("我爹爹，我爹爹，他……", 79, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜我师父，他……＞", 35, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 14,0,0,0,0,0,5206,5206,5206,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("林少侠，你们的对话在下全都听到了，岳不群那狗贼设奸计夺得了五岳盟主，左掌门在下奉嵩山左掌门之命，前来邀请林兄弟随我去见他老人家，你是福州林家辟邪剑门的唯一传人，便是辟邪剑门的掌门，左掌门自当以礼相待，好生相敬。你和他在一起，共谋报此大仇，岂不甚妙？", 198, 0,"嵩山弟子")  --对话
Cls()  --清屏
TalkEx("左掌门愿与在下结盟，在下是高攀了。岳不群设计私吞我林家辟邪剑谱，我诛杀岳不群之心，与左掌门一般无异。", 36, 0)  --对话
Cls()  --清屏
TalkEx("啊——啊~~~！你~~你~~你好狠心呀。", 79, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 13,1,0,0,0,0,5436,5436,5436,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("好，林兄弟既然杀了岳不群的女儿表明心迹，咱们这就去见左掌门。", 198, 0,"嵩山弟子")  --对话
Cls()  --清屏
TalkEx("小师妹！！！", 35, 1)  --对话
Cls()  --清屏
TalkEx("你们这两个狗贼，杀了人就要偿命。哪里走。", 0, 1)  --对话
Cls()  --清屏
if WarMain(34, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 14,1,0,0,0,0,5434,5434,5434,-2,-2,-2)  --修改场景事件
instruct_3(-2, 12,1,0,0,0,0,7144,7144,7144,-2,-2,-2)  --修改场景事件
instruct_19(22, 23)  --设置人物XY坐标
instruct_40(0)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("小师妹，小师妹，你怎么样？", 35, 0)  --对话
Cls()  --清屏
TalkEx("大师兄，我不行了……你，我对不起你……但你别，别怪小林子……他很可怜的……", 79, 0)  --对话
Cls()  --清屏
TalkEx("小师妹——！！！", 35, 0)  --对话
Cls()  --清屏
TalkEx("令狐大哥，岳姑娘已经走了，不要过度悲伤了……", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 15,1,0,0,0,0,5962,5962,5962,-2,-2,-2)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,5174,5174,5174,-2,-2,-2)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,5174,5174,5174,-2,-2,-2)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,5182,5182,5182,-2,-2,-2)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(-2, 20,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,5206,5206,5206,-2,-2,-2)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,5206,5206,5206,-2,-2,-2)  --修改场景事件
instruct_40(3)  --设置主角方向
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("令狐冲，你勾结魔教妖人，居然杀害了我女儿女婿，你们还想走么？", 19, 0)  --对话
Cls()  --清屏
TalkEx("师父！！", 35, 1)  --对话
Cls()  --清屏
TalkEx("岳不群，你这个伪君子，原来一切都是你的阴谋！", 0, 1)  --对话
Cls()  --清屏
if WarMain(56, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("这种卑鄙小人，留在世间只能危害武林，我来取他性命。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟且慢，怎么说我和他都师徒一场，请看在我的面子上饶过他吧。", 35, 0)  --对话
else
	TalkEx("妹子且慢，怎么说我和他都师徒一场，请看在我的面子上饶过他吧。", 35, 0)  --对话
end
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."如能放过在下，在下愿以此物献给"..JY.Person[0]["外号"].."。", 19, 0)  --对话
Cls()  --清屏
instruct_2(151, 1)  --得到或失去物品
Cls()  --清屏
TalkEx("原来《笑傲江湖》一书一直在你手上，岳不群，你还真是深藏不露啊。好，那就看在令狐兄弟的面子上，今天饶你不死，世间自有公道，如你以后还胡作非为，自然有人会对付你的。滚吧！", 0, 1)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(57, 1,0,0,909,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
instruct_37(5)  --增加品德
do return end
