instruct_14()  --场景变黑
instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,6078,6078,6078,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,7216,7216,7216,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,7002,7002,7002,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,7146,7146,7146,-2,-2,-2)  --修改场景事件
instruct_13()  --场景变亮
instruct_30(49,35,26,35)  --人物移动
instruct_30(26,35,26,23)  --人物移动
if JY.Person[0]["性别"] == 0 then
	TalkEx("令狐大哥，你已经找到任大小姐啦。任教主、向大哥，小弟有礼了。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("小兄弟，多日不见，近来可好？", 234, 0,"向问天")  --对话
	Cls()  --清屏
	TalkEx("哈哈，我认得你，在梅庄地牢曾与老夫比武过招，小兄弟武艺不错！老夫得以重见天日，你功劳不小啊，哈哈哈……", 26, 0)  --对话
	Cls()  --清屏
else
	TalkEx("令狐大哥，你已经找到任大小姐啦。任教主、向大哥，小妹有礼了。", 0, 1)  --对话
	Cls()  --清屏
	TalkEx("小姑娘，多日不见，近来可好？", 234, 0,"向问天")  --对话
	Cls()  --清屏
	TalkEx("哈哈，我认得你，在梅庄地牢曾与老夫比武过招，小姑娘武艺不错！老夫得以重见天日，你功劳不小啊，哈哈哈……", 26, 0)  --对话
	Cls()  --清屏
end
TalkEx("多谢任教主夸奖。", 0, 1)  --对话
Cls()  --清屏
TalkEx("…………", 35, 0)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟，你功夫这么好，不如再帮老夫一个忙。", 26, 0)  --对话
else
	TalkEx("小姑娘，你功夫这么好，不如再帮老夫一个忙。", 26, 0)  --对话
end
Cls()  --清屏
TalkEx("任教主有事尽管吩咐。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("我近日就要重上黑木崖，找那东方不败算算旧帐，小兄弟可否助我一臂之力？", 26, 0)  --对话
else
	TalkEx("我近日就要重上黑木崖，找那东方不败算算旧帐，小姑娘可否助我一臂之力？", 26, 0)  --对话
end
Cls()  --清屏
TalkEx("Ｌ＜听说日月神教教主东方不败，已练成葵花宝典，武功深不可测，这可是玩命的事啊……＞Ｗ这个……", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("哈哈哈，我不会让小兄弟白出力的，你有什么要求，尽管说吧。", 26, 0)  --对话
	Cls()  --清屏
	TalkEx("据属下所知，这位小兄弟一直在寻找十四天书。", 234, 0,"向问天")  --对话
	Cls()  --清屏
	TalkEx("哦？哈哈哈……小兄弟想做武林盟主啊，其志不小，后生可畏呀，哈哈哈……这十四天书，老夫没有，不过却知道其中一本书《笑傲江湖》的下落，如果小兄弟能帮我除掉东方不败，我就将此书下落告诉你，如何？", 26, 0)  --对话
	Cls()  --清屏
else
	TalkEx("哈哈哈，我不会让小姑娘白出力的，你有什么要求，尽管说吧。", 26, 0)  --对话
	Cls()  --清屏
	TalkEx("据属下所知，这位小姑娘一直在寻找十四天书。", 234, 0,"向问天")  --对话
	Cls()  --清屏
	TalkEx("哦？哈哈哈……小姑娘想做武林盟主啊，其志不小，后生可畏呀，哈哈哈……这十四天书，老夫没有，不过却知道其中一本书《笑傲江湖》的下落，如果小姑娘能帮我除掉东方不败，我就将此书下落告诉你，如何？", 26, 0)  --对话
	Cls()  --清屏
end
TalkEx("好，一言为定。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟果然爽快，我们四人先上黑木崖，小兄弟你也尽快赶到。", 26, 0)  --对话
	Cls()  --清屏
	TalkEx("那东方不败武功深不可测，小兄弟最好多带些武功高强的人来。", 234, 0,"向问天")  --对话
	Cls()  --清屏
else
	TalkEx("小姑娘果然爽快，我们四人先上黑木崖，小姑娘你也尽快赶到。", 26, 0)  --对话
	Cls()  --清屏
	TalkEx("那东方不败武功深不可测，小姑娘最好多带些武功高强的人来。", 234, 0,"向问天")  --对话
	Cls()  --清屏
end
TalkEx("冲哥，我爹爹找东方不败算帐，这是我们日月神教内部的事，你……你还是别去了……", 73, 0)  --对话
Cls()  --清屏
TalkEx("盈盈，对付东方不败，那是艰危之极的事，我难道能置身事外，忍心你去涉险？", 35, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，你们两个的情话还没说够啊，等铲除了东方不败，我让你们有的是时间说情话，哈哈哈……我们走！", 26, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 82,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(26, 96,0,0,0,0,0,7168,7168,7168,-2,-2,-2)  --修改场景事件
instruct_3(26, 97,0,0,0,0,0,7148,7148,7148,-2,-2,-2)  --修改场景事件
instruct_3(26, 83,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 84,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
instruct_3(26, 85,0,0,0,0,911,0,0,0,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
