instruct_26(40,17,1,0,0)  --修改场景事件
instruct_26(40,18,1,0,0)  --修改场景事件
TalkEx("参见岳掌门。", 0, 1)  --对话
Cls()  --清屏
TalkEx("哦，"..JY.Person[0]["外号"].."，是你啊，不知今日来到华山，有何贵干？", 19, 0)  --对话
Cls()  --清屏
TalkEx("在下听说《笑傲江湖》一书在岳掌门手中，可有此事？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不错，此书就在我这。", 19, 0)  --对话
Cls()  --清屏
TalkEx("那可否将此书让与在下？", 0, 1)  --对话
Cls()  --清屏
TalkEx("可以！", 19, 0)  --对话
Cls()  --清屏
TalkEx("哇，岳先生如此慷慨大度，真不愧君子剑的美名啊。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."过奖。不过今日华山派正遇到一个难题，还想请"..JY.Person[0]["外号"].."帮忙。", 19, 0)  --对话
Cls()  --清屏
TalkEx("无功不受禄，既然岳掌门答应将《笑傲江湖》一书让与在下，那在下也必会全力帮主华山派。", 0, 1)  --对话
Cls()  --清屏
TalkEx("好。"..JY.Person[0]["外号"].."可听说我五岳并派之事？", 19, 0)  --对话
Cls()  --清屏
TalkEx("听说了一些，好像下个月十五，要在嵩山开会吧？不知嵩山派的左冷禅为何要急于将五岳并派呢？", 0, 1)  --对话
Cls()  --清屏
TalkEx("左冷禅野心极大，他想要做武林中的第一人。当初当上五岳剑派盟主，那只是第一步。第二步是要将五派归一，由他自任掌门五派归一之后，实力雄厚，便可隐然与少林，武当成为鼎足而三之势。到时他会进一步蚕食昆仑，峨嵋，崆峒，青城诸派，一一将之合并。然后他向魔教挑战，率领少林，武当诸派，一举将魔教挑了，这是第四步。", 19, 0)  --对话
Cls()  --清屏
TalkEx("那岳先生要在下怎么做，尽管说吧。", 0, 1)  --对话
Cls()  --清屏
TalkEx(JY.Person[0]["外号"].."需暂时加入我华山派，在五岳并派之日，击败左冷禅，粉碎他的阴谋。", 19, 0)  --对话
Cls()  --清屏
TalkEx("哈哈哈，我以华山弟子的名义打败左冷禅，那这五岳剑派掌门的位置可就落入岳先生之手啦。", 0, 1)  --对话
Cls()  --清屏
if JY.Person[0]["性别"] == 0 then
	TalkEx("小兄弟果然聪明，我岳不群就喜欢和聪明人办事，怎么样，能助我否？", 19, 0)  --对话
else
	TalkEx("小姑娘果然聪明，我岳不群就喜欢和聪明人办事，怎么样，能助我否？", 19, 0)  --对话
end
Cls()  --清屏
TalkEx("好，我就帮你这个忙，反正我只想要天书，谁当五岳派掌门与我无关。", 0, 1)  --对话
Cls()  --清屏
instruct_37(-5)  --增加品德
TalkEx("那就一言为定。只要我当上五岳掌门，这《笑傲江湖》一书必定奉上。", 19, 0)  --对话
Cls()  --清屏
instruct_3(-2, -2,0,0,914,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(27, 34,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 33,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 32,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 31,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 30,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 29,0,0,0,0,0,5202,5202,5202,-2,-2,-2)  --修改场景事件
instruct_3(27, 38,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(27, 37,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(27, 36,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(27, 35,0,0,0,0,0,5198,5198,5198,-2,-2,-2)  --修改场景事件
instruct_3(27, 42,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(27, 41,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(27, 40,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(27, 39,0,0,0,0,0,5190,5190,5190,-2,-2,-2)  --修改场景事件
instruct_3(27, 46,0,0,0,0,0,5172,5172,5172,-2,-2,-2)  --修改场景事件
instruct_3(27, 45,0,0,0,0,0,5172,5172,5172,-2,-2,-2)  --修改场景事件
instruct_3(27, 44,0,0,0,0,0,5172,5172,5172,-2,-2,-2)  --修改场景事件
instruct_3(27, 43,0,0,0,0,0,5172,5172,5172,-2,-2,-2)  --修改场景事件
instruct_3(27, 50,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(27, 49,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(27, 48,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(27, 47,0,0,0,0,0,5180,5180,5180,-2,-2,-2)  --修改场景事件
instruct_3(27, 24,0,0,0,0,0,5232,5232,5232,-2,-2,-2)  --修改场景事件
instruct_3(27, 25,0,0,0,0,0,5230,5230,5230,-2,-2,-2)  --修改场景事件
instruct_3(27, 26,0,0,0,0,0,5228,5228,5228,-2,-2,-2)  --修改场景事件
instruct_3(27, 27,0,0,0,0,0,5226,5226,5226,-2,-2,-2)  --修改场景事件
instruct_3(27, 28,0,0,0,0,0,5234,5234,5234,-2,-2,-2)  --修改场景事件
instruct_3(27, 62,0,0,0,0,915,0,0,0,-2,-2,-2)  --修改场景事件
do return end
