instruct_3(40, 17,1,0,1034,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(40, 18,1,0,1034,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_14()  --场景变黑
instruct_3(-2, -2,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_13()  --场景变亮
instruct_25(47,29,33,29)  --场景移动
TalkEx("我五岳剑派同气连枝，百余年来携手结盟，早便如同一家。兄弟忝为五派盟主，亦已多历年所。只是近来武林中出了不少大事，兄弟与五岳剑派的前辈师兄们商量，均觉若非连成一派，统一号令，来日大难，只怕不易抵挡。", 22, 0)  --对话
Cls()  --清屏
TalkEx("不知左盟主和那一派的前辈师兄们商量过了？怎地我莫某人不知其事？", 20, 0)  --对话
Cls()  --清屏
TalkEx("兄弟适才说到，武林中出了不少大事，五派非合而为一不可。其中一件大事，便是咱们五派中人，自相残杀，不顾同盟义气。莫大先生，我嵩山派弟子费师弟，在衡山城外丧命。有人亲眼目睹，说是你莫大先生下的毒手，不知此事可真？", 22, 0)  --对话
Cls()  --清屏
TalkEx("并无其事！谅莫某这一点微末道行，怎杀得了那大嵩阳手？", 20, 0)  --对话
Cls()  --清屏
TalkEx("莫兄，这件事你也不用太过担心，等我五派合并之后，莫兄和我也是师兄弟了。死者已矣，活着的人又何必再逞凶杀，多造杀孽？莫兄，你说是不是呢？", 22, 0)  --对话
Cls()  --清屏
TalkEx("哼！", 20, 0)  --对话
Cls()  --清屏
TalkEx("南岳衡山派于并派之议，是无意见了。东岳泰山派天门道兄，贵派意思如何？", 22, 0)  --对话
Cls()  --清屏
TalkEx("泰山派自祖师爷东灵道长创派以来，已三百余年。贫道无德无能，不能发扬光大泰山一派，可是这三百多年的基业，说什么也不能自贫道手中断绝。并派之议，万万不能从命。", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄此言差矣。五派合并后我五岳派声势壮大，其下各个弟子，那一个不沾到光？道兄何必为这区区泰山派掌门一职的私心，而阻扰了全派的大业。", 22, 0)  --对话
Cls()  --清屏
TalkEx("我这掌门人，做不做有什么干系？只是泰山一派，恁说也不能在我手中给人并吞。", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄说了这么多，心中却就是为了放不下掌门人的名位。", 22, 0)  --对话
Cls()  --清屏
TalkEx("你真道我是如此私心？好，从此刻起，我这掌门人不做了。", 23, 0)  --对话
Cls()  --清屏
TalkEx("道兄是赞成此事了……", 22, 0)  --对话
Cls()  --清屏
TalkEx("你…………", 23, 0)  --对话
Cls()  --清屏
TalkEx("Ｌ＜这老道性子太急了，一被激就着了人家的道＞", 0, 1)  --对话
Cls()  --清屏
TalkEx("左盟主已然身为五岳剑派盟主，位望何等尊崇，何必定要并五派，由一人任掌门。", 21, 0)  --对话
Cls()  --清屏
TalkEx("师太此言差矣。左某只是提议五派合并。这掌门之位，当然还是要由我五派之人推举出来。", 22, 0)  --对话
Cls()  --清屏
instruct_25(33,29,47,29)  --场景移动
instruct_30(47,29,35,29)  --人物移动
TalkEx("我看别讨论了，学武之人，就在武功下见真章。来来来，有谁要跟我打？", 0, 1)  --对话
Cls()  --清屏
TalkEx("不知阁下是谁？竟擅闯我嵩山派，你不知道我五岳派在此聚会吗？", 22, 0)  --对话
Cls()  --清屏
TalkEx("这位"..JY.Person[0]["外号"].."前些时日来到我华山，我已让他入我华山派了。", 19, 0)  --对话
Cls()  --清屏
TalkEx("原来是华山派的弟子，照如此说，岳先生也是赞成这”比剑夺帅”的方法了？", 22, 0)  --对话
Cls()  --清屏
TalkEx("比剑夺帅，原也是一法，但只可点到为止，以免伤了和气。", 19, 0)  --对话
Cls()  --清屏
TalkEx("原来华山派是赞成并派的，我天门就先来领教你华山派的高招。", 23, 0)  --对话
Cls()  --清屏
if WarMain(30, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("让我定闲来领教领教华山派的高招。", 21, 0)  --对话
Cls()  --清屏
if WarMain(31, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("你连战两场，先下去休息吧。", 20, 0)  --对话
Cls()  --清屏
TalkEx("没关系，少年人体力充沛，莫掌门请出手吧。", 0, 1)  --对话
Cls()  --清屏
if WarMain(32, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("真所谓”长江后浪推前浪”华山派岳先生为了今天，想必已筹划很久了吧。若左某也败了，我嵩山派自当奉岳先生为掌门。", 22, 0)  --对话
Cls()  --清屏
if WarMain(33, 0) == false then  --战斗开始
	instruct_15()  --死亡
	Cls()  --清屏
	do return end  --无条件结束事件
	Cls()  --清屏

end
Cls()  --清屏
instruct_13()  --场景变亮
TalkEx("终于都解决了，好累。左冷禅，看来你的阴谋是无法达成了。", 0, 1)  --对话
Cls()  --清屏
TalkEx("我不该低估你的。岳不群。想不到你的心计比我还深，左某是输你一筹。", 22, 0)  --对话
Cls()  --清屏
TalkEx("嗯，五岳派今日新创，百废待举，在下只能总领其事，各派的事务，还是由各派原任掌门主持。咱们五岳派今日合并，若不能和衷同济，那么五派合并云云，也只是虚名而已。在下无德无能，暂且执掌本门门户，种种兴革，还须和众位兄弟从长计议，在下不敢自专。现下天色已晚，各位都辛苦了，今天就到此为止，他日再到华山来共商大事。", 19, 0)  --对话
Cls()  --清屏
instruct_14()  --场景变黑
instruct_3(-2, 49,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 50,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 48,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 47,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 46,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 45,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 44,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 43,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 42,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 41,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 40,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
instruct_3(27, 54,0,0,902,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(58, 10,0,0,903,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(29, 1,0,0,905,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(31, 0,0,0,904,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 1,0,0,916,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
instruct_3(57, 32,1,0,918,0,0,-2,-2,-2,-2,-2,-2)  --修改场景事件
Cls()  --清屏
instruct_13()  --场景变亮
do return end
