--function oldevent_944()
    instruct_14();   --  14(E):场景变黑
    instruct_19(16,20);   --  19(13):主角移动至10-14
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_13();   --  13(D):重新显示场景
    instruct_30(16,20,16,27);   --  30(1E):主角走动16-20--16-27
    instruct_30(16,27,21,27);   --  30(1E):主角走动16-27--21-27
    instruct_1(3799,0,2);   --  1(1):[AAA]说: 众人：武林盟主万岁！武林盟主万岁！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3800,0,1);   --  1(1):[???]说: 哇塞，这就是受人敬仰的感觉，好爽！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_14();   --  14(E):场景变黑
    instruct_13();   --  13(D):重新显示场景
	
	say("最后的场景已经开启了，请坐船前往。",255,0,"南贤");
	
	say("或者直接马车飞过去也可。",256,0,"北丑");
	
	--[[
    instruct_1(3801,195,0);   --  1(1):[???]说: 报告武林盟主，大事不好了，东方岛上有一倭国，派来大批神秘武士，企图血洗我中华武林。
    instruct_0();   --  0(0)::空语句(清屏)
    --instruct_1(3802,256,0);   --  1(1):[???]说: 我们担心的事情终于还是来了。
	say("我们担心的事情终于还是来了。",256,0,"北丑");
    instruct_0();   --  0(0)::空语句(清屏)
    --instruct_1(3803,255,0);   --  1(1):[???]说: 如今你已成为武林盟主，就请号令群雄，共同御敌吧。
	say("如今你已成为武林盟主，就请号令群雄，共同御敌吧。",255,0,"南贤");
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3804,0,1);   --  1(1):[AAA]说: 可是天下群豪真的会听我号令吗？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3805,69,0);   --  1(1):[洪七公]说: 这是关系到我们整个中华武林生死存亡的大事，不论正邪两道，都应听盟主号令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3806,60,0);   --  1(1):[欧阳锋]说: 嘿嘿，听你小子的，总比让人灭了好，既然技不如人，还有什么说的。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3807,195,0);   --  1(1):[???]说: 禀盟主，那倭人已侵占了我东海钓鱼岛，并摆下五行大阵，向我中华武林示威！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3808,0,1);   --  1(1):[AAA]说: 这五行大阵是什么东西？
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3809,57,0);   --  1(1):[黄药师]说: 哼哼，倭人小小伎俩，还敢班门弄斧？盟主，这五行大阵共分五门，东方甲乙木，南方丙丁火，西方庚辛金，北方壬癸水，中央戊己土。攻打此阵任何一门，其他门都有呼应，万难破之。惟有五门齐攻，方能克之。盟主只需兵分五路，同时进攻，必胜。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3810,0,1);   --  1(1):[AAA]说: 好，既如此，烦请东邪黄药师、北丐洪七公，率领丐帮、五岳剑派、峨嵋、昆仑、崆峒等名门大派，进攻东门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3811,69,0);   --  1(1):[洪七公]说: 老叫化得令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3812,0,1);   --  1(1):[AAA]说: 南帝一灯大师、少林寺玄慈大师、蒙古国师金轮法王、吐蕃国师鸠摩智，率领天下佛门弟子，进攻南门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3813,70,0);   --  1(1):[玄慈]说: 阿弥陀佛，老衲得令。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3814,0,1);   --  1(1):[AAA]说: 西毒欧阳先生、日月神教任先生、铁掌帮裘帮主、神龙教洪教主率领日月神教、明教、神龙教、五毒教、铁掌帮等天下各路门派帮会，进攻西门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3815,60,0);   --  1(1):[欧阳锋]说: 嘿嘿，好，邪魔外道都跟我走吧！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3816,0,1);   --  1(1):[AAA]说: 武当掌门张三丰道长、中神通王重阳道长、老顽童周伯通率领武当派、全真教等道家弟子，进攻北门。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3817,5,0);   --  1(1):[张三丰]说: 老朽领命。
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3818,0,1);   --  1(1):[???]说: 本盟主亲率众家兄弟，进攻中门。大家需求同存异，团结一心，驱逐倭寇，扬我国威！
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3819,0,2);   --  1(1):[AAA]说: 众人：求同存异，团结一心，驱逐倭寇，扬我国威！
    instruct_0();   --  0(0)::空语句(清屏)]]
	
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,73,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [73]
    instruct_3(-2,72,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [72]
    instruct_3(-2,71,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [71]
    instruct_3(-2,70,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [70]
    instruct_3(-2,69,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [69]
    instruct_3(-2,68,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [68]
    instruct_3(-2,67,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [67]
    instruct_3(-2,66,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [66]
    instruct_3(-2,65,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [65]
    instruct_3(-2,64,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [64]
    instruct_3(-2,63,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [63]
    instruct_3(-2,62,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [62]
    instruct_3(-2,61,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [61]
    instruct_3(-2,60,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [60]
    instruct_3(-2,59,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [59]
    instruct_3(-2,58,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [58]
    instruct_3(-2,57,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [57]
    instruct_3(-2,56,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [56]
    instruct_3(-2,55,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [55]
    instruct_3(-2,54,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [54]
    instruct_3(-2,53,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [53]
    instruct_3(-2,52,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [52]
    instruct_3(-2,51,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [51]
    instruct_3(-2,50,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [50]
    instruct_3(-2,49,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [49]
    instruct_3(-2,48,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [48]
    instruct_3(-2,47,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [47]
    instruct_3(-2,46,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [46]
    instruct_3(-2,45,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [45]
    instruct_3(-2,44,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [44]
    instruct_3(-2,43,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [43]
    instruct_3(-2,42,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [42]
    instruct_3(-2,41,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [41]
    instruct_3(-2,40,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [40]
    instruct_3(-2,39,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [39]
    instruct_3(-2,38,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [38]
    instruct_3(-2,37,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [37]
    instruct_3(-2,36,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [36]
    instruct_3(-2,35,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [35]
    instruct_3(-2,34,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [34]
    instruct_3(-2,33,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [33]
    instruct_3(-2,32,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [32]
    instruct_3(-2,31,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [31]
    instruct_3(-2,30,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [30]
    instruct_3(-2,29,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [29]
    instruct_3(-2,28,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [28]
    instruct_3(-2,27,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [27]
    instruct_3(-2,26,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [26]
    instruct_3(-2,25,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [25]
    instruct_3(-2,78,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [78]
    instruct_3(-2,77,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:场景事件编号 [77]
    
    --全部队友离队
	--[[
    for i,v in pairs(CC.AllPersonExit) do
      instruct_21(v[1]);   -- 离队
      
      if (type(v[2]) == "table") then		--有些有两个位置
      	for ii,vv in pairs(v[2]) do
      		instruct_3(70,vv,0,0,0,0,0,0,0,0,-2,-2,-2);		--小村消失
      	end
      else
      	instruct_3(70,v[2],0,0,0,0,0,0,0,0,-2,-2,-2);		--小村消失
      end
    end--]]
    
    instruct_39(118)
    
    instruct_13()
