--function oldevent_996()
    instruct_14();   --  14(E):场景变黑
    instruct_3(-2,-2,0,0,0,0,0,0,0,0,0,0,0);   --  3(3):修改事件定义:当前场景:当前场景事件编号
    instruct_13();   --  13(D):重新显示场景
    instruct_30(31,44,31,36);   --  30(1E):主角走动32-44--32-35
	stands()
    instruct_0();   --  0(0)::空语句(清屏)
	say("七夕快乐，"..JY.Person[0]["外号"].."有没有觉得那些秀恩爱的情侣有点过分呢？",347,0,"谢无悠");
	
if DrawStrBoxYesNo(-1, -1, "是否(Y/N)?", C_WHITE, CC.DefaultFont) then  --是/否
	
	say("是吧，我就知道，不用担心，在这里你可以尽情拆散他们。不过先去准备一下，多叫几个帮手吧。",347,0,"谢无悠");
	--[[
	say("你的，狡猾狡猾的。我们的，相互支援的，不能！",266,0,"倭寇");
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_1(3826,0,1);   --  1(1):[???]说: 哈哈哈，大胆倭人，敢来犯我中华。今日就让你们知道中国人的厉害。
    instruct_0();   --  0(0)::空语句(清屏)
	say("你的，一个人的，对手的不是！队员的，找好！",266,0,"倭寇");
    instruct_0();   --  0(0)::空语句(清屏)
	]]
    instruct_30(32,35,32,42);   --  30(1E):主角走动32-35--32-42
    instruct_40(2);   --  40(28):改变主角站立方向2
	stands()
    instruct_0();   --  0(0)::空语句(清屏)
    --instruct_1(3828,0,1);   --  1(1):[AAA]说: 大家都在摩拳擦掌，准备与倭寇一决高下。我看这样吧，每次由我来挑选队员，打过一场的人就下去休息，下一场战斗再从其他人中挑选。这第一仗该选哪些人呢？
	say("秀恩爱，死得快。大家都在摩拳擦掌，准备与这些小情侣一决高下。我看这样吧，每次由我来挑选队员，打过一场的人就下去休息，下一场战斗再从其他人中挑选。这第一仗该选哪些人呢？",0,1);
    instruct_0();   --  0(0)::空语句(清屏)
    instruct_21(50);   --  21(15):[乔峰]离队
    --全部队友离队
    for i,v in pairs(CC.AllPersonExit) do
      instruct_21(v[1]);   -- 离队      
    end
	
	do return end
end

say("哦，那就直接回去吧。",347,0,"谢无悠");
Cls()  --清屏

--畅想杨过
if JY.Base["畅想"] == 58 then
	say("终南山下，活死人墓。神雕侠侣，绝迹江湖。龙儿，我们回家吧。",0,0);
	
	instruct_62(0,0,0,0,0,0)  --游戏结束动画CG
	do return end
else
	instruct_3(-2, 39,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 38,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 37,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 36,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 35,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 34,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 33,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 32,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 31,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 30,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 29,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 28,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 27,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 26,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 25,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 24,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 23,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 22,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 21,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 20,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 19,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 18,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 17,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 16,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 15,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 14,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 13,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 12,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 11,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 10,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 9,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 8,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 7,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 6,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 5,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 4,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_3(-2, 3,0,0,0,0,0,0,0,0,0,0,0)  --修改场景事件
	instruct_19(25, 20)  --设置人物XY坐标
	instruct_40(0)  --设置主角方向
	Cls()  --清屏
	instruct_13()  --场景变亮
	instruct_66(23)  --播放音乐MIDI

	say("走进这个镜子里就可以了。",347,0,"谢无悠");
	Cls()  --清屏
	instruct_40(2)  --设置主角方向
	Cls()  --清屏
	instruct_30(25,20,25,19)  --人物移动
	instruct_30(25,19,21,19)  --人物移动
	say("回去后请不要忘了我们，有时间常来玩吧。",347,0,"谢无悠");
	Cls()  --清屏
	say("我会的。", 0, 1)  --对话
	Cls()  --清屏
	instruct_62(0,0,0,0,0,0)  --游戏结束动画CG
	do return end
end
